#include "REL/executor.h"
#include "dolphin/types.h"
#include "game/chrman.h"
#include "game/frand.h"
#include "game/memory.h"
#include "game/minigame_seq.h"
#include "game/object.h"
#include "game/objsub.h"
#include "game/wipe.h"

#include "game/gamework.h"
#include "game/gamework_data.h"

#include "game/mapspace.h"
#include "game/pad.h"
#include "game/printfunc.h"

#include "game/hsfanim.h"
#include "game/hsfdraw.h"
#include "game/hsfman.h"
#include "game/hsfmotion.h"

#include "game/esprite.h"
#include "game/sprite.h"

#include "ext_math.h"

#include "string.h"

#ifndef __MWERKS__
#include "game/audio.h"
#include "game/hsfex.h"

void HuSysVWaitSet(s16 vcount);
#endif

#undef ABS
#define ABS(x) ((0 > (x)) ? -(x) : (x))

typedef struct unk_bss_5D0_struct {
    /* 0x00 */ u16 unk00;
    /* 0x02 */ s16 unk02;
    /* 0x04 */ struct unk_bss_5D0_struct *unk04;
    /* 0x08 */ struct unk_bss_5D0_struct *unk08;
} UnkBss5D0Struct; // Size 0xC

typedef struct unk_bss_5B8_struct {
    /* 0x00 */ HsfanimStruct00 *unk00;
    /* 0x04 */ s32 *unk04;
    /* 0x08 */ s32 unk08;
    /* 0x0C */ s32 unk0C;
    /* 0x10 */ struct unk_bss_5B8_struct *unk10;
    /* 0x14 */ struct unk_bss_5B8_struct *unk14;
} UnkBss5B8Struct; // Size 0x18

typedef struct {
    /* 0x00 */ u32 unk00;
    /* 0x04 */ s16 unk04;
} UnkBss428Struct; // Size 8

UnkBss5D0Struct lbl_1_bss_5D0;
UnkBss5B8Struct lbl_1_bss_5B8;
Process *lbl_1_bss_5B4;
Vec lbl_1_bss_5A8;
Vec lbl_1_bss_59C;
Vec lbl_1_bss_590;
Vec lbl_1_bss_584;
u32 lbl_1_bss_580;
s32 lbl_1_bss_57C;
u32 lbl_1_bss_578; // TODO maybe array?
s16 lbl_1_bss_576;
s16 lbl_1_bss_574;
s32 lbl_1_bss_570;
s32 lbl_1_bss_56C;
float lbl_1_bss_568;
s32 lbl_1_bss_528[16];
UnkBss428Struct lbl_1_bss_428[32];

void fn_1_0(void)
{
    lbl_1_bss_5D0.unk04 = NULL;
    lbl_1_bss_5D0.unk08 = NULL;
}

void fn_1_24(u16 arg0, s16 arg1)
{
    UnkBss5D0Struct *temp_r31;
    UnkBss5D0Struct *temp_r30;
    UnkBss5D0Struct *temp_r29;

    temp_r31 = HuMemDirectMallocNum(HEAP_SYSTEM, sizeof(*temp_r31), MEMORY_DEFAULT_NUM);
    temp_r31->unk00 = arg0;
    temp_r31->unk02 = arg1;
    temp_r30 = &lbl_1_bss_5D0;
    temp_r29 = temp_r30->unk08;
    temp_r30->unk08 = temp_r31;
    if (NULL != temp_r29) {
        temp_r29->unk04 = temp_r31;
    }
    temp_r31->unk04 = temp_r30;
    temp_r31->unk08 = temp_r29;
}

s16 fn_1_AC(s16 arg0)
{
    UnkBss5D0Struct *var_r31;
    UnkBss5D0Struct *temp_r29;
    UnkBss5D0Struct *temp_r30;
    s16 temp_r28;

    var_r31 = lbl_1_bss_5D0.unk08;
    while (NULL != var_r31) {
        if (arg0 == var_r31->unk00) {
            temp_r28 = var_r31->unk02;
            temp_r29 = var_r31->unk04;
            temp_r30 = var_r31->unk08;
            temp_r29->unk08 = temp_r30;
            if (NULL != temp_r30) {
                temp_r30->unk04 = temp_r29;
            }
            HuMemDirectFree(var_r31);
            return temp_r28;
        }
        var_r31 = var_r31->unk08;
    }
    return -1;
}

void fn_1_150(void)
{
    lbl_1_bss_5B8.unk10 = NULL;
    lbl_1_bss_5B8.unk14 = NULL;
}

void fn_1_174(s16 arg0, HsfanimStruct00 *arg1, s32 arg2, s32 arg3, s32 arg4, Vec *arg5, u8 arg6)
{
    UnkBss5B8Struct *temp_r27;
    UnkBss5B8Struct *var_r31;
    UnkBss5B8Struct *temp_r28;
    s32 i;

    var_r31 = HuMemDirectMallocNum(HEAP_SYSTEM, sizeof(*var_r31), MEMORY_DEFAULT_NUM);
    var_r31->unk00 = arg1;
    var_r31->unk08 = arg3;
    var_r31->unk0C = arg4;
    var_r31->unk04 = HuMemDirectMallocNum(HEAP_SYSTEM, arg4 * sizeof(*var_r31->unk04), MEMORY_DEFAULT_NUM);
    for (i = 0; i < arg4; i++, arg5++) {
        var_r31->unk04[i] = Hu3DParManLink(arg0, arg1);
        if (var_r31->unk04[i] >= 0) {
            Hu3DParManAttrReset(var_r31->unk04[i], 1);
            Hu3DParManPosSet(var_r31->unk04[i], arg5->x, arg5->y, arg5->z);
            Hu3DParticleBlendModeSet(Hu3DParManModelIDGet(var_r31->unk04[i]), arg6);
            Hu3DModelLayerSet(Hu3DParManModelIDGet(var_r31->unk04[i]), arg2);
        }
    }
    temp_r28 = &lbl_1_bss_5B8;
    temp_r27 = temp_r28->unk14;
    temp_r28->unk14 = var_r31;
    if (NULL != temp_r27) {
        temp_r27->unk10 = var_r31;
    }
    var_r31->unk10 = temp_r28;
    var_r31->unk14 = temp_r27;
}

void fn_1_2D8(void)
{
    UnkBss5B8Struct *var_r31;
    UnkBss5B8Struct *temp_r28;
    UnkBss5B8Struct *temp_r29;
    s32 i;

    var_r31 = lbl_1_bss_5B8.unk14;
    while (NULL != var_r31) {
        var_r31->unk08--;
        if (var_r31->unk08 == 0) {
            for (i = 0; i < var_r31->unk0C; i++) {
                if (var_r31->unk04[i] >= 0) {
                    Hu3DParManAttrSet(var_r31->unk04[i], 1);
                }
            }
        }
        temp_r28 = var_r31->unk10;
        temp_r29 = var_r31->unk14;
        if (-var_r31->unk00->unk00 > var_r31->unk08) {
            for (i = 0; i < var_r31->unk0C; i++) {
                if (var_r31->unk04[i] >= 0) {
                    Hu3DParManKill(var_r31->unk04[i]);
                }
            }
            temp_r28->unk14 = temp_r29;
            if (NULL != temp_r29) {
                temp_r29->unk10 = temp_r28;
            }
            HuMemDirectFree(var_r31->unk04);
            HuMemDirectFree(var_r31);
        }
        var_r31 = temp_r29;
    }
}

void fn_1_414(void)
{
    s32 i;

    for (i = 0; i < 32; i++) {
        lbl_1_bss_428[i].unk00 = 0;
        lbl_1_bss_428[i].unk04 = -1;
    }
}

s16 fn_1_46C(s32 arg0)
{
    s32 i;

    for (i = 0; i < 32; i++) {
        if (arg0 == lbl_1_bss_428[i].unk00) {
            return Hu3DModelLink(lbl_1_bss_428[i].unk04);
        }
    }
    for (i = 0; i < 32; i++) {
        if (lbl_1_bss_428[i].unk00 == 0) {
            lbl_1_bss_428[i].unk00 = arg0;
            lbl_1_bss_428[i].unk04 = Hu3DModelCreateFile(arg0);
            return lbl_1_bss_428[i].unk04;
        }
    }
    return Hu3DModelCreateFile(arg0);
}

void fn_1_580(s32 *arg0, s32 arg1, s32 arg2)
{
    s32 var_r30;

    espBankSet(arg0[arg1 + 1], 10);
    espBankSet(arg0[arg1 + 4], 11);
    if (600 * REFRESH_RATE <= arg2) {
        arg2 = 600 * REFRESH_RATE - 1;
    }
    var_r30 = arg2 / (60 * REFRESH_RATE);
    arg2 -= var_r30 * (60 * REFRESH_RATE);
    if (var_r30 > 9) {
        var_r30 = 9;
    }
    espBankSet(arg0[arg1], var_r30);
    var_r30 = arg2 / REFRESH_RATE;
    arg2 -= var_r30 * REFRESH_RATE;
    espBankSet(arg0[arg1 + 2], var_r30 / 10);
    espBankSet(arg0[arg1 + 3], var_r30 % 10);
    var_r30 = 101.5f * arg2 / REFRESH_RATE;
    espBankSet(arg0[arg1 + 5], var_r30 / 10);
    espBankSet(arg0[arg1 + 6], var_r30 % 10);
}

void fn_1_798(s32 arg0)
{
    lbl_1_bss_568 = 0.0f;
    lbl_1_bss_578 = lbl_1_bss_57C;
    GWMGRecordSet(arg0, lbl_1_bss_578);
    fn_1_580(lbl_1_bss_528, 7, lbl_1_bss_57C);
}

void fn_1_9EC(void)
{
    s32 i;

    for (i = 0; i < 16; i++) {
        espDispOn(lbl_1_bss_528[i]);
    }
}

void fn_1_A40(void)
{
    float temp_f31;
    s32 i;

    if (0.0f <= lbl_1_bss_568) {
        lbl_1_bss_568 += 16.0f;
        temp_f31 = 1.0 + 0.2f * sind(lbl_1_bss_568);
        for (i = 7; i <= 14; i++) {
            espScaleSet(lbl_1_bss_528[i], temp_f31, temp_f31);
        }
    }
}

void fn_1_B4C(float arg0, s32 arg1)
{
    float temp_f30;
    float temp_f31;
    s32 i;

    temp_f31 = 288.0f;
    temp_f30 = arg0;
    lbl_1_bss_528[15] = espEntry(arg1, 0, 0);
    espTPLvlSet(lbl_1_bss_528[15], 0.5f);
    espColorSet(lbl_1_bss_528[15], 0, 0, 0);
    espPosSet(lbl_1_bss_528[15], temp_f31, temp_f30);
    temp_f31 = 248.0f;
    temp_f30 = arg0 - 8.0f;
    lbl_1_bss_528[14] = espEntry(DATA_MAKE_NUM(DATADIR_MGCONST, 55), 0, 0);
    espPosSet(lbl_1_bss_528[14], temp_f31 - 18.0f, temp_f30);
    for (i = 7; i <= 13; i++) {
        lbl_1_bss_528[i] = espEntry(DATA_MAKE_NUM(DATADIR_MGCONST, 48), 0, 0);
        espPosSet(lbl_1_bss_528[i], temp_f31, temp_f30);
        temp_f31 += 16.0f;
    }
    fn_1_580(lbl_1_bss_528, 7, lbl_1_bss_578);
    temp_f31 = 248.0f;
    temp_f30 = arg0 + 8.0f;
    for (i = 0; i <= 6; i++) {
        lbl_1_bss_528[i] = espEntry(DATA_MAKE_NUM(DATADIR_MGCONST, 49), 0, 0);
        espPosSet(lbl_1_bss_528[i], temp_f31, temp_f30);
        temp_f31 += 16.0f;
    }
    fn_1_580(lbl_1_bss_528, 0, 0);
    for (i = 0; i < 16; i++) {
        espDrawNoSet(lbl_1_bss_528[i], 0);
        espDispOff(lbl_1_bss_528[i]);
        espAttrSet(lbl_1_bss_528[i], HUSPR_ATTR_NOANIM);
        espPriSet(lbl_1_bss_528[i], 0x80 + i);
    }
}

void fn_1_11F4(float arg0, Vec *arg1, Vec *arg2, Vec *arg3)
{
    float temp_f31;

    if (1.0f < arg0) {
        arg0 = 1.0f;
    }
    temp_f31 = sind(90.0f * arg0) * sind(90.0f * arg0);
    arg3->x = arg1->x + temp_f31 * (arg2->x - arg1->x);
    arg3->y = arg1->y + temp_f31 * (arg2->y - arg1->y);
    arg3->z = arg1->z + temp_f31 * (arg2->z - arg1->z);
}

void fn_1_1350(Vec *arg0, Vec *arg1, Vec *arg2)
{
    Hu3DCameraPosSetV(1, arg0, arg1, arg2);
    lbl_1_bss_5A8 = *arg0;
    lbl_1_bss_590 = *arg2;
}

s32 fn_1_13DC(float arg0, Vec *arg1)
{
    Vec sp18;
    Vec spC;

    fn_1_11F4(arg0, &lbl_1_bss_5A8, &lbl_1_bss_59C, &sp18);
    fn_1_11F4(arg0, &lbl_1_bss_590, &lbl_1_bss_584, &spC);
    Hu3DCameraPosSetV(1, &sp18, arg1, &spC);
    if (1.0f <= arg0) {
        return 1;
    }
    else {
        lbl_1_bss_56C = 1;
        return 0;
    }
}

void fn_1_1710(float arg0, Vec *arg1)
{
    Vec sp18;
    Vec spC;

    fn_1_11F4(arg0, &lbl_1_bss_5A8, &lbl_1_bss_59C, &sp18);
    fn_1_11F4(arg0, &lbl_1_bss_590, &lbl_1_bss_584, &spC);
    fn_1_1350(&sp18, arg1, &spC);
    lbl_1_bss_56C = 1;
}

void fn_1_1A60(Vec *arg0, s16 arg1, Vec *arg2)
{
    Mtx sp1C;
    Vec sp10;
    float temp_f30;
    float temp_f29;
    float temp_f28;
    float temp_f31;
    CameraData *temp_r31;
    s32 i;

    for (i = 0; i < 16; i++) {
        if (arg1 & (1 << i)) {
            break;
        }
    }
    temp_r31 = &Hu3DCamera[i];
    MTXLookAt(sp1C, &temp_r31->pos, &temp_r31->up, &temp_r31->target);
    MTXMultVec(sp1C, arg0, &sp10);
    temp_f30 = sp10.z * (sind(temp_r31->fov / 2) / cosd(temp_r31->fov / 2)) * temp_r31->aspect;
    temp_f29 = sp10.z * (sind(temp_r31->fov / 2) / cosd(temp_r31->fov / 2));
    temp_f28 = 0.9f * temp_r31->viewport_x;
    temp_f31 = 0.9f * temp_r31->viewport_w;
    arg2->x = temp_f31 / 2 + sp10.x * ((temp_f31 / 2) / -temp_f30) + temp_f28;
    arg2->y = temp_r31->viewport_h / 2 + sp10.y * ((temp_r31->viewport_h / 2) / temp_f29) + temp_r31->viewport_y;
    arg2->z = 0.0f;
}

void fn_1_1D18(s16 arg0, char *arg1, Vec *arg2)
{
    Mtx sp10;

    Hu3DModelObjMtxGet(arg0, arg1, sp10);
    arg2->x = sp10[0][3];
    arg2->y = sp10[1][3];
    arg2->z = sp10[2][3];
}

void fn_1_1D70(s16 arg0, char *arg1, Vec *arg2, Mtx arg3)
{
    Mtx spC;
    ModelData *var_r30;

    var_r30 = &Hu3DData[arg0];
    Hu3DModelObjMtxGet(arg0, arg1, spC);
    MTXConcat(var_r30->unk_F0, spC, spC);
    if (NULL != arg3) {
        MTXCopy(spC, arg3);
    }
    arg2->x = spC[0][3];
    arg2->y = spC[1][3];
    arg2->z = spC[2][3];
}

float fn_1_1E20(float arg0, float arg1, float arg2)
{
    float var_f31;
    float var_f30;

    var_f31 = fmod(arg1 - arg0, 360.0);
    if (0.0f > var_f31) {
        var_f31 += 360.0f;
    }
    if (180.0f < var_f31) {
        var_f31 -= 360.0f;
    }
    var_f30 = fmod(arg0 + var_f31 * arg2, 360.0);
    if (0.0f > var_f30) {
        var_f30 += 360.0f;
    }
    return var_f30;
}

void fn_1_1F24(s32 arg0)
{
    lbl_1_bss_570 = HuAudSeqPlay(arg0);
}

void fn_1_1F58(s32 arg0)
{
    if (lbl_1_bss_570 >= 0) {
        if (arg0 < 0) {
            arg0 = 1000;
        }
        HuAudSeqFadeOut(lbl_1_bss_570, arg0);
    }
    lbl_1_bss_570 = -1;
}

void fn_1_1FC4(Vec *arg0, float *arg1, s32 arg2, s32 arg3)
{
    Vec sp18;
    float var_f28;
    s32 var_r30;

    sp18.x = 0.0f;
    sp18.y = 0.0f;
    sp18.z = 0.0f;
    sp18.x = arg2 / 4.0f;
    sp18.z = -(float)arg3 / 4.0f;
    var_r30 = 0;
    var_f28 = VECMagXZ(&sp18);
    if (0.5f <= var_f28) {
        if (10.0f <= var_f28) {
            sp18.x /= var_f28;
            sp18.z /= var_f28;
            var_f28 = 10.0f;
            sp18.x = 10.0f * sp18.x;
            sp18.z = 10.0f * sp18.z;
        }
        *arg1 = fn_1_1E20(*arg1, atan2d(sp18.x, sp18.z), 0.4f);
        if (8.0f <= var_f28) {
            var_r30 = 2;
        }
        else {
            var_r30 = 1;
        }
    }
    VECAdd((Vec *)&arg0, &sp18, (Vec *)&arg0);
}

s16 lbl_1_data_0[8] = { 0, 1, 2, 3, 4, 5, 6, 7 };
s32 lbl_1_data_10[8] = { 0, 1, 2, 3, 4, 5, 6, 7 };
float lbl_1_data_30[0xA] = { 70.0f, 70.0f, 70.0f, 70.0f, 70.0f, 70.0f, 70.0f, 70.0f, 70.0f, 100.0f };
float lbl_1_data_58[0xA] = {
    150.0f,
    170.0f,
    190.0f,
    170.0f,
    160.0f,
    150.0f,
    180.0f,
    200.0f,
    150.0f,
    200.0f,
};

// these are copied from m461Dll/main.c
typedef void (*PlayerOldHook)(omObjData *obj);
typedef Vec *(*PlayerOldPosHook)(omObjData *obj);

typedef struct work_playerold {
    omObjData *unk_00;
    PlayerOldHook unk_04;
    PlayerOldPosHook unk_08;
    PlayerOldHook unk_0C;
    PlayerOldHook unk_10;
    s32 *unk_14;
    s32 unk_18;
    s32 unk_1C;
    s32 unk_20;
    s32 unk_24;
    s32 unk_28;
    s32 unk_2C;
    s32 unk_30;
    s32 unk_34;
    s32 unk_38;
    s32 unk_3C;
    s32 unk_40;
    s32 unk_44;
    s32 unk_48;
    s32 unk_4C;
    Vec *unk_50;
    Vec unk_54;
    float unk_60;
    s32 unk_64;
    Vec *unk_68;
    Vec unk_6C;
    Vec unk_78;
    Vec unk_84;
    Vec unk_90;
    float unk_9C;
    float unk_A0;
    float unk_A4;
    float unk_A8;
    Vec unk_AC;
    float unk_B8;
    float unk_BC;
    float unk_C0;
} WorkPlayerOld;

typedef WorkPlayerOld *(*PlayerOldFind)(int no);

PlayerOldFind lbl_1_bss_424;
float lbl_1_bss_420;

void fn_1_23B4(WorkPlayerOld *player)
{
    s32 i;
    for (i = 0; i < 8; i++) {
        if (player->unk_44 == player->unk_14[i]) {
            player->unk_40 = lbl_1_data_10[i];
            return;
        }
    }
    player->unk_40 = -1;
}

void fn_1_2418(float *minDist, s32 *state, s32 stateNew, Vec *posA, float aYOfs, Vec *posB, float bYOfs)
{
    Vec pointA = *posA;
    Vec pointB = *posB;
    float dist;
    pointA.y += aYOfs;
    pointB.y += bYOfs;
    dist = VECDistance(&pointA, &pointB);
    if (*minDist > dist) {
        *minDist = dist;
        *state = stateNew;
    }
}

void fn_1_24F8(WorkPlayerOld *player1, WorkPlayerOld *player2, float *minDist, s32 *state)
{
    *minDist = 10 * (player1->unk_BC + player2->unk_BC);
    fn_1_2418(minDist, state, 0, &player1->unk_6C, player1->unk_BC, &player2->unk_6C, player2->unk_BC);
    fn_1_2418(minDist, state, 1, &player1->unk_6C, player1->unk_C0 - player1->unk_BC, &player2->unk_6C, player2->unk_C0 - player2->unk_BC);
    fn_1_2418(minDist, state, 2, &player1->unk_6C, player1->unk_BC, &player2->unk_6C, player2->unk_C0 - player2->unk_BC);
    fn_1_2418(minDist, state, 3, &player1->unk_6C, player1->unk_C0 - player1->unk_BC, &player2->unk_6C, player2->unk_BC);
}

s32 fn_1_2824(WorkPlayerOld *player, WorkPlayerOld *player2)
{
    Vec dir;
    Vec dir2;
    float dist;

    player->unk_3C |= 0x1;
    player->unk_90.x = player->unk_20 / 4.0f;
    player->unk_90.z = -(float)player->unk_24 / 4.0f;
    if (player->unk_90.x != 0.0f || player->unk_90.z != 0.0f) {
        return;
    }
    VECSubtract(&player->unk_6C, &player2->unk_6C, &dir);
    dist = VECMagXZ(&dir);
    if (0.0f == dist) {
        dir.x = 0;
        dir.z = -1;
    }
    else {
        dir.x /= dist;
        dir.z /= dist;
    }
    VECSubtract(&player->unk_6C, &player->unk_78, &dir2);
    dist = VECMagXZ(&dir2);
    if (5 > dist) {
        dist = 5;
    }
    player->unk_90.x = dir.x * dist;
    player->unk_90.z = dir.z * dist;
}

void fn_1_2BD0(WorkPlayerOld *player, float arg1, float arg2)
{
    player->unk_38 = 1;
    player->unk_84.y = arg1;
    player->unk_A4 = arg2;
    if (player->unk_3C & 0x2) {
        player->unk_3C &= ~0x2;
    }
}

void fn_1_2C00(PlayerOldFind find, float yDist)
{
    lbl_1_bss_424 = find;
    lbl_1_bss_420 = yDist;
}

void fn_1_2C1C(WorkPlayerOld *player, omObjData *obj, s32 arg2, s32 arg3, s32 *arg4, s32 arg5, Vec *pos, float arg7)
{
    player->unk_00 = obj;
    player->unk_18 = arg2;
    player->unk_1C = arg3;
    player->unk_14 = arg4;
    player->unk_04 = NULL;
    player->unk_08 = NULL;
    player->unk_0C = NULL;
    player->unk_10 = NULL;
    player->unk_50 = NULL;
    player->unk_64 = 0;
    player->unk_68 = 0;
    player->unk_38 = 0;
    player->unk_3C = 0;
    player->unk_44 = arg5;
    player->unk_48 = 0;
    player->unk_4C = 0;
    fn_1_23B4(player);
    player->unk_9C = arg7;
    player->unk_6C = *pos;
    player->unk_78 = *pos;
    player->unk_84.x = 0;
    player->unk_84.y = 0;
    player->unk_84.z = 0;
    player->unk_B8 = 1;
    player->unk_A8 = 0;
    player->unk_BC = lbl_1_data_30[player->unk_1C];
    player->unk_C0 = lbl_1_data_58[player->unk_1C];
}

void fn_1_2DA8(WorkPlayerOld *player, PlayerOldHook func)
{
    player->unk_04 = func;
}

void fn_1_2DB0(WorkPlayerOld *player, PlayerOldPosHook func)
{
    player->unk_08 = func;
}

void fn_1_2DB8(WorkPlayerOld *player, PlayerOldHook func)
{
    player->unk_0C = func;
}

void fn_1_2DC0(WorkPlayerOld *player, PlayerOldHook func)
{
    player->unk_10 = func;
}

void fn_1_2DC8(WorkPlayerOld *player, s32 count, Vec *data)
{
    player->unk_64 = count;
    player->unk_68 = data;
}

void fn_1_2DD4(WorkPlayerOld *player)
{
    omSetTra(player->unk_00, player->unk_6C.x, player->unk_6C.y, player->unk_6C.z);
    omSetRot(player->unk_00, 0.0f, player->unk_9C, 0.0f);
}

void fn_1_2E34(WorkPlayerOld *player)
{
    BOOL addTime;
    s32 i;
    player->unk_3C &= ~0x100;
    if (player->unk_3C & 0x8) {
        return;
    }
    if (NULL == lbl_1_bss_424) {
        return;
    }
    addTime = FALSE;
    for (i = 0; i < 4; i++) {
        WorkPlayerOld *player2 = lbl_1_bss_424(i);
        BOOL fixPos;
        float minDist;
        s32 state;
        if (player == player2) {
            continue;
        }
        if (player2->unk_3C & 0x8) {
            continue;
        }
        fixPos = FALSE;
        fn_1_24F8(player, player2, &minDist, &state);
        if (minDist < player->unk_BC + player2->unk_BC) {
            if (state < 2) {
                fixPos = TRUE;
                if (player->unk_38 == 1) {
                    fn_1_2824(player, player2);
                }
            }
            else {
                if (state == 2 && player->unk_38 == 1) {
                    fn_1_2824(player, player2);
                    player->unk_3C |= 0x100;
                    player->unk_A4 = 0;
                    if (!(player2->unk_3C & 0x100)) {
                        player->unk_84.y = 26.766666f;
                    }
                }
                if (state == 3) {
                    fixPos = TRUE;
                    if (player->unk_38 == 1) {
                        if (0.0f < player->unk_84.y) {
                            player->unk_84.y = 0.0f;
                        }
                        player->unk_A4 = 0;
                    }
                }
            }
        }
        if (fixPos) {
            Vec dir;
            addTime = TRUE;
            VECSubtract(&player->unk_6C, &player2->unk_6C, &dir);
            if (0.0f == minDist) {
                dir.x = 0;
                dir.z = -1;
            }
            else {
                dir.x /= minDist;
                dir.z /= minDist;
            }
            player->unk_6C.x = player2->unk_6C.x + (dir.x * (player->unk_BC + player2->unk_BC));
            player->unk_6C.z = player2->unk_6C.z + (dir.z * (player->unk_BC + player2->unk_BC));
        }
    }
    if (addTime) {
        player->unk_4C++;
    }
    else {
        player->unk_4C = 0;
    }
}

float fn_1_39C4(WorkPlayerOld *player, float arg2)
{
    Vec *pos;
    s32 i;
    AddX = 0.0f;
    AddZ = 0.0f;
    MapWall(player->unk_BC, player->unk_6C.x, arg2 + player->unk_BC, player->unk_6C.z);
    player->unk_6C.x += AddX;
    player->unk_6C.z += AddZ;
    if (NULL != player->unk_68) {
        for (pos = player->unk_68, i = 0; i < player->unk_64; i++, pos += 2) {
            int num = 0;
            if (pos[0].x == pos[1].x || pos[0].x > player->unk_6C.x || pos[1].x < player->unk_6C.x) {
                num++;
            }
            if (pos[0].y == pos[1].y || pos[0].y > player->unk_6C.y || pos[1].y < player->unk_6C.y) {
                num++;
            }
            if (pos[0].z == pos[1].z || pos[0].z > player->unk_6C.z || pos[1].z < player->unk_6C.z) {
                num++;
            }
            if (num == 3) {
                if (pos[0].x != pos[1].x) {
                    if (pos[0].x > player->unk_6C.x) {
                        player->unk_6C.x = pos[0].x + player->unk_BC;
                    }
                    if (pos[1].x < player->unk_6C.x) {
                        player->unk_6C.x = pos[1].x - player->unk_BC;
                    }
                }
                if (pos[0].y != pos[1].y) {
                    if (pos[0].y > player->unk_6C.y) {
                        player->unk_6C.y = pos[0].y;
                    }
                    if (pos[1].y < player->unk_6C.y) {
                        player->unk_6C.y = pos[1].y;
                    }
                }
                if (pos[0].z != pos[1].z) {
                    if (pos[0].z > player->unk_6C.z) {
                        player->unk_6C.z = pos[0].z + player->unk_BC;
                    }
                    if (pos[1].z < player->unk_6C.z) {
                        player->unk_6C.z = pos[1].z - player->unk_BC;
                    }
                }
            }
        }
    }
    return ABS(AddX) + ABS(AddZ);
}

void fn_1_3CE0(WorkPlayerOld *player, s32 *state, u32 *motAttr)
{
    *motAttr = HU3D_MOTATTR_LOOP;
    *state = 0;
    if (0.5f <= player->unk_A0) {
        if (7.0f <= player->unk_A0) {
            *state = 2;
        }
        else {
            *state = 1;
        }
    }

    if (player->unk_14[3] >= 0 && (player->unk_28 & 0x100)) {
        fn_1_2BD0(player, 26.766666f, 1);
        *motAttr = HU3D_MOTATTR_NONE;
        *state = 3;
    }
}

void fn_1_3DB8(WorkPlayerOld *player, s32 *state, u32 *motAttr)
{
    if (0.0f < player->unk_A4) {
        if (player->unk_2C & 0x100) {
            player->unk_A4++;
            if (4.0f < player->unk_A4) {
                player->unk_A4 = 0;
            }
            else {
                player->unk_84.y += 3.65f;
            }
        }
        else {
            player->unk_A4 = 0;
        }
    }
    player->unk_84.y += -2.4333334f;
    if (player->unk_14[5] >= 0 && (player->unk_28 & 0x140)) {
        player->unk_38 = 3;
        player->unk_84.y = 0;
        player->unk_3C &= ~0x3;
        player->unk_3C |= 0x4;
        *motAttr = HU3D_MOTATTR_NONE;
        *state = 5;
    }
}

void fn_1_3ECC(WorkPlayerOld *player, s32 *state, u32 *motAttr)
{
    if ((player->unk_3C & 0x1000) || Hu3DMotionEndCheck(player->unk_00->model[0])) {
        player->unk_3C &= ~0x3;
        if (player->unk_40 == 6) {
            player->unk_38 = 4;
            *motAttr = HU3D_MOTATTR_NONE;
            *state = 7;
        }
        else {
            player->unk_38 = 0;
            *motAttr = HU3D_MOTATTR_LOOP;
            *state = 0;
        }
    }
}

void fn_1_3F84(WorkPlayerOld *player, s32 *state, u32 *motAttr)
{
    if (Hu3DMotionShiftIDGet(player->unk_00->model[0]) < 0 && Hu3DMotionEndCheck(player->unk_00->model[0])) {
        fn_1_2BD0(player, 0.0f, 0.0f);
    }
}

void fn_1_4024(WorkPlayerOld *player, s32 *state, u32 *motAttr)
{
    if (Hu3DMotionShiftIDGet(player->unk_00->model[0]) < 0 && Hu3DMotionEndCheck(player->unk_00->model[0])) {
        player->unk_3C &= ~0x4;
        player->unk_38 = 0;
        *motAttr = HU3D_MOTATTR_LOOP;
        *state = 0;
    }
}

void fn_1_40C0(WorkPlayerOld *player)
{
    u32 motAttr = HU3D_MOTATTR_NONE;
    s32 state = -1;
    float temp_f28;
    float temp_f23;
    float temp_f22;
    Vec *pos;
    BOOL temp_r27;
    if (player->unk_3C & 0x1) {
        player->unk_84.x = player->unk_90.x;
        player->unk_84.z = player->unk_90.z;
    }
    else {
        player->unk_84.x = player->unk_20 / 4.0f;
        player->unk_84.z = -(float)player->unk_24 / 4.0f;
        if (player->unk_38 == 1 && 0.0f == player->unk_84.x && 0.0f == player->unk_84.z) {
            player->unk_84.x = 0.98f * (player->unk_6C.x - player->unk_78.x);
            player->unk_84.z = 0.98f * (player->unk_6C.z - player->unk_78.z);
        }
        if (player->unk_3C & 0x14) {
            player->unk_84.x = 0;
            player->unk_84.z = 0;
            player->unk_28 = 0;
        }
    }
    player->unk_78 = player->unk_6C;
    player->unk_A0 = VECMagXZ(&player->unk_84);
    if (0.5f <= player->unk_A0) {
        if (10.0f <= player->unk_A0) {
            player->unk_84.x /= player->unk_A0;
            player->unk_84.z /= player->unk_A0;
            player->unk_A0 = 10;
            player->unk_84.x = 10 * player->unk_84.x;
            player->unk_84.z = 10 * player->unk_84.z;
        }
    }
    else {
        player->unk_84.x = 0;
        player->unk_84.z = 0;
        player->unk_A0 = 0;
    }
    player->unk_84.x *= player->unk_B8;
    player->unk_84.z *= player->unk_B8;
    player->unk_A0 *= player->unk_B8;
    if (player->unk_3C & 0x800) {
        player->unk_28 |= 0x100;
        player->unk_2C |= 0x100;
        if (player->unk_38 == 1) {
            if (0.0f == player->unk_A4) {
                player->unk_3C &= ~0x800;
            }
        }
    }
    switch (player->unk_38) {
        case 0:
            fn_1_3CE0(player, &state, &motAttr);
            break;

        case 1:
            fn_1_3DB8(player, &state, &motAttr);
            break;

        case 2:
            fn_1_3ECC(player, &state, &motAttr);
            break;

        case 3:
            fn_1_3F84(player, &state, &motAttr);
            break;

        case 4:
            fn_1_4024(player, &state, &motAttr);
            break;

        default:
            OSReport("*** player action error(%d)!!\n", player->unk_38);
            break;
    }
    if (player->unk_3C & 0x2000) {
        player->unk_84.y = 0;
    }
    temp_f28 = 0;
    if (50.0f < ABS(player->unk_84.y)) {
        player->unk_84.y = 50.0f * ((0.0f > player->unk_84.y) ? -1 : 1);
    }
    if (player->unk_3C & 0x2) {
        Mtx rotMtx;
        MTXRotDeg(rotMtx, 'y', player->unk_50[2].x - player->unk_60);
        MTXMultVec(rotMtx, &player->unk_54, &player->unk_54);
        VECAdd(&player->unk_54, &player->unk_50[0], &player->unk_6C);
        player->unk_9C += player->unk_50[2].x - player->unk_60;
    }
    temp_f22 = player->unk_6C.y;
    VECAdd(&player->unk_6C, &player->unk_84, &player->unk_6C);
    if ((player->unk_3C & 0x1) == 0 && (0.0f != player->unk_84.x || 0.0f != player->unk_84.z)) {
        player->unk_9C = fn_1_1E20(player->unk_9C, atan2d(player->unk_84.x, player->unk_84.z), 0.4f * player->unk_B8);
    }
    temp_f28 += fn_1_39C4(player, temp_f22);
    if (nMap == 0) {
        player->unk_A8 = lbl_1_bss_420;
    }
    else {
        player->unk_A8 = MapPos(player->unk_6C.x, player->unk_6C.y, player->unk_6C.z, player->unk_C0, &player->unk_AC);
    }
    temp_r27 = FALSE;
    if (NULL != player->unk_08) {
        pos = player->unk_08(player->unk_00);
        if (NULL != pos) {
            if (player->unk_A8 < pos[1].y) {
                temp_r27 = TRUE;
                player->unk_50 = pos;
                player->unk_A8 = pos[1].y;
            }
        }
    }
    if (!temp_r27 && (player->unk_3C & 0x2)) {
        player->unk_3C &= ~0x2;
    }
    if (player->unk_38 == 1 && player->unk_A8 >= player->unk_6C.y) {
        player->unk_38 = 2;
        player->unk_3C &= ~0x3;
        player->unk_6C.y = player->unk_A8;
        player->unk_84.y = 0;
        motAttr = HU3D_MOTATTR_NONE;
        state = 4;
        if (player->unk_40 == 5) {
            state = 6;
            if (NULL != player->unk_10) {
                player->unk_10(player->unk_00);
            }
            if (player->unk_18 < 4) {
                omVibrate(player->unk_18, 12, 4, 2);
            }
        }
        if (player->unk_3C & 0x200) {
            state = -1;
            if (NULL != player->unk_0C) {
                player->unk_0C(player->unk_00);
            }
        }
        if (temp_r27) {
            player->unk_3C |= 0x2;
        }
    }
    temp_f23 = player->unk_6C.y - player->unk_A8;
    if (player->unk_38 == 0 && 10.0f < temp_f23) {
        if ((player->unk_3C & 0x2000) == 0) {
            if ((player->unk_3C & 0x400) != 0) {
                player->unk_3C |= 0x800;
            }
            else {
                fn_1_2BD0(player, 0.0f, 0.0f);
                motAttr = HU3D_MOTATTR_NONE;
                state = 3;
            }
        }
    }
    else if (temp_r27) {
        if (!(player->unk_3C & 0x2)) {
            player->unk_6C.y = player->unk_A8;
            player->unk_3C |= 0x2;
        }
    }
    fn_1_2E34(player);
    if (NULL != player->unk_04) {
        player->unk_04(player->unk_00);
    }
    temp_f28 += fn_1_39C4(player, player->unk_6C.y);
    if (player->unk_3C & 0x2) {
        player->unk_60 = player->unk_50[2].x;
        VECSubtract(&player->unk_6C, &player->unk_50[0], &player->unk_54);
    }
    if (0.0f != temp_f28) {
        player->unk_48++;
    }
    else {
        player->unk_48 = 0;
    }
    if (state >= 0 && player->unk_40 != state) {
        player->unk_40 = state;
        player->unk_44 = player->unk_14[player->unk_40];
        if (player->unk_44 >= 0 && !(player->unk_3C & 0x20)) {
            Hu3DMotionShiftSet(player->unk_00->model[0], player->unk_00->motion[player->unk_44], 0, 8, motAttr);
        }
    }
}

void fn_1_4ED8(WorkPlayerOld *player, s32 motNo)
{
    s32 i;
    player->unk_44 = motNo;
    player->unk_38 = 0;
    player->unk_3C &= 0x1400;
    player->unk_78 = player->unk_6C;
    player->unk_84.x = 0;
    player->unk_84.y = 0;
    player->unk_84.z = 0;
    fn_1_23B4(player);
    if (player->unk_40 == 3) {
        Hu3DModelAttrReset(player->unk_00->model[0], HU3D_MOTATTR_LOOP | HU3D_MOTATTR_PAUSE);
        Hu3DMotionSet(player->unk_00->model[0], player->unk_00->motion[player->unk_44]);
        Hu3DMotionTimeSet(player->unk_00->model[0], Hu3DMotionMaxTimeGet(player->unk_00->model[0]) - 1);
    }
    else if (player->unk_40 == 5) {
        player->unk_38 = 3;
        player->unk_3C |= 0x4;
        Hu3DModelAttrReset(player->unk_00->model[0], HU3D_MOTATTR_LOOP | HU3D_MOTATTR_PAUSE);
        Hu3DMotionSet(player->unk_00->model[0], player->unk_00->motion[player->unk_44]);
        Hu3DMotionTimeSet(player->unk_00->model[0], Hu3DMotionMaxTimeGet(player->unk_00->model[0]) - 1);
    }
    else {
        Hu3DModelAttrReset(player->unk_00->model[0], HU3D_MOTATTR_PAUSE);
        Hu3DMotionShiftSet(player->unk_00->model[0], player->unk_00->motion[player->unk_44], 0, 8, HU3D_MOTATTR_LOOP);
    }
}

void fn_1_5128(WorkPlayerOld *player, s32 attr)
{
    player->unk_3C |= attr;
}

void fn_1_5138(WorkPlayerOld *player, s32 attr)
{
    player->unk_3C &= ~attr;
}

#include "REL/m432data.h"

typedef struct UnkBss0Struct {
    /* 0x000 */ omObjData *unk_00;
    /* 0x004 */ omObjData *unk_04;
    /* 0x008 */ omObjData *unk_08;
    /* 0x00C */ omObjData *unk_0C;
    /* 0x010 */ UnkM432DllBss0SubStruct *unk_10[2];
    /* 0x018 */ s32 unk_18;
    /* 0x01C */ Vec unk_1C;
    /* 0x028 */ Vec unk_28;
    /* 0x034 */ Vec unk_34;
    /* 0x040 */ Vec unk_40;
    /* 0x04C */ Vec unk_4C;
    /* 0x058 */ Vec unk_58;
    /* 0x064 */ float unk_64;
    /* 0x068 */ float unk_68;
    /* 0x06C */ float unk_6C;
    /* 0x070 */ float unk_70;
    /* 0x074 */ float unk_74;
    /* 0x078 */ float unk_78;
    /* 0x07C */ float unk_7C;
    /* 0x080 */ float unk_80;
    /* 0x084 */ float unk_84;
    /* 0x088 */ Vec unk_88[4][3];
    /* 0x118 */ Vec unk_118;
    /* 0x124 */ float unk_124;
    /* 0x128 */ float unk_128;
    /* 0x12C */ float unk_12C;
    /* 0x130 */ Vec unk_130[8];
    /* 0x190 */ Vec unk_190;
    /* 0x19C */ Vec unk_19C;
    /* 0x1A8 */ Vec unk_1A8;
    /* 0x1B4 */ s32 unk_1B4;
    /* 0x1B8 */ s32 unk_1B8;
    /* 0x1BC */ s32 unk_1BC;
    /* 0x1C0 */ Vec unk_1C0;
    /* 0x1CC */ s32 unk_1CC;
    /* 0x1D0 */ s32 unk_1D0;
    /* 0x1D4 */ float unk_1D4;
    /* 0x1D8 */ s32 unk_1D8;
    /* 0x1DC */ float unk_1DC;
    /* 0x1E0 */ float unk_1E0;
    /* 0x1E4 */ float unk_1E4;
    /* 0x1E8 */ float unk_1E8;
    /* 0x1EC */ float unk_1EC;
    /* 0x1F0 */ float unk_1F0[2];
} UnkBss0Struct; /* size = 0x1F8 */

typedef struct UnkM432DllStruct {
    WorkPlayerOld unk_00;
    s32 *unk_C4;
    UnkM432DllBss0SubStruct *unk_C8;
    UnkM432DllData1794Struct *unk_CC;
    UnkM432DllBss0SubStruct *unk_D0;
    s32 unk_D4[10];
    s32 unk_FC;
    s32 unk_100;
    float unk_104;
    float unk_108;
    float unk_10C;
    float unk_110;
    float unk_114;
    s32 unk_118[9];
    Vec unk_13C;
    float unk_148;
    float unk_14C;
    float unk_150;
    float unk_154;
    float unk_158;
    float unk_15C;
    float unk_160;
    float unk_164;
    s32 unk_168;
    s32 unk_16C;
    s32 unk_170;
    s32 unk_174;
    s32 unk_178;
    s32 unk_17C;
    s32 unk_180;
    s32 unk_184;
    s32 unk_188;
    s32 unk_18C;
    s32 unk_190;
    s32 unk_194;
} UnkM432DllStruct;

typedef struct UnkM432DllStruct2 {
    Vec unk_00;
    float unk_0C;
    float unk_10;
    float unk_14;
    float unk_18;
} UnkM432DllStruct2; /* size = 0x1C */

