#include "game/hsfanim.h"
#include "game/hsfdraw.h"
#include "game/init.h"
#include "game/memory.h"
#include "game/process.h"
#include "game/sprite.h"

#include "ext_math.h"
#include "string.h"

typedef struct {
    /* 0x00 */ s16 unk00;
    /* 0x02 */ s16 unk02;
    /* 0x04 */ s16 unk04;
    /* 0x06 */ s16 unk06;
    /* 0x08 */ s16 unk08;
    /* 0x0A */ char unk0A[2];
    /* 0x0C */ Vec unk0C;
    /* 0x18 */ Vec unk18;
    /* 0x24 */ Vec unk24;
    /* 0x30 */ float unk30;
    /* 0x34 */ float unk34;
    /* 0x38 */ s32 unk38;
    /* 0x3C */ HsfanimStruct00 *unk3C;
} ParManProcUserData; // Size 0x40

static void particleFunc(ModelData *arg0, Mtx arg1);
static void ParManFunc(void);
static void ParManHook(ModelData *arg0, ParticleData *arg1, Mtx matrix);

u32 frand(void);

extern u32 GlobalCounter;

Hu3DTexAnimDataStruct Hu3DTexAnimData[HU3D_TEXANIM_MAX];
Hu3DTexScrDataStruct Hu3DTexScrData[16];
static Process *parManProc[64];

void Hu3DAnimInit(void) {
    Hu3DTexAnimDataStruct *var_r30;
    Hu3DTexScrDataStruct *var_r29;
    s16 i;

    var_r30 = Hu3DTexAnimData;
    for (i = 0; i < HU3D_TEXANIM_MAX; i++, var_r30++) {
        var_r30->unk06 = -1;
    }
    var_r29 = Hu3DTexScrData;
    for (i = 0; i < HU3D_TEXSCROLL_MAX; i++, var_r29++) {
        var_r29->unk02 = -1;
    }
}

s16 Hu3DAnimCreate(void *arg0, s16 arg1, char *arg2) {
    Hu3DTexAnimDataStruct *var_r31;
    HsfAttribute *var_r29;
    HsfData *temp_r27;
    HsfanimStruct01 *var_r30;
    s16 i;
    s16 var_r25;
    s16 var_r28;

