#include "game/gamework_data.h"

#include "game/window.h"
#include "game/sprite.h"
#include "game/data.h"
#include "game/dvd.h"
#include "game/memory.h"
#include "game/process.h"
#include "game/pad.h"
#include "game/armem.h"
#include "game/audio.h"

#include "math.h"
#include "stdarg.h"
#include "string.h"

#include "data_num/win.h"

typedef struct {
    /* 0x00 */ AnimData **anim;
    /* 0x04 */ s16 bank;
    /* 0x06 */ s16 w;
    /* 0x08 */ s16 h;
    /* 0x0A */ s16 center_x;
    /* 0x0C */ s16 center_y;
} spcFontTblData;

typedef struct {
    /* 0x00 */ s16 time;
    /* 0x04 */ u32 player[4];
} keyBufData; // Size 0x14

static void MesDispFunc(HuSprite *sprite);
static u8 winBGMake(AnimData *bg, AnimData *frame);
static void HuWinProc(void);
static void HuWinDrawMes(s16 window);
static s32 HuWinCR(WindowData *window);
static void _HuWinHomeClear(WindowData *window);
static void HuWinKeyWait(s16 window);
static s16 HuWinSpcFontEntry(WindowData *window, s16 entry, s16 x, s16 y);
static void HuWinSpcFontClear(WindowData *window);
static void HuWinChoice(WindowData *window);
static void GetMesMaxSizeSub(u32 mess);
static s32 GetMesMaxSizeSub2(WindowData *window, u8 *mess_data);

void mtxTransCat(Mtx, float, float, float);
WindowData ATTRIBUTE_ALIGN(32) winData[32];
u32 winKey[4];
keyBufData winComKeyBuf[256];

static AnimData *iconAnim;
static AnimData *cursorAnim;
static AnimData *cardAnimA;
static AnimData *cardAnimB;
static Process *winProc;
void *messDataPtr;
static s32 messDataNo;
static s16 winMaxWidth;
static s16 winMaxHeight;
