#include "common.h"

#include "game/window.h"
#include "game/sprite.h"
#include "game/data.h"
#include "game/dvd.h"
#include "game/memory.h"
#include "game/process.h"

#include "math.h"
#include "stdarg.h"
#include "string.h"

#define M_PI 3.141592653589793

typedef struct {
    /* 0x00 */ AnimData **anim;
    /* 0x04 */ s16 bank;
    /* 0x06 */ s16 w;
    /* 0x08 */ s16 h;
    /* 0x0A */ s16 center_x;
    /* 0x0C */ s16 center_y;
} spcFontTblData;

typedef struct {
    /* 0x00 */ s16 time;
    /* 0x04 */ u32 player[4];
} keyBufData; // Size 0x14

static void MesDispFunc(SpriteData*);
static u8 winBGMake(AnimData*, AnimData*);
static void HuWinProc(void);
static void HuWinDrawMes(s16 arg0);
static s32 HuWinCR(SomeWindowStruct* arg0);
static void _HuWinHomeClear(SomeWindowStruct* arg0);
static void HuWinKeyWait(s16 arg0);
static s16 HuWinSpcFontEntry(SomeWindowStruct* arg0, s16 arg1, s16 arg2, s16 arg3);
static void HuWinSpcFontClear(SomeWindowStruct* arg0);
static void HuWinChoice(SomeWindowStruct* arg0);
static void GetMesMaxSizeSub(u32 arg0);
static s32 GetMesMaxSizeSub2(SomeWindowStruct* arg0, u8* arg1);

void* HuAR_DVDtoARAM(s32);
void* HuAR_ARAMtoMRAMFileRead(s32, s32, s32);
s32 HuAudFXPlay(s32);
void HuAR_ARAMtoMRAM(void*);
void HuDataDirClose(s32);
void* HuDataReadNum(s32, s32);

void mtxTransCat(Mtx, f32, f32, f32);
void* MessData_MesPtrGet(void*, u32);

extern u16 HuPadBtn[4];
extern u8 HuPadDStkRep[4];

SomeWindowStruct ATTRIBUTE_ALIGN(32) winData[32];
