#include "common.h"
#include "game/window.h"
#include "game/memory.h"
#include "game/process.h"

#include "stdarg.h"
#include "string.h"

#define M_PI 3.141592653589793

typedef struct {
    /* 0x00 */ AnimData** unk00;
    /* 0x04 */ s16 unk04;
    /* 0x06 */ s16 unk06;
    /* 0x08 */ s16 unk08;
    /* 0x0A */ s16 unk0A;
    /* 0x0C */ s16 unk0C;
} SomeFontTblStruct; // Size 0x10

typedef struct {
    /* 0x00 */ s16 unk00;
    /* 0x02 */ char unk02[2];
    /* 0x04 */ s32 unk04[4];
} SomeKeyBufStruct; // Size 0x14

static void MesDispFunc(SpriteData*);
static u8 winBGMake(AnimData*, AnimData*);
static void HuWinProc(void);
static void HuWinDrawMes(s16 arg0);
static s32 HuWinCR(SomeWindowStruct* arg0);
static void _HuWinHomeClear(SomeWindowStruct* arg0);
static void HuWinKeyWait(s16 arg0);
static s16 HuWinSpcFontEntry(SomeWindowStruct* arg0, s16 arg1, s16 arg2, s16 arg3);
static void HuWinSpcFontClear(SomeWindowStruct* arg0);
static void HuWinChoice(SomeWindowStruct* arg0);
static void GetMesMaxSizeSub(u32 arg0);
static s32 GetMesMaxSizeSub2(SomeWindowStruct* arg0, u8* arg1);

void* HuAR_DVDtoARAM(s32);
void* HuAR_ARAMtoMRAMFileRead(s32, s32, s32);
s32 HuAudFXPlay(s32);
void HuAR_ARAMtoMRAM(void*);
void HuDataDirClose(s32);
void* HuDataReadNum(s32, s32);
f64 cos(f64);
f64 sin(f64);
void mtxTransCat(Mtx, f32, f32, f32);
void* HuDvdDataRead(char*);
void* MessData_MesPtrGet(void*, u32);

extern u16 HuPadBtn[4];
extern u8 HuPadDStkRep[4];
