#include "game/audio.h"
#include "game/chrman.h"
#include "game/data.h"
#include "game/frand.h"
#include "game/gamework_data.h"
#include "game/hsfman.h"
#include "game/hsfmotion.h"
#include "game/minigame_seq.h"
#include "game/object.h"
#include "game/objsub.h"
#include "game/pad.h"
#include "game/process.h"
#include "game/sprite.h"
#include "game/wipe.h"

#include "dolphin.h"
#include "ext_math.h"

typedef struct {
    /* 0x00 */ omObjData *unk00;
    /* 0x04 */ char unk04[0xB4];
} StructBssC8; // Size 0xB8

typedef struct {
    /* 0x00 */ s16 unk00;
    /* 0x02 */ s16 unk02[5];
} StructBss1E8; // Size 0xC

typedef struct {
    /* 0x00 */ s16 unk00;
    /* 0x02 */ s16 unk02;
    /* 0x04 */ s16 unk04;
    /* 0x06 */ s16 unk06[8];
    /* 0x16 */ s16 unk16;
    /* 0x18 */ s16 unk18;
    /* 0x1A */ s16 unk1A;
    /* 0x1C */ s16 unk1C[4];
    /* 0x24 */ s16 unk24;
    /* 0x26 */ char unk26[2];
    /* 0x28 */ s32 unk28;
    /* 0x2C */ s32 unk2C;
    /* 0x30 */ s32 unk30;
    /* 0x34 */ s32 unk34;
    /* 0x38 */ s32 unk38;
    /* 0x3C */ s32 unk3C;
    /* 0x40 */ s32 unk40;
    /* 0x44 */ s32 unk44;
    /* 0x48 */ s32 unk48;
    /* 0x4C */ s32 unk4C;
    /* 0x50 */ s32 unk50;
    /* 0x54 */ float unk54;
    /* 0x58 */ float unk58;
    /* 0x5C */ float unk5C;
    /* 0x60 */ float unk60;
    /* 0x64 */ float unk64;
    /* 0x68 */ float unk68;
    /* 0x6C */ float unk6C;
    /* 0x70 */ float unk70;
    /* 0x74 */ float unk74;
    /* 0x78 */ float unk78;
    /* 0x7C */ float unk7C;
    /* 0x80 */ float unk80;
    /* 0x84 */ float unk84;
    /* 0x88 */ float unk88;
    /* 0x8C */ float unk8C;
    /* 0x90 */ float unk90;
    /* 0x94 */ float unk94;
    /* 0x98 */ float unk98;
    /* 0x9C */ float unk9C;
    /* 0xA0 */ s8 unkA0;
    /* 0xA1 */ s8 unkA1;
    /* 0xA2 */ s8 unkA2;
    /* 0xA3 */ s8 unkA3;
    /* 0xA4 */ u16 unkA4;
    /* 0xA6 */ u16 unkA6;
    /* 0xA8 */ s32 unkA8;
    /* 0xAC */ s32 unkAC;
    /* 0xB0 */ s32 unkB0;
    /* 0xB4 */ s32 unkB4;
    /* 0xB8 */ s32 unkB8;
    /* 0xBC */ s32 unkBC;
    /* 0xC0 */ s32 unkC0;
    /* 0xC4 */ float unkC4;
    /* 0xC8 */ char unkC8[4];
    /* 0xCC */ float unkCC;
    /* 0xD0 */ s32 unkD0;
    /* 0xD4 */ s32 unkD4;
    /* 0xD8 */ float unkD8;
    /* 0xDC */ float unkDC;
} StructBss200; // Size 0xE0

typedef struct {
    /* 0x00 */ s16 unk00;
    /* 0x02 */ s16 unk02;
    /* 0x04 */ s16 unk04;
    /* 0x06 */ s16 unk06;
    /* 0x08 */ s16 unk08;
    /* 0x0A */ s16 unk0A;
    /* 0x0C */ float unk0C;
    /* 0x10 */ float unk10;
    /* 0x14 */ float unk14;
    /* 0x18 */ float unk18;
    /* 0x1C */ float unk1C;
    /* 0x20 */ float unk20;
    /* 0x24 */ float unk24;
    /* 0x28 */ float unk28;
} StructBss190; // Size 0x2C

void fn_1_57C(s16 arg0);
void fn_1_AD0(s16 arg0);
void fn_1_F58(void);
void fn_1_2254(ModelData *model, ParticleData *particle, Mtx matrix);
void fn_1_2744(ModelData *model, ParticleData *particle, Mtx matrix);
void fn_1_47E4(void);
void fn_1_4B20(void);
void fn_1_9AF0(void);
void fn_1_DF98(void);
void fn_1_104A0(void);
void fn_1_10500(void);

s16 lbl_1_bss_5C2;
s16 lbl_1_bss_5C0; // unused
s16 lbl_1_bss_5BE;
s16 lbl_1_bss_5BC;
s16 lbl_1_bss_5BA;
s16 lbl_1_bss_5B8;
s32 lbl_1_bss_5B4;
s32 lbl_1_bss_5B0;
s32 lbl_1_bss_5AC;
s32 lbl_1_bss_5A8;
s32 lbl_1_bss_5A4;
s32 lbl_1_bss_594[4];
s32 lbl_1_bss_584[4];
s32 lbl_1_bss_580;
StructBss200 lbl_1_bss_200[4];
StructBss1E8 lbl_1_bss_1E8[2];
StructBss190 lbl_1_bss_190[2];
Process *lbl_1_bss_180[4];
StructBssC8 lbl_1_bss_C8;
Vec lbl_1_bss_BC;
Vec lbl_1_bss_B0;
Vec lbl_1_bss_A4;
void *lbl_1_bss_84[8];
void *lbl_1_bss_64[8];
u8 lbl_1_bss_60;
Vec lbl_1_bss_0[8];

