#include "ext_math.h"
#include "game/audio.h"
#include "game/chrman.h"
#include "game/esprite.h"
#include "game/flag.h"
#include "game/gamework_data.h"
#include "game/hsfman.h"
#include "game/hsfmotion.h"
#include "game/memory.h"
#include "game/minigame_seq.h"
#include "game/object.h"
#include "game/objsub.h"
#include "game/pad.h"
#include "game/printfunc.h"
#include "game/sprite.h"
#include "game/window.h"
#include "game/wipe.h"
#include "string.h"

#include "game/frand.h"

extern s32 rand8(void);

typedef struct UnkCameraStruct {
    /* 0x00 */ float unk_00;
    /* 0x04 */ float unk_04;
    /* 0x08 */ float unk_08;
    /* 0x0C */ float unk_0C;
    /* 0x10 */ float unk_10;
    /* 0x14 */ float unk_14;
} UnkCameraStruct; /* size = 0x18 */

typedef struct UnkBssCCStruct {
    /* 0x00 */ s32 unk_00;
    /* 0x04 */ float unk_04[3];
} UnkBssCCStruct; /* size = 0x10 */

typedef struct UnkBss28CStruct {
    /* 0x00 */ s32 unk_00;
    /* 0x04 */ s32 unk_04;
    /* 0x08 */ float unk_08;
    /* 0x0C */ s32 unk_0C;
} UnkBss28CStruct; /* size = 0x10 */

typedef struct UnkData114Struct {
    /* 0x00 */ s32 unk_00;
    /* 0x04 */ s32 unk_04;
    /* 0x08 */ float unk_08;
    /* 0x0C */ float unk_0C;
    /* 0x10 */ float unk_10;
    /* 0x14 */ float unk_14;
} UnkData114Struct; /* size = 0x18 */

typedef struct M458DllWork {
    s32 unk_00;
    s32 unk_04;
    s32 unk_08;
    s32 unk_0C;
    s32 unk_10;
    s32 unk_14;
    s32 unk_18;
    s32 unk_1C;
    s32 unk_20;
    s32 unk_24;
    float unk_28;
    float unk_2C;
    char unk30[4];
    float unk_34;
    s32 unk_38;
    s32 unk_3C;
    s32 unk_40;
} M458DllWork; /* size = 0x44 */

s16 fn_1_4BE8();
void fn_1_6D9C(omObjData *arg0);

s32 lbl_1_data_0[2] = { 0x570025, 0x570026 };
s32 lbl_1_data_8[2] = { 0, 0 };
s32 lbl_1_data_10[0xA] = {
    DATA_MAKE_NUM(DATADIR_MARIOMOT, 0x00),
    DATA_MAKE_NUM(DATADIR_MARIOMOT, 0x02),
    DATA_MAKE_NUM(DATADIR_MARIOMOT, 0x03),
    DATA_MAKE_NUM(DATADIR_MARIOMOT, 0x05),
    DATA_MAKE_NUM(DATADIR_MARIOMOT, 0x06),
    DATA_MAKE_NUM(DATADIR_MARIOMOT, 0x36),
    DATA_MAKE_NUM(DATADIR_MARIOMOT, 0x2F),
    DATA_MAKE_NUM(DATADIR_MARIOMOT, 0x1A),
    0x570000,
    DATA_MAKE_NUM(DATADIR_MARIOMOT, 0x17),
};
