#include "ext_math.h"
#include "game/audio.h"
#include "game/chrman.h"
#include "game/esprite.h"
#include "game/hsfdraw.h"
#include "game/hsfman.h"
#include "game/hsfmotion.h"
#include "game/minigame_seq.h"
#include "game/objsub.h"
#include "game/pad.h"
#include "game/sprite.h"
#include "game/wipe.h"
#include "rel_sqrt_consts.h"

typedef struct UnkM426Struct {
    /* 0x00 */ s32 unk_00;
    /* 0x04 */ omObjData *unk_04[2];
    /* 0x0C */ u8 unk_0C[2];
    /* 0x0E */ u8 unk_0E[6];
} UnkM426Struct; /* size = 0x14 */

typedef struct UnkM426Struct3 {
    /* 0x00 */ s32 unk_00;
    /* 0x04 */ s32 unk_04;
    /* 0x08 */ s32 unk_08;
    /* 0x0C */ s32 unk_0C;
    /* 0x10 */ s32 unk_10;
    /* 0x14 */ s32 unk_14;
    /* 0x18 */ s32 unk_18;
    /* 0x1C */ s32 unk_1C;
    /* 0x20 */ s32 unk_20;
    /* 0x24 */ s32 unk_24;
    /* 0x28 */ s32 unk_28;
    /* 0x2C */ char unk2C[8];
    /* 0x34 */ s32 unk_34;
    /* 0x38 */ float unk_38;
} UnkM426Struct3; /* size = 0x3C */

typedef struct UnkM426Struct2 {
    /* 0x00 */ s32 unk_00;
    /* 0x04 */ u32 unk_04;
    /* 0x08 */ u32 unk_08;
    /* 0x0C */ s32 unk_0C;
    /* 0x10 */ s32 unk_10;
    /* 0x14 */ s32 unk_14;
    /* 0x18 */ s32 unk_18;
    /* 0x1C */ s32 unk_1C;
    /* 0x20 */ s32 unk_20;
    /* 0x24 */ s32 unk_24;
    /* 0x28 */ s32 unk_28;
    /* 0x2C */ s32 unk_2C;
    /* 0x30 */ s32 unk_30;
    /* 0x34 */ s32 unk_34;
    /* 0x38 */ s32 unk_38;
    /* 0x3C */ s32 unk_3C;
    /* 0x40 */ float unk_40;
    /* 0x44 */ float unk_44;
    /* 0x48 */ omObjData *unk_48;
    /* 0x4C */ omObjData *unk_4C;
    /* 0x50 */ float unk_50[15];
    /* 0x8C */ s32 unk_8C;
    /* 0x90 */ s32 unk_90;
    /* 0x94 */ s32 unk_94;
    /* 0x98 */ float unk_98;
    /* 0x9C */ Vec unk_9C;
    /* 0xA8 */ s32 unk_A8;
    /* 0xAC */ s32 unk_AC;
    /* 0xB0 */ s32 unk_B0;
    /* 0xB4 */ s32 unk_B4;
    /* 0xB8 */ s32 unk_B8;
    /* 0xBC */ s32 unk_BC;
} UnkM426Struct2; /* size = 0xC0 */

typedef struct UnkM426Struct4 {
    /* 0x00 */ s32 unk_00;
    /* 0x04 */ char unk04[4];
    /* 0x08 */ u32 unk_08;
    /* 0x0C */ s32 unk_0C;
    /* 0x10 */ char unk10[8];
    /* 0x18 */ s32 unk_18;
    /* 0x0C */ s32 unk_1C;
    /* 0x20 */ s32 unk_20;
    /* 0x24 */ s32 unk_24;
    /* 0x28 */ s32 unk_28;
    /* 0x2C */ s32 unk_2C;
    /* 0x30 */ s32 unk_30;
    /* 0x34 */ float unk_34;
    /* 0x38 */ s32 unk_38;
    /* 0x3C */ float unk_3C;
    /* 0x40 */ float unk_40;
    /* 0x44 */ float unk_44;
    /* 0x48 */ float unk_48;
    /* 0x4C */ float unk_4C;
} UnkM426Struct4; /* size = 0x50 */

typedef struct UnkM426Struct5 {
    /* 0x00 */ s32 unk_00;
    /* 0x04 */ s32 unk_04;
    /* 0x08 */ AnimData *unk_08;
    /* 0x0C */ s32 unk_0C;
    /* 0x10 */ s32 unk_10;
    /* 0x14 */ Vec unk_14;
    /* 0x20 */ float unk_20;
} UnkM426Struct5; /* size = 0x24 */

typedef struct UnkM426Struct6 {
    /* 0x00 */ s32 unk_00;
    /* 0x04 */ s32 unk_04;
    /* 0x08 */ s32 unk_08;
    /* 0x0C */ float unk_0C;
    /* 0x10 */ float unk_10;
    /* 0x14 */ float unk_14;
    /* 0x18 */ float unk_18;
} UnkM426Struct6; /* size = 0x1C */

typedef struct UnkM426Struct7 {
    /* 0x00 */ s32 unk_00;
    /* 0x04 */ s32 unk_04;
    /* 0x08 */ s32 unk_08;
    /* 0x0C */ s32 unk_0C;
    /* 0x10 */ s32 unk_10;
    /* 0x14 */ s32 unk_14[6];
    /* 0x2C */ s32 unk_2C[6][3];
    /* 0x74 */ s32 unk_74[6][3];
    /* 0xBC */ s32 unk_BC;
    /* 0xC0 */ s32 unk_C0;
} UnkM426Struct7; /* size = 0xC4 */

typedef struct UnkM426Struct8 {
    /* 0x00 */ s16 unk_00;
    /* 0x02 */ s16 unk_02;
    /* 0x04 */ Vec unk_04;
    /* 0x10 */ char unk10[0x18];
    /* 0x28 */ float unk_28;
    /* 0x2C */ float unk_2C;
    /* 0x30 */ Vec unk_30;
    /* 0x3C */ GXColor unk_3C;
    /* 0x40 */ s32 unk_40;
} UnkM426Struct8; /* size = 0x44 */

typedef struct UnkM426Struct9 {
    /* 0x00 */ char unk00[0x14];
    /* 0x14 */ s32 unk_14;
} UnkM426Struct9; /* size = unknown */

typedef void (*UnkModelDataUnk120Hook)(struct model_data *, struct UnkModelDataUnk120Struct *, Mtx);

typedef struct UnkModelDataUnk120Struct {
    /* 0x00 */ s16 unk_00;
    /* 0x02 */ s16 unk_02;
    /* 0x04 */ char unk04[0x1C];
    /* 0x20 */ u8 unk_20;
    /* 0x21 */ u8 unk_21;
    /* 0x22 */ char unk22[2];
    /* 0x24 */ s16 unk_24;
    /* 0x26 */ char unk26[2];
    /* 0x28 */ s32 unk_28;
    /* 0x2C */ s32 unk_2C;
    /* 0x30 */ u32 unk_30;
    /* 0x34 */ u32 unk_34;
    /* 0x38 */ AnimData *unk_38;
    /* 0x3C */ UnkM426Struct8 *unk_3C;
    /* 0x40 */ Vec *unk_40;
    /* 0x44 */ Vec2f *unk_44;
    /* 0x48 */ void *unk_48;
    /* 0x4C */ UnkModelDataUnk120Hook unk_4C;
    /* 0x50 */ ModelData *unk_50;
} UnkModelDataUnk120Struct; /* size = 0x54 */

typedef struct UnkM426Struct10 {
    /* 0x00 */ char unk00[4];
    /* 0x04 */ s32 unk_04;
    /* 0x08 */ char unk08[4];
    /* 0x0C */ s32 unk_0C;
    /* 0x10 */ char unk10[4];
    /* 0x14 */ s32 unk_14;
    /* 0x18 */ struct UnkM426Struct10 **unk_18;
    /* 0x1C */ char unk1C[0x48];
    /* 0x64 */ struct UnkM426Struct10 *unk_64;
} UnkM426Struct10; /* size = unknown */

typedef struct UnkM426Struct11 {
    /* 0x00 */ u16 unk_00;
    /* 0x04 */ u16 unk_04;
    /* 0x08 */ u16 unk_08;
    /* 0x0C */ u16 unk_0C;
} UnkM426Struct11; /* size = 0x10 */

typedef struct UnkM426Struct12 {
    /* 0x00 */ s16 unk_00;
    /* 0x02 */ char unk02[0x0A];
    /* 0x0C */ UnkM426Struct11 unk_0C;
    /* 0x14 */ UnkM426Struct11 unk_14;
    /* 0x1C */ char unk1C[0x14];
} UnkM426Struct12; /* size = 0x30 */

typedef struct UnkM426Struct13 {
    /* 0x00 */ s32 unk_00;
    /* 0x04 */ u32 unk_04;
} UnkM426Struct13; /* size = 0x08 */

void fn_1_1004(omObjData *object);
void fn_1_117C(omObjData *object);
void fn_1_125C(omObjData *object);
void fn_1_16F8(omObjData *object);
void fn_1_20C(omObjData *object);
void fn_1_2AC8(omObjData *object);
void fn_1_2ADC(void);
s32 fn_1_2EDC(void);
void fn_1_2F5C(omObjData *object, float *arg1, float *arg2, s32 *arg3);
void fn_1_330(omObjData *object);
void fn_1_36C4(void);
void fn_1_3714(omObjData *object);
void fn_1_3EFC(omObjData *object);
void fn_1_4644(void);
void fn_1_4738(s32 arg0, s32 arg1);
s32 fn_1_4894(s32 arg0);
s32 fn_1_48F0(float arg8);
float fn_1_4A68(s32 arg0);
s32 fn_1_4AF4(Vec *arg0, float arg8, s32 arg1);
void fn_1_4EC4(void);
void fn_1_4F14(omObjData *object);
void fn_1_5134(omObjData *object);
void fn_1_5B48(void);
s32 fn_1_5C6C(s32 arg0, s32 arg1, Vec *arg2);
s32 fn_1_5D3C(void);
void fn_1_5E6C(void);
void fn_1_5EBC(omObjData *object);
void fn_1_6008(omObjData *object);
void fn_1_61E0(void);
