#include "REL/mstory3Dll.h"
#include "game/audio.h"
#include "game/chrman.h"
#include "game/data.h"
#include "game/esprite.h"
#include "game/flag.h"
#include "game/gamework.h"
#include "game/gamework_data.h"
#include "game/hsfman.h"
#include "game/hsfmotion.h"
#include "game/pad.h"
#include "game/printfunc.h"
#include "game/saveload.h"
#include "game/sprite.h"
#include "game/window.h"
#include "game/wipe.h"

typedef struct {
    /* 0x00 */ s32 unk00;
    /* 0x04 */ s32 unk04;
    /* 0x08 */ s32 unk08;
    /* 0x0C */ s32 unk0C;
    /* 0x10 */ s32 unk10;
    /* 0x14 */ s32 unk14;
    /* 0x18 */ s32 unk18;
    /* 0x1C */ char unk1C[0x18];
    /* 0x34 */ s32 unk34[4][2];
    /* 0x54 */ s32 unk54;
    /* 0x58 */ char unk58[4];
    /* 0x5C */ s32 unk5C;
    /* 0x60 */ char unk60[4];
    /* 0x64 */ s32 unk64;
    /* 0x68 */ char unk68[4];
    /* 0x6C */ s32 unk6C;
    /* 0x70 */ char unk70[4];
    /* 0x74 */ s32 unk74;
    /* 0x78 */ char unk78[4];
    /* 0x7C */ s32 unk7C;
    /* 0x80 */ char unk80[4];
    /* 0x84 */ s32 unk84;
    /* 0x88 */ char unk88[4];
    /* 0x8C */ s32 unk8C;
    /* 0x90 */ char unk90[4];
} StructUnk38Bss1A0C; // Size 0x94

typedef struct {
    /* 0x000 */ s32 unk00;
    /* 0x004 */ s32 unk04;
    /* 0x008 */ s32 unk08;
    /* 0x00C */ s32 unk0C;
    /* 0x010 */ s32 unk10;
    /* 0x014 */ s32 unk14;
    /* 0x018 */ s32 unk18;
    /* 0x01C */ char unk1C[8];
    /* 0x024 */ s32 unk24;
    /* 0x028 */ char unk28[0x10];
    /* 0x038 */ StructUnk38Bss1A0C unk38[4];
    /* 0x288 */ Vec unk288[5];
    /* 0x2C4 */ s32 unk2C4;
    /* 0x2C8 */ s32 unk2C8;
    /* 0x2CC */ s32 unk2CC;
    /* 0x2D0 */ s32 unk2D0;
    /* 0x2D4 */ s32 unk2D4;
} StructBss1A0C; // Size 0x2D8

void fn_1_15C0C(void);
void fn_1_16ED4(void);
void fn_1_18080(void);
void fn_1_184E8(void);
void fn_1_18558(void);
void fn_1_18F98(void);
void fn_1_19144(void);
void fn_1_19214(void);
void fn_1_194A0(void);
void fn_1_197B4(s32 arg0);
void fn_1_1C2F4(void);
void fn_1_1C460(void);
void fn_1_1CA98(void);
void fn_1_1CB7C(void);
void fn_1_1CC5C(void);
void fn_1_1CD60(void);
void fn_1_1D63C(void);
void fn_1_1D77C(void);
void fn_1_1D964(void);
void fn_1_1DA64(void);
void fn_1_1DAAC(void);
void fn_1_1DE4C(void);

StructBss1A0C lbl_1_bss_1A0C;
StructBss1530 lbl_1_bss_19E4;
StructBss1530 lbl_1_bss_19BC;
StructBss1530 lbl_1_bss_1994;
StructBss1530 lbl_1_bss_18F4[4];
AnimData* lbl_1_bss_18EC[2];
AnimData* lbl_1_bss_18E4[2];
AnimData* lbl_1_bss_18D8[3];
s32 lbl_1_bss_18D4;
Process* lbl_1_bss_18D0;

void fn_1_157F0(Process* arg0, s32 arg1, s32 arg2, s32 arg3) {
    s32 var_r31;

    lbl_1_bss_18D0 = arg0;
    lbl_1_bss_1A0C.unk00 = arg1;
