#include "REL/mstory3Dll.h"
#include "game/chrman.h"
#include "game/data.h"
#include "game/esprite.h"
#include "game/flag.h"
#include "game/gamework.h"
#include "game/gamework_data.h"
#include "game/hsfanim.h"
#include "game/hsfdraw.h"
#include "game/hsfman.h"
#include "game/hsfmotion.h"
#include "game/minigame_seq.h"
#include "game/pad.h"
#include "game/printfunc.h"
#include "game/sprite.h"
#include "game/window.h"
#include "game/wipe.h"
#include "msm/msmse.h"

#include "ext_math.h"

typedef struct {
    /* 0x00 */ s32 unk00;
    /* 0x04 */ s32 unk04;
    /* 0x08 */ char unk08[0xC];
} StructUnk24Bss1580; // Size 0x14

typedef struct {
    /* 0x00 */ StructFn352C unk00;
    /* 0x34 */ char unk34[0x60];
} StructUnkC4Bss1580; // Size 0x94

typedef struct {
    /* 0x000 */ s32 unk00;
    /* 0x004 */ s32 unk04;
    /* 0x008 */ s32 unk08;
    /* 0x00C */ s32 unk0C;
    /* 0x010 */ s32 unk10;
    /* 0x014 */ s32 unk14;
    /* 0x018 */ s32 unk18;
    /* 0x01C */ s32 unk1C;
    /* 0x020 */ s32 unk20;
    /* 0x024 */ StructUnk24Bss1580 unk24[4];
    /* 0x074 */ char unk74[0x50];
    /* 0x0C4 */ StructUnkC4Bss1580 unkC4[4];
    /* 0x314 */ s32 unk314;
    /* 0x318 */ char unk318[0xC];
    /* 0x324 */ s32 unk324;
    /* 0x328 */ char unk328[0xC];
    /* 0x334 */ s32 unk334[1]; // array length unknown
    /* 0x338 */ char unk338[0xC];
    /* 0x344 */ s32 unk344;
    /* 0x348 */ s32 unk348;
    /* 0x34C */ char unk34C[4];
} StructBss1580; // Size 0x350

typedef struct {
    /* 0x00 */ s32 unk00;
    /* 0x04 */ s32 unk04;
    /* 0x08 */ s32 unk08;
    /* 0x0C */ char unk0C[4];
    /* 0x10 */ float unk10;
    /* 0x14 */ float unk14;
    /* 0x18 */ float unk18;
    /* 0x1C */ char unk1C[4];
    /* 0x20 */ float unk20;
    /* 0x24 */ float unk24;
    /* 0x28 */ float unk28;
    /* 0x2C */ float unk2C;
    /* 0x30 */ float unk30;
    /* 0x34 */ float unk34;
} StructBssC8; // Size 0x38

void fn_1_7E88(s32 arg0, s32 arg1, s32 arg2, s32 arg3, s32 arg4);
void fn_1_82E0(void);
s32 fn_1_B670(void);
void fn_1_D48C(void);
void fn_1_D718(omObjData* arg0);
void fn_1_D7D8(omObjData* arg0);
void fn_1_FE80(void);
void fn_1_FF7C(s32 arg0);
void fn_1_1036C(omObjData* arg0);
void fn_1_10D74(omObjData* arg0);
void fn_1_11794(omObjData* arg0);
void fn_1_11834(omObjData* arg0);
void fn_1_123D8(omObjData* arg0);
void fn_1_1241C(omObjData* arg0);
void fn_1_12420(omObjData* arg0);
void fn_1_12A98(s32 arg0);
void fn_1_12C08(s32 arg0);
void fn_1_12DAC(void);
void fn_1_13908(void);
void fn_1_130A8(void);
void fn_1_1317C(void);
void fn_1_13A38(omObjData* arg0);
void fn_1_13A3C(s32 arg0, s32 arg1, s32 arg2, s32 arg3);
void fn_1_13C78(s32 arg0, s32 arg1, s32 arg2);
void fn_1_13D38(s32 arg0, s32 arg1, s32 arg2);
void fn_1_140A0(void);
void fn_1_15450(s32 arg0);

StructBss1580 lbl_1_bss_1580;
StructBss1530 lbl_1_bss_1558;
