#include "ext_math.h"
#include "game/hsfman.h"
#include "game/hsfmotion.h"

#include "REL/m420dll.h"

typedef struct M420DllUnkMapStruct2 {
    /* 0x00 */ struct {
        s8 unk_00_field0 : 1;
        s8 unk_00_field1 : 1;
        s8 unk_00_field2 : 1;
        s8 unk_00_field3 : 1;
        s8 unk_00_field4 : 1;
        s8 unk_00_field5 : 1;
        s8 unk_00_field6 : 1;
        s8 unk_00_field7 : 1;
    };
    /* 0x04 */ s16 unk_02;
    /* 0x04 */ Vec unk_04;
    /* 0x10 */ Vec unk_10;
    /* 0x1C */ Vec unk_1C;
    /* 0x28 */ Vec unk_28;
    /* 0x34 */ Vec unk_34;
    /* 0x40 */ Vec unk_40;
    /* 0x4C */ Vec unk_4C;
    /* 0x58 */ Vec unk_58;
    /* 0x64 */ Vec unk_64;
    /* 0x70 */ float unk_70;
    /* 0x74 */ float unk_74;
    /* 0x78 */ s32 unk_78;
    /* 0x7C */ float unk_7C;
    /* 0x80 */ float unk_80;
    /* 0x84 */ s32 unk_84;
    /* 0x88 */ float unk_88;
    /* 0x8C */ float unk_8C;
    /* 0x90 */ s32 unk_90;
} M420DllUnkMapStruct2; /* size = 0x94 */

typedef struct M420DllUnkMapStruct {
    /* 0x00 */ M420DllUnkMapStruct2 *unk_00;
    /* 0x04 */ M420DllUnkMapStruct2 *unk_04;
    /* 0x08 */ M420DllUnkMapStruct2 *unk_08;
    /* 0x0C */ M420DllUnkMapStruct2 *unk_0C;
    /* 0x10 */ M420DllUnkMapStruct2 *unk_10;
    /* 0x14 */ s32 unk_14;
    /* 0x18 */ char pad_18[4];
    /* 0x1C */ float unk_1C;
    /* 0x20 */ float unk_20;
    /* 0x24 */ float unk_24;
    /* 0x28 */ float unk_28;
    /* 0x2C */ float unk_2C;
    /* 0x30 */ s32 unk_30;
    /* 0x34 */ s32 unk_34;
    /* 0x38 */ s32 unk_38;
    /* 0x3C */ s32 unk_3C;
} M420DllUnkMapStruct; /* size = 0x40 */

typedef struct M420DllUnkMapStruct3 {
    /* 0x00 */ Vec unk_00;
    /* 0x0C */ Vec unk_0C;
    /* 0x18 */ GXColor unk_18;
} M420DllUnkMapStruct3; /* size = 0x1C */

s32 fn_1_5A7C(s32 arg0);
void fn_1_6820(void);
void fn_1_6884(void);
void fn_1_6950(void);
void fn_1_6D0C(void);
void fn_1_6D5C(void);
void fn_1_6DF0(M420DllUnkMapStruct2 *arg0);
void fn_1_7230(M420DllUnkMapStruct2 *arg0, Vec *arg1, s32 arg2, s32 arg3);
void fn_1_7704(void);
void fn_1_7E24(void);
void fn_1_8240(void);
void fn_1_8414(void);

M420DllUnkMapStruct3 lbl_1_data_138 = {
    { 1000.0f, 2000.0f, 0.0f },
    { -0.5f, -0.5f, -0.5f },
    { 0xFF, 0xFF, 0xFF, 0xFF },
};
void (*lbl_1_data_154[4])() = { fn_1_7704, fn_1_7E24, fn_1_8240, fn_1_8414 };

static const s32 lbl_1_rodata_360[0x1B] = {
    DATA_MAKE_NUM(DATADIR_M420, 0x00),
    DATA_MAKE_NUM(DATADIR_M420, 0x14),
    DATA_MAKE_NUM(DATADIR_M420, 0x07),
    DATA_MAKE_NUM(DATADIR_M420, 0x08),
    DATA_MAKE_NUM(DATADIR_M420, 0x01),
    DATA_MAKE_NUM(DATADIR_M420, 0x02),
    DATA_MAKE_NUM(DATADIR_M420, 0x03),
    DATA_MAKE_NUM(DATADIR_M420, 0x04),
