#include "ext_math.h"
#include "game/audio.h"
#include "game/chrman.h"
#include "game/esprite.h"
#include "game/hsfdraw.h"
#include "game/hsfman.h"
#include "game/hsfmotion.h"
#include "game/objsub.h"
#include "game/pad.h"
#include "game/wipe.h"

#include "REL/m420dll.h"

typedef void (*M420DllUnkFunc)(M420DllPlayerStruct *);

typedef struct M420DllUnkStruct2 {
    /* 0x00 */ s32 unk_00;
    /* 0x04 */ s32 unk_04;
    /* 0x08 */ s32 unk_08;
    /* 0x0C */ s32 unk_0C;
    /* 0x10 */ s32 unk_10;
    /* 0x14 */ s32 unk_14;
    /* 0x18 */ s32 unk_18;
    /* 0x1C */ s32 unk_1C;
} M420DllUnkStruct2; /* size = 0x20 */

void fn_1_1F14(void);
void fn_1_1F54(M420DllPlayerStruct *arg0);
void fn_1_1F94(M420DllPlayerStruct *arg0);
void fn_1_200C(M420DllPlayerStruct *arg0);
void fn_1_20EC(M420DllPlayerStruct *arg0);
void fn_1_211C(M420DllPlayerStruct *arg0);
void fn_1_2174(M420DllPlayerStruct *arg0);
void fn_1_2260(M420DllPlayerStruct *arg0);
void fn_1_22CC(M420DllPlayerStruct *arg0);
void fn_1_276C(M420DllPlayerStruct *arg0);
void fn_1_2CE0(M420DllPlayerStruct *arg0);
void fn_1_2D7C(M420DllPlayerStruct *arg0);
void fn_1_2EA8(M420DllPlayerStruct *arg0);
void fn_1_3098(M420DllPlayerStruct *arg0);
void fn_1_326C(M420DllPlayerStruct *arg0);
void fn_1_3450(M420DllPlayerStruct *arg0);
s32 fn_1_34AC(M420DllPlayerStruct *arg0);
void fn_1_355C(M420DllPlayerStruct *arg0);
void fn_1_36E4(M420DllPlayerStruct *arg0);
void fn_1_374C(M420DllPlayerStruct *arg0);
void fn_1_378C(M420DllPlayerStruct *arg0);
void fn_1_3854(void);
