#include "REL/m403Dll.h"
#include "REL/executor.h"
#include "game/audio.h"
#include "game/chrman.h"
#include "game/data.h"
#include "game/frand.h"
#include "game/gamework.h"
#include "game/gamework_data.h"
#include "game/hsfanim.h"
#include "game/hsfman.h"
#include "game/memory.h"
#include "game/minigame_seq.h"
#include "game/object.h"
#include "game/objsub.h"
#include "game/pad.h"
#include "game/sprite.h"
#include "game/wipe.h"

#include "ext_math.h"
#include "rel_sqrt_consts.h"

typedef struct {
    /* 0x000 */ u8 unk00;
    /* 0x001 */ char unk01[3];
    /* 0x004 */ Vec unk04;
    /* 0x010 */ Vec unk10;
    /* 0x01C */ Vec unk1C;
    /* 0x028 */ Vec unk28;
    /* 0x034 */ Vec unk34;
    /* 0x040 */ Vec unk40;
    /* 0x04C */ Vec unk4C;
    /* 0x058 */ Vec unk58;
    /* 0x064 */ Vec unk64;
    /* 0x070 */ Vec unk70;
    /* 0x07C */ Vec unk7C;
    /* 0x088 */ float unk88[3][3];
    /* 0x0AC */ Vec unkAC;
    /* 0x0B8 */ Vec unkB8;
    /* 0x0C4 */ Vec unkC4;
    /* 0x0D0 */ float unkD0[3][3];
    /* 0x0F4 */ float unkF4[3];
    /* 0x100 */ float unk100[3];
    /* 0x10C */ float unk10C[3];
    /* 0x118 */ float unk118[3];
    /* 0x124 */ float unk124[3];
    /* 0x130 */ float unk130;
    /* 0x134 */ float unk134;
    /* 0x138 */ float unk138;
    /* 0x13C */ float unk13C;
    /* 0x140 */ float unk140;
    /* 0x144 */ float unk144;
    /* 0x148 */ float unk148;
} Unkm403Struct_00; // Size 0x14C

typedef struct {
    /* 0x00 */ u8 unk00;
    /* 0x01 */ u8 unk01;
    /* 0x02 */ u8 unk02;
    /* 0x03 */ u8 unk03;
    /* 0x04 */ u8 unk04;
    /* 0x05 */ u8 unk05;
    /* 0x06 */ u8 unk06;
    /* 0x07 */ u8 unk07;
    /* 0x08 */ char unk08[2];
    /* 0x0A */ u8 unk0A;
    /* 0x0B */ char unk0B[1];
    /* 0x0C */ u8 unk0C;
    /* 0x0D */ u8 unk0D;
    /* 0x0E */ u8 unk0E;
    /* 0x0F */ char unk0F[1];
    /* 0x10 */ s16 unk10;
    /* 0x12 */ s16 unk12;
    /* 0x14 */ s16 unk14;
    /* 0x16 */ s16 unk16;
    /* 0x18 */ s16 unk18;
    /* 0x1A */ s16 unk1A;
    /* 0x1C */ float unk1C;
    /* 0x20 */ float unk20;
    /* 0x24 */ float unk24;
    /* 0x28 */ float unk28;
    /* 0x2C */ Vec unk2C;
    /* 0x38 */ float unk38;
    /* 0x3C */ float unk3C;
    /* 0x40 */ float unk40;
    /* 0x44 */ float unk44;
    /* 0x48 */ float unk48;
    /* 0x4C */ float unk4C;
    /* 0x50 */ Vec unk50;
    /* 0x5C */ s16 unk5C; // Start of a struct of size 0x40 (memset)?
    /* 0x5E */ s16 unk5E;
    /* 0x60 */ float unk60;
    /* 0x64 */ float unk64;
    /* 0x68 */ char unk68[0x34];
    /* 0x9C */ u8 unk9C;
    /* 0x9D */ char unk9D[3];
    /* 0xA0 */ s32 unkA0;
} Unkm403Struct_01; // Size 0xA4

static void fn_1_424(omObjData *arg0);
static void fn_1_444(omObjData *arg0);
static void fn_1_82C(omObjData *arg0);
static void fn_1_1214(omObjData *arg0);
static void fn_1_1274(omObjData *arg0);
static void fn_1_1460(omObjData *arg0);
static void fn_1_16D8(omObjData *arg0);
static void fn_1_17DC(omObjData *arg0);
static void fn_1_1A50(float arg0, Vec *arg1, Vec *arg2, float arg3);
static void fn_1_1AF0(float arg0, Vec *arg1, Vec *arg2, float arg3, Vec *arg4, Vec *arg5, float arg6);
static void fn_1_1DA8(float arg0);
static void fn_1_1DD0(omObjData *arg0);
static void fn_1_2158(omObjData *arg0);
static void fn_1_22A4(omObjData *arg0);
static void fn_1_2598(omObjData *arg0);
static void fn_1_2FDC(omObjData *arg0);
static void fn_1_3800(void);
static s32 fn_1_3894(void);
static void fn_1_3B80(omObjData *arg0);
static void fn_1_3D6C(Vec *arg0, Vec *arg1);
static void fn_1_3E4C(omObjData *arg0);
