#include "ext_math.h"
#include "game/audio.h"
#include "game/gamework_data.h"
#include "game/hsfdraw.h"
#include "game/hsfman.h"
#include "game/hsfmotion.h"
#include "game/sprite.h"

#include "REL/m406Dll.h"

typedef struct UnkM406Struct {
    /* 0x00 */ u8 unk_00;
    /* 0x01 */ u8 unk_01;
    /* 0x02 */ char unk02[2];
    /* 0x04 */ float unk_04;
    /* 0x08 */ float unk_08;
    /* 0x0C */ float unk_0C;
    /* 0x10 */ Vec unk_10;
    /* 0x1C */ Vec unk_1C;
    /* 0x28 */ float unk_28;
    /* 0x2C */ float unk_2C;
} UnkM406Struct; /* size = 0x30 */

typedef struct UnkM406Struct3 {
    /* 0x00 */ s32 unk_00;
    /* 0x04 */ float unk_04;
    /* 0x08 */ s32 unk_08;
    /* 0x0C */ s32 unk_0C;
    /* 0x10 */ float unk_10;
    /* 0x14 */ float unk_14;
    /* 0x18 */ Vec unk_18;
    /* 0x24 */ struct UnkM406Struct5 *unk_24;
} UnkM406Struct3; /* size = 0x28 */

typedef struct UnkM406Struct4 {
    /* 0x00 */ s32 unk_00;
    /* 0x04 */ s32 unk_04;
    /* 0x08 */ s32 unk_08;
    /* 0x0C */ s32 unk_0C;
    /* 0x10 */ float unk_10;
    /* 0x14 */ float unk_14;
    /* 0x18 */ float unk_18;
    /* 0x1C */ float unk_1C;
    /* 0x20 */ float unk_20;
    /* 0x24 */ float unk_24;
    /* 0x28 */ float unk_28;
    /* 0x2C */ float unk_2C;
    /* 0x30 */ Vec unk_30;
    /* 0x3C */ Vec unk_3C;
} UnkM406Struct4; /* size = 0x48 */

typedef struct UnkM406Unk120Struct {
    /* 0x00 */ s32 unk_00;
    /* 0x04 */ s32 unk_04;
    /* 0x08 */ s32 unk_08;
    /* 0x0C */ float unk_0C;
    /* 0x10 */ float unk_10;
    /* 0x14 */ float unk_14;
    /* 0x18 */ float unk_18;
    /* 0x1C */ float unk_1C;
    /* 0x20 */ s32 unk_20;
    /* 0x24 */ s32 unk_24;
    /* 0x28 */ s32 unk_28;
    /* 0x2C */ UnkM406Struct3 *unk_2C;
    /* 0x30 */ UnkM406Struct4 *unk_30;
    /* 0x34 */ Vec unk_34;
    /* 0x40 */ Vec unk_40;
    /* 0x4C */ Mtx unk_4C;
    /* 0x7C */ s32 unk_7C;
    /* 0x80 */ s32 unk_80;
    /* 0x84 */ Vec *unk_84;
    /* 0x88 */ Vec *unk_88;
    /* 0x8C */ Vec2f *unk_8C;
    /* 0x90 */ GXColor *unk_90;
    /* 0x94 */ UnkM406Struct *unk_94;
    /* 0x98 */ s32 unk_98;
    /* 0x9C */ s16 (*unk_9C)[4];
    /* 0xA0 */ u32 unk_A0;
    /* 0xA4 */ void *unk_A4;
    /* 0xA8 */ u8 *unk_A8;
    /* 0xAC */ s32 unk_AC;
    /* 0xB0 */ s32 unk_B0;
    /* 0xB4 */ float unk_B4;
    /* 0xB8 */ float unk_B8;
    /* 0xBC */ u8 *unk_BC;
    /* 0xC0 */ s32 unk_C0;
    /* 0xC4 */ s32 unk_C4;
    /* 0xC8 */ float unk_C8;
    /* 0xCC */ float unk_CC;
} UnkM406Unk120Struct; /* size = 0xD0 */

typedef struct UnkM406Struct5 {
    /* 0x00 */ s16 unk_00;
    /* 0x02 */ s16 unk_02;
    /* 0x04 */ Vec unk_04;
    /* 0x10 */ float unk_10;
    /* 0x14 */ float unk_14;
    /* 0x18 */ float unk_18;
    /* 0x1C */ char unk1C[0xC];
    /* 0x28 */ float unk_28;
    /* 0x2C */ float unk_2C;
    /* 0x30 */ Vec unk_30;
    /* 0x3C */ GXColor unk_3C;
    /* 0x40 */ s32 unk_40;
} UnkM406Struct5; /* size = 0x44 */ // most likely UnkM426Struct8

typedef struct UnkM406Struct9 {
    /* 0x00 */ s16 unk00;
    /* 0x02 */ s16 unk_02;
    /* 0x04 */ s16 unk_04;
    /* 0x06 */ char unk06[2];
} UnkM406Struct9; /* size = 0x08 */

typedef void (*UnkM406Unk120Struct2Hook)(struct model_data *, struct UnkM406Unk120Struct2 *, Mtx);

typedef struct UnkM406Unk120Struct2 {
    /* 0x00 */ s16 unk_00;
    /* 0x02 */ s16 unk_02;
    /* 0x04 */ char unk04[0x18];
    /* 0x1C */ UnkM406Struct9 *unk_1C;
    /* 0x20 */ u8 unk_20;
    /* 0x21 */ u8 unk_21;
    /* 0x22 */ u8 unk_22;
    /* 0x23 */ char unk23;
    /* 0x24 */ s16 unk_24;
    /* 0x26 */ s16 unk_26;
    /* 0x28 */ s32 unk_28;
    /* 0x2C */ s32 unk_2C;
    /* 0x30 */ u32 unk_30;
    /* 0x34 */ u32 unk_34;
    /* 0x38 */ AnimData *unk_38;
    /* 0x3C */ UnkM406Struct5 *unk_3C;
    /* 0x40 */ Vec *unk_40;
    /* 0x44 */ Vec2f *unk_44;
    /* 0x48 */ void *unk_48;
    /* 0x4C */ UnkM406Unk120Struct2Hook unk_4C;
    /* 0x50 */ ModelData *unk_50;
} UnkM406Unk120Struct2; /* size = 0x54 */ // strongly assumed to be a copy of UnkModelDataUnk120Struct

typedef struct UnkM406Struct6 {
    /* 0x00 */ s32 unk_00;
    /* 0x04 */ s32 unk_04;
} UnkM406Struct6; /* size = 0x08 */ // probably the same as UnkM426Struct13

typedef struct UnkM406Struct7 {
    /* 0x00 */ u8 unk_00;
    /* 0x01 */ u8 unk_01;
    /* 0x02 */ char unk02[2];
    /* 0x04 */ s32 unk_04;
    /* 0x08 */ s32 unk_08;
    /* 0x0C */ float unk_0C;
    /* 0x10 */ float unk_10;
    /* 0x14 */ float unk_14;
    /* 0x18 */ float unk_18;
    /* 0x1C */ Mtx unk_1C;
} UnkM406Struct7; /* size = 0x4C */

typedef struct UnkM406Struct8 {
    /* 0x00 */ AnimData *unk_00;
    /* 0x04 */ AnimData *unk_04;
    /* 0x08 */ AnimData *unk_08;
    /* 0x0C */ AnimData *unk_0C;
    /* 0x10 */ s32 unk_10;
    /* 0x14 */ s32 unk_14;
    /* 0x18 */ s32 unk_18;
    /* 0x1C */ s32 unk_1C;
    /* 0x20 */ s32 unk_20;
    /* 0x24 */ float unk_24;
    /* 0x28 */ float unk_28;
} UnkM406Struct8; /* size = 0x2C */

typedef struct UnkM406Struct10 {
    /* 0x00 */ s32 unk_00;
    /* 0x04 */ s32 unk_04;
    /* 0x08 */ AnimData *unk_08;
} UnkM406Struct10; /* size = 0x0C */

void fn_1_292C(omObjData *object);
void fn_1_2C24(omObjData *object);
void fn_1_3158(void);
void fn_1_4568(void);
void fn_1_45BC(ModelData *arg0, Mtx arg1);
void fn_1_6304(ModelData *arg0, Mtx arg1);
void fn_1_64F8(UnkM406Struct2 *arg0);
s32 fn_1_66F4(float arg8, float *arg0);
void fn_1_67CC(ModelData *arg0);
void fn_1_6F24(void);
void fn_1_6FFC(void);
void fn_1_717C(void);
s32 fn_1_71C4(Vec arg0, Vec arg1, float arg8, float arg9, GXColor arg2);
void fn_1_7718(void);
void fn_1_77F0(void);
void fn_1_79B0(void);
s32 fn_1_79F8(Vec arg0, Vec arg1, float arg8, float arg9, GXColor arg2);
UnkM406Struct5 *fn_1_7B2C(s32 arg0);
void fn_1_7B9C(void);
void fn_1_7C4C(void);
void fn_1_7DAC(void);
s32 fn_1_7DB0(Vec arg0, Vec arg1, float arg8, GXColor arg2);
void fn_1_7ED0(void);
void fn_1_7F80(void);
void fn_1_8100(void);
s32 fn_1_8104(Vec arg0, Vec arg1, float arg8, GXColor arg2);
