#include "ext_math.h"
#include "game/audio.h"
#include "game/chrman.h"
#include "game/gamework_data.h"
#include "game/hsfdraw.h"
#include "game/hsfload.h"
#include "game/hsfman.h"
#include "game/hsfmotion.h"
#include "game/objsub.h"
#include "game/pad.h"
#include "game/sprite.h"

#include "REL/m406Dll.h"

typedef struct UnkM406PlayerStruct {
    /* 0x00 */ float unk_00;
    /* 0x04 */ float unk_04;
} UnkM406PlayerStruct; /* size = 0x08 */

typedef struct UnkM406PlayerStruct2 {
    /* 0x00 */ Vec *unk_00;
    /* 0x04 */ HsfFace *unk_04;
    /* 0x08 */ s16 unk_08;
} UnkM406PlayerStruct2; /* size = 0x0C */

typedef struct M406PlayerWork {
    /* 0x00 */ union {
        struct {
            u8 unk_00_field0 : 1;
            u8 unk_00_field1 : 1;
            u8 unk_00_field2 : 1;
            u8 unk_00_field3 : 1;
            u8 unk_00_field4 : 1;
            u8 unk_00_field5 : 1;
        };
        s16 unk_00;
    };
    /* 0x02 */ s16 unk_02;
    /* 0x04 */ s16 unk_04;
    /* 0x06 */ s8 unk_06;
    /* 0x07 */ s8 unk_07;
    /* 0x08 */ u16 unk_08;
    /* 0x0A */ u16 unk_0A;
    /* 0x0C */ s16 unk_0C;
    /* 0x0E */ s16 unk_0E;
    /* 0x10 */ s16 unk_10;
    /* 0x12 */ s16 unk_12;
    /* 0x14 */ Vec unk_14;
    /* 0x20 */ char unk20[0xC];
    /* 0x2C */ Vec unk_2C;
    /* 0x38 */ s32 unk_38;
    /* 0x3C */ u32 unk_3C;
    /* 0x40 */ float unk_40;
    /* 0x44 */ UnkM406PlayerStruct2 unk_44;
    /* 0x50 */ float unk_50;
    /* 0x54 */ float unk_54;
    /* 0x58 */ s16 unk_58;
    /* 0x5A */ s16 unk_5A;
    /* 0x5C */ s16 unk_5C;
    /* 0x5E */ s16 unk_5E;
    /* 0x60 */ s16 unk_60;
    /* 0x62 */ s16 unk_62;
    /* 0x64 */ s16 unk_64;
    /* 0x68 */ float unk_68;
    /* 0x6C */ float unk_6C;
    /* 0x70 */ float unk_70;
    /* 0x74 */ float unk_74;
    /* 0x78 */ float unk_78;
    /* 0x7C */ s32 unk_7C[2];
} M406PlayerWork; /* size = 0x84 */

void fn_1_1065C(omObjData *object);
void fn_1_10744(omObjData *object);
void fn_1_11058(omObjData *object);
void fn_1_114A0(omObjData *object);
void fn_1_117BC(float arg8, float arg9, UnkM406PlayerStruct2 *arg0, Vec *arg1);
float fn_1_12194(Vec *arg0);
void fn_1_12270(omObjData *object);
void fn_1_1275C();
s32 fn_1_127B8();
s32 fn_1_129E4(omObjData *object);
void fn_1_12AB8(omObjData *object);
void fn_1_12B00(omObjData *object);
void fn_1_12B38(Vec *arg0);
void fn_1_12BC4(omObjData *object);
void fn_1_13A88(s16 arg0, char *arg1, Mtx arg2);
float fn_1_13AF4(float arg8, float arg9, float argA);
s32 fn_1_13C10(Vec *arg0, Vec *arg1);
float fn_1_143F4(Vec *arg0, UnkM406PlayerStruct2 *arg1);
void fn_1_D90C(omObjData *object);
void fn_1_DD7C(omObjData *object, s32 arg1, float arg8, u32 arg2);
void fn_1_DE60(omObjData *object);
void fn_1_E214(omObjData *object);
void fn_1_F194(omObjData *object);
