#include "REL/m435Dll.h"
#include "game/chrman.h"
#include "game/data.h"
#include "game/esprite.h"
#include "game/gamework.h"
#include "game/gamework_data.h"
#include "game/hsfman.h"
#include "game/hsfmotion.h"
#include "game/minigame_seq.h"
#include "game/objsub.h"
#include "game/pad.h"
#include "game/printfunc.h"
#include "game/process.h"
#include "game/sprite.h"
#include "game/window.h"
#include "game/wipe.h"

#include "ext_math.h"

typedef struct {
    /* 0x00 */ omObjData* unk00;
    /* 0x04 */ s32 unk04;
    /* 0x08 */ s32 unk08;
    /* 0x0C */ s32 unk0C;
    /* 0x10 */ s32 unk10;
    /* 0x14 */ s32 unk14;
    /* 0x18 */ s32 unk18;
    /* 0x1C */ s32 unk1C;
    /* 0x20 */ s32 unk20;
    /* 0x24 */ s32 unk24;
    /* 0x28 */ s32 unk28;
    /* 0x2C */ s32 unk2C;
    /* 0x30 */ s32 unk30;
    /* 0x34 */ s32 unk34;
    /* 0x38 */ s32 unk38;
    /* 0x3C */ float unk3C;
    /* 0x40 */ float unk40;
    /* 0x44 */ float unk44;
    /* 0x48 */ float unk48;
    /* 0x4C */ float unk4C;
    /* 0x50 */ float unk50;
    /* 0x54 */ float unk54;
    /* 0x58 */ StructFn19894 unk58;
} StructBssE88; // Size 0x4D8

typedef struct {
    /* 0x00 */ omObjData* unk00;
    /* 0x04 */ s32 unk04;
    /* 0x08 */ s32 unk08;
    /* 0x0C */ s32 unk0C;
    /* 0x10 */ s32 unk10;
    /* 0x14 */ s32 unk14;
    /* 0x18 */ s32 unk18;
    /* 0x1C */ s32 unk1C;
    /* 0x20 */ s32 unk20;
} StructBssDE4; // Size 0x24

typedef struct {
    /* 0x000 */ omObjData* unk00;
    /* 0x004 */ s32 unk04;
    /* 0x008 */ s32 unk08;
    /* 0x00C */ s32 unk0C;
    /* 0x010 */ s32 unk10;
    /* 0x014 */ s32 unk14[3];
    /* 0x020 */ s32 unk20;
    /* 0x024 */ s32 unk24;
    /* 0x028 */ s32 unk28;
    /* 0x02C */ s32 unk2C[3];
    /* 0x038 */ s32 unk38[3];
    /* 0x044 */ s32 unk44[3];
    /* 0x050 */ s32 unk50[3];
    /* 0x05C */ s32 unk5C[3];
    /* 0x068 */ s32 unk68[3];
    /* 0x074 */ float unk74;
    /* 0x078 */ float unk78;
    /* 0x07C */ float unk7C[3];
    /* 0x088 */ float unk88[3];
    /* 0x094 */ float unk94[3];
    /* 0x0A0 */ float unkA0[3];
    /* 0x0AC */ Vec unkAC[3];
    /* 0x0D0 */ Vec unkD0[3];
    /* 0x0F4 */ Vec unkF4[3];
    /* 0x118 */ Vec unk118[3];
    /* 0x13C */ Vec unk13C[3];
    /* 0x160 */ Vec unk160[3];
    /* 0x184 */ Vec unk184[3];
    /* 0x1A8 */ float unk1A8[3];
} StructBssC30; // Size 0x1B4

typedef struct {
    /* 0x00 */ s32 unk00;
    /* 0x04 */ s32 unk04;
    /* 0x08 */ char unk08[0xC];
    /* 0x14 */ s32 unk14;
    /* 0x18 */ char unk18[0x20];
} StructBss4F10; // Size 0x38

typedef struct {
    /* 0x00 */ s32 unk00;
    /* 0x04 */ s32 unk04;
    /* 0x08 */ s32 unk08;
    /* 0x0C */ s32 unk0C;
    /* 0x10 */ s32 unk10;
    /* 0x14 */ s32 unk14;
    /* 0x18 */ s32 unk18;
    /* 0x1C */ s32 unk1C;
} StructBss4EE8; // Size 0x20

typedef struct {
    /* 0x00 */ omObjData* unk00;
    /* 0x04 */ s32 unk04;
    /* 0x08 */ s32 unk08;
    /* 0x0C */ s32 unk0C;
    /* 0x10 */ s32 unk10;
} StructBssC1C; // Size 0x14

typedef struct {
    /* 0x000 */ omObjData* unk00;
    /* 0x004 */ Vec unk04;
    /* 0x010 */ Vec unk10;
    /* 0x01C */ s32 unk1C;
    /* 0x020 */ s32 unk20;
    /* 0x024 */ s32 unk24;
    /* 0x028 */ s32 unk28;
    /* 0x02C */ s32 unk2C;
    /* 0x030 */ s32 unk30;
    /* 0x034 */ s32 unk34;
    /* 0x038 */ s32 unk38;
    /* 0x03C */ StructFn19894 unk3C;
} StructBss2A4; // Size 0x4BC

typedef struct {
    /* 0x00 */ omObjData* unk00;
    /* 0x04 */ s32 unk04[6];
    /* 0x1C */ char unk1C[0x10];
    /* 0x2C */ s32 unk2C;
    /* 0x30 */ s32 unk30;
    /* 0x34 */ s32 unk34;
    /* 0x38 */ s32 unk38;
    /* 0x3C */ s32 unk3C;
    /* 0x40 */ s32 unk40;
    /* 0x44 */ s32 unk44;
    /* 0x48 */ s32 unk48;
    /* 0x4C */ float unk4C;
    /* 0x50 */ s32 unk50;
    /* 0x54 */ s32 unk54;
} StructBss144; // Size 0x58

typedef struct {
    /* 0x00 */ omObjData* unk00;
    /* 0x04 */ s32 unk04;
    /* 0x08 */ float unk08[6];
    /* 0x20 */ char unk20[8];
    /* 0x28 */ float unk28[6];
    /* 0x40 */ char unk40[8];
    /* 0x48 */ float unk48[6];
    /* 0x60 */ char unk60[8];
    /* 0x68 */ float unk68[6];
    /* 0x80 */ char unk80[8];
    /* 0x88 */ float unk88[6];
    /* 0xA0 */ char unkA0[8];
} StructBss9C; // Size 0xA8

void fn_1_3AF4(s32 arg0);
void fn_1_4104(s32 arg0);
void fn_1_7D50(s32 arg0);
void fn_1_8544(s32 arg0);
s32 fn_1_8E48(s32 arg0);
s32 fn_1_8F34(s32 arg0);

StructBss4F10 lbl_1_bss_4F10;
s32 lbl_1_bss_4F08[2];
StructBss4EE8 lbl_1_bss_4EE8;
char lbl_1_bss_21E8_pad[0x2D00]; // unused
StructBssE88 lbl_1_bss_E88[4];
StructBssE08 lbl_1_bss_E08;
StructBssDE4 lbl_1_bss_DE4;
StructBssC30 lbl_1_bss_C30;
StructBssC1C lbl_1_bss_C1C;
StructBss2A4 lbl_1_bss_2A4[2];
StructBss144 lbl_1_bss_144[4];
StructBss9C lbl_1_bss_9C;
StructBss84 lbl_1_bss_84;
StructBss84 lbl_1_bss_6C;
Vec lbl_1_bss_3C[4];
StructBss84 lbl_1_bss_24;
s32 lbl_1_bss_20;
s32 lbl_1_bss_1C;
s32 lbl_1_bss_18; // unused
s32 lbl_1_bss_14;
s32 lbl_1_bss_10;
s32 lbl_1_bss_C;
s32 lbl_1_bss_8;
s32 lbl_1_bss_4;
Process* lbl_1_bss_0;

s32 lbl_1_data_0[][3] = {
    { DATA_MAKE_NUM(DATADIR_M435, 27), DATA_MAKE_NUM(DATADIR_M435, 26), DATA_MAKE_NUM(DATADIR_MGCONST, 0) },
