#define HUSPR_USE_OLD_DEFS
#include "ext_math.h"
#include "game/audio.h"
#include "game/chrman.h"
#include "game/gamework_data.h"
#include "game/hsfdraw.h"
#include "game/hsfmotion.h"
#include "game/minigame_seq.h"
#include "game/objsub.h"
#include "game/pad.h"
#include "game/sprite.h"
#include "game/wipe.h"
#include "rel_sqrt_consts.h"

#include "REL/m442Dll.h"

typedef struct M442StructBss5C {
    /* 0x00 */ float unk_00; // probably Vec
    /* 0x04 */ float unk_04;
    /* 0x08 */ float unk_08;
    /* 0x0C */ float unk_0C;
    /* 0x10 */ float unk_10;
    /* 0x14 */ char unk14[4];
    /* 0x18 */ s16 unk_18;
    /* 0x1A */ s16 unk_1A;
    /* 0x1C */ float unk_1C;
    /* 0x20 */ float unk_20;
    /* 0x24 */ float unk_24;
    /* 0x28 */ float unk_28;
    /* 0x2C */ float unk_2C;
} M442StructBss5C; /* size = 0x30 */

typedef struct M442StructBssC05C {
    /* 0x00 */ void *unk_00;
    /* 0x04 */ u16 unk_04;
    /* 0x06 */ u16 unk_06;
    /* 0x08 */ u16 unk_08;
    /* 0x0A */ u16 unk_0A;
    /* 0x0C */ u32 unk_0C;
    /* 0x10 */ s32 unk_10;
} M442StructBssC05C; /* size = 0x14 */

typedef struct M442StructBssC084 {
    /* 0x00 */ Vec unk_00;
    /* 0x0C */ u8 unk_0C;
    /* 0x0E */ s16 unk_0E;
    /* 0x10 */ float unk_10;
} M442StructBssC084; /* size = 0x14 */

typedef struct M442StructBssC9F8 {
    /* 0x00 */ Vec unk_00;
    /* 0x0C */ u8 unk_0C;
    /* 0x0E */ s16 unk_0E;
    /* 0x10 */ omObjData *unk_10;
} M442StructBssC9F8; /* size = 0x14 */

typedef struct M442MainWork {
    /* 0x00 */ struct {
        u8 unk_00_field0 : 1;
        u8 unk_00_field1 : 1;
        u8 unk_00_field2 : 1;
        u8 unk_00_field3 : 1;
    };
    /* 0x02 */ s16 unk_02;
    /* 0x04 */ s16 unk_04;
    /* 0x06 */ s8 unk_06;
    /* 0x07 */ s8 unk_07;
    /* 0x08 */ u16 unk_08;
    /* 0x0A */ u16 unk_0A;
    /* 0x0C */ s32 unk_0C;
    /* 0x10 */ s16 unk_10;
    /* 0x12 */ s16 unk_12;
    /* 0x14 */ s16 unk_14;
    /* 0x16 */ s16 unk_16;
    /* 0x18 */ float unk_18;
    /* 0x1C */ float unk_1C;
    /* 0x20 */ char unk20[4];
    /* 0x24 */ Vec unk_24;
    /* 0x30 */ s32 unk_30;
    /* 0x34 */ s32 unk_34;
    /* 0x38 */ float unk_38;
    /* 0x3C */ s16 unk_3C;
    /* 0x3E */ s16 unk_3E;
    /* 0x40 */ s16 unk_40;
    /* 0x42 */ s16 unk_42;
    /* 0x44 */ float unk_44;
    /* 0x48 */ s16 unk_48;
    /* 0x4A */ char unk4A[2];
    /* 0x4C */ float unk_4C;
    /* 0x50 */ float unk_50;
    /* 0x54 */ float unk_54;
    /* 0x58 */ float unk_58;
    /* 0x5C */ s32 unk_5C;
    /* 0x60 */ char unk60[0xC];
    /* 0x6C */ s16 unk_6C;
    /* 0x70 */ Vec unk_70;
    /* 0x7C */ s32 unk_7C;
} M442MainWork; /* size = 0x80 */

typedef struct M442StructData0 {
    /* 0x00 */ float unk_00;
    /* 0x04 */ float unk_04;
    /* 0x08 */ float unk_08;
    /* 0x0C */ float unk_0C;
    /* 0x10 */ float unk_10;
    /* 0x14 */ float unk_14;
    /* 0x18 */ float unk_18;
} M442StructData0; /* size = 0x1C */

typedef struct M442MainWork2 {
    /* 0x00 */ struct {
        u8 unk_00_field0 : 1;
    };
    /* 0x02 */ s16 unk_02;
    /* 0x04 */ s16 unk_04;
    /* 0x06 */ s16 unk_06;
    /* 0x08 */ float unk_08;
    /* 0x0C */ s16 unk_0C;
    /* 0x0E */ s16 unk_0E;
    /* 0x10 */ s32 unk_10;
    /* 0x14 */ s16 unk_14;
    /* 0x16 */ s16 unk_16;
    /* 0x18 */ float unk_18;
} M442MainWork2; /* size = 0x1C */

void GWMGRecordSet(s32 index, s32 value);
u32 GWMGRecordGet(s32 index);

void fn_1_A30(omObjData *object);
void fn_1_A90(Process *arg0);
void fn_1_D9C(void);
s32 fn_1_E04(void);
void fn_1_E88(omObjData *object);
void fn_1_2254(omObjData *object);
s16 fn_1_31FC(omObjData *object);
void fn_1_35AC(omObjData *object);
void fn_1_3658(omObjData *object);
void fn_1_37B8(omObjData *object);
void fn_1_394(omObjData *object);
s32 fn_1_3AE4(omObjData *object, Vec *arg1);
void fn_1_3C20(omObjData *object);
void fn_1_3C94(omObjData *object);
void fn_1_3E14(omObjData *object);
void fn_1_3E64(Process *arg0);
void fn_1_3EBC(void);
void fn_1_3EC0(omObjData *object);
void fn_1_4364(omObjData *object);
void fn_1_4444(s32 arg0);
void fn_1_448(omObjData *object);
void fn_1_485C(ModelData *model, Mtx mtx);
void fn_1_54C8(ModelData *model, Mtx mtx);
s16 fn_1_5918(Vec *arg0);
void fn_1_5A48(ModelData *model, Mtx mtx);
