#include "REL/option.h"
#include "game/data.h"
#include "game/esprite.h"
#include "game/gamework_data.h"
#include "game/hsfman.h"
#include "game/hsfmotion.h"
#include "game/memory.h"
#include "game/msm.h"
#include "game/process.h"
#include "game/window.h"

#include "dolphin.h"
#include "math.h"

typedef struct {
    /* 0x000 */ omObjData *unk00[26];
    /* 0x068 */ UnkWindowDataStruct *unk68[13];
    /* 0x09C */ s32 unk9C;
    /* 0x0A0 */ s16 unkA0[19];
    /* 0x0C6 */ char unkC6[2];
    /* 0x0C8 */ s32 unkC8;
    /* 0x0CC */ s32 unkCC;
    /* 0x0D0 */ s32 unkD0;
    /* 0x0D4 */ s32 unkD4;
    /* 0x0D8 */ s32 unkD8;
    /* 0x0DC */ s32 unkDC;
    /* 0x0E0 */ s16 unkE0;
    /* 0x0E2 */ char unkE2[2];
    /* 0x0E4 */ s32 unkE4;
    /* 0x0E8 */ s32 unkE8;
    /* 0x0EC */ s32 unkEC;
    /* 0x0F0 */ s16 unkF0;
    /* 0x0F2 */ s16 unkF2;
    /* 0x0F4 */ s16 unkF4;
    /* 0x0F6 */ s16 unkF6;
    /* 0x0F8 */ s32 unkF8;
    /* 0x0FC */ s32 unkFC;
    /* 0x100 */ s32 unk100;
    /* 0x104 */ float unk104;
    /* 0x108 */ float unk108;
    /* 0x10C */ Process *unk10C;
} UnkSoundDataStruct00; // Size 0x110

typedef struct {
    /* 0x00 */ s32 unk00;
    /* 0x04 */ s32 unk04;
    /* 0x08 */ s32 unk08;
    /* 0x0C */ float unk0C;
    /* 0x10 */ float unk10;
} UnkSoundDataStruct01; // Size 0x14

typedef struct {
    /* 0x00 */ BOOL unk00;
    /* 0x04 */ s32 unk04;
    /* 0x08 */ s16 unk08;
    /* 0x0A */ s16 unk0A;
    /* 0x0C */ s32 unk0C;
} lbl_1_rodata_1E0_Data; // Size 0x10

static void fn_1_43E8(omObjData *arg0);
static void fn_1_4658(omObjData *arg0);
static void fn_1_4A7C(omObjData *arg0);
static void fn_1_4E50(omObjData *arg0);
static void fn_1_578C(omObjData *arg0);
static void fn_1_6044(omObjData *arg0, s32 arg1);
static void fn_1_613C(omObjData *arg0);
static omObjData *fn_1_61A0(void);
static void fn_1_629C(omObjData *arg0);
static omObjData *fn_1_62F0(void);
static void fn_1_63EC(omObjData *arg0);
static omObjData *fn_1_6440(void);
static void fn_1_64D4(omObjData *arg0);
static omObjData *fn_1_6528(s32 arg0, s32 arg1);
static void fn_1_6640(omObjData *arg0);
static void fn_1_6694(omObjData *arg0);
static void fn_1_66CC(omObjData *arg0);
static void fn_1_6704(omObjData *arg0);
static void fn_1_67C8(omObjData *arg0);
static void fn_1_6828(omObjData *arg0);
static void fn_1_6A0C(omObjData *arg0);
static void fn_1_6A80(omObjData *arg0);
static void fn_1_6C5C(omObjData *arg0);
