#include "REL/option.h"
#include "ext_math.h"
#include "game/data.h"
#include "game/esprite.h"
#include "game/gamework_data.h"
#include "game/hsfman.h"
#include "game/hsfmotion.h"
#include "game/memory.h"
#include "game/msm.h"
#include "game/process.h"
#include "game/window.h"

#include "dolphin.h"
#include "math.h"

typedef struct {
    /* 0x000 */ omObjData *objects[26];
    /* 0x068 */ WindowWork *window[13];
    /* 0x09C */ s32 mode;
    /* 0x0A0 */ s16 sprList[19];
    /* 0x0C6 */ char unkC6[2];
    /* 0x0C8 */ s32 changeTimer;
    /* 0x0CC */ s32 selectedOption;
    /* 0x0D0 */ s32 soundMode;
    /* 0x0D4 */ s32 page;
    /* 0x0D8 */ s32 lSelection; // list selection
    /* 0x0DC */ s32 prevLSelection;
    /* 0x0E0 */ s16 sndGrpSet;
    /* 0x0E2 */ char unkE2[2];
    /* 0x0E4 */ BOOL optionSelected;
    /* 0x0E8 */ BOOL unkE8;
    /* 0x0EC */ BOOL cameraDoneF;
    /* 0x0F0 */ s16 bgMusicStat;
    /* 0x0F2 */ s16 audSeqStat;
    /* 0x0F4 */ s16 audSStreamStat;
    /* 0x0F6 */ s16 audFxStat;
    /* 0x0F8 */ s32 selectionChangeTimer;
    /* 0x0FC */ s32 pageChange;
    /* 0x100 */ s32 lSelectionChange;
    /* 0x104 */ float lSelectionPos;
    /* 0x108 */ float lSelectionChangeSpeed;
    /* 0x10C */ Process *speakerNoteProcess;
} SoundWork; // Size 0x110

typedef struct {
    /* 0x00 */ BOOL enabled;
    /* 0x04 */ s32 noteType;
    /* 0x08 */ s32 speakerId;
    /* 0x0C */ float pos;
    /* 0x10 */ float speed;
} NoteWork; // Size 0x14

typedef struct {
    /* 0x00 */ BOOL enabled;
    /* 0x04 */ s32 nameMess;
    /* 0x08 */ s16 audType;
    /* 0x0A */ s16 sndGrpSet;
    /* 0x0C */ s32 fxId;
} SndSelData; // Size 0x10

#define NUM_NOTES 16

#define MODE_DISABLED 0
#define MODE_HANDLE_INITIAL_SCREEN 1
#define MODE_HANDLE_OPTION_SEL 2
#define MODE_HANDLE_SOUND 3
#define MODE_HANDLE_MUSIC 4
#define MODE_HANDLE_VOICE 5

#define SOUND_MODE_STEREO 0
#define SOUND_MODE_MONO 1

#define NUM_BOARDS 6

#define NOTE_TYPE_QUAVER 0
#define NOTE_TYPE_QUARTER 1

#define SPEAKER_LEFT 0
#define SPEAKER_RIGHT 1

static void HandleInitialScreen(omObjData *object);
static void HandleOptionSel(omObjData *object);
static void HandleSoundSettings(omObjData *object);
static void HandleMusic(omObjData *object);
static void HandleVoice(omObjData *object);
static void TurnOnIndicator(omObjData *object, s32 id);
static void TurnOffIndicators(omObjData *object);
static omObjData *CreateOptionHand(void);
static void KillOptionHand(omObjData *optionHand);
static omObjData *CreateSoundSettingsHand(void);
static void KillSoundSettingsHand(omObjData *soundSettingsHand);
