#include "REL/option.h"
#include "ext_math.h"
#include "game/data.h"
#include "game/esprite.h"
#include "game/gamework_data.h"
#include "game/hsfman.h"
#include "game/hsfmotion.h"
#include "game/memory.h"
#include "game/msm.h"
#include "game/process.h"
#include "game/window.h"

#include "dolphin.h"
#include "math.h"

typedef struct {
    /* 0x000 */ omObjData *object[26];
    /* 0x068 */ OptionWindow *window[13];
    /* 0x09C */ s32 execMode;
    /* 0x0A0 */ s16 sprite[19];
    /* 0x0C8 */ s32 changeTimer;
    /* 0x0CC */ s32 selectedOption;
    /* 0x0D0 */ s32 soundMode;
    /* 0x0D4 */ s32 page;
    /* 0x0D8 */ s32 cursorPos;
    /* 0x0DC */ s32 prevCursorPos;
    /* 0x0E0 */ s16 sndGrpSet;
    /* 0x0E4 */ BOOL optionSelected;
    /* 0x0E8 */ BOOL doneF;
    /* 0x0EC */ BOOL cameraDoneF;
    /* 0x0F0 */ s16 bgMusicStat;
    /* 0x0F2 */ s16 seqStat;
    /* 0x0F4 */ s16 streamStat;
    /* 0x0F6 */ s16 fxStat;
    /* 0x0F8 */ s32 cursorDelay;
    /* 0x0FC */ s32 pageDelta;
    /* 0x100 */ s32 cursorDelta;
    /* 0x104 */ float cursorTime;
    /* 0x108 */ float cursorSpeed;
    /* 0x10C */ Process *noteSpawner;
} SoundWork; // Size 0x110

typedef struct {
    /* 0x00 */ BOOL enabled;
    /* 0x04 */ s32 type;
    /* 0x08 */ s32 side;
    /* 0x0C */ float pos;
    /* 0x10 */ float speed;
} NoteWork; // Size 0x14

typedef struct {
    /* 0x00 */ BOOL enabled;
    /* 0x04 */ s32 nameMess;
    /* 0x08 */ s16 type;
    /* 0x0A */ s16 sndGrpSet;
    /* 0x0C */ s32 id;
} SndSelData; // Size 0x10

#define NUM_NOTES 16

#define MODE_DISABLED 0
#define MODE_HANDLE_INITIAL_SCREEN 1
#define MODE_HANDLE_OPTION_SEL 2
#define MODE_HANDLE_SOUND 3
#define MODE_HANDLE_MUSIC 4
#define MODE_HANDLE_VOICE 5

#define SOUND_MODE_STEREO 0
#define SOUND_MODE_MONO 1

#define NUM_BOARDS 6

#define NOTE_TYPE_QUAVER 0
#define NOTE_TYPE_QUARTER 1

#define NOTE_SIDE_LEFT 0
#define NOTE_SIDE_RIGHT 1

static void ExecZoom(omObjData *object);
static void ExecOptionSel(omObjData *object);
static void ExecOutputMode(omObjData *object);
static void ExecMusic(omObjData *object);
static void ExecVoice(omObjData *object);
static void LightSetCurr(omObjData *object, s32 id);
static void LightSetNone(omObjData *object);
static omObjData *CreateHand(void);
static void KillHand(omObjData *object);
static omObjData *CreateOutputModeHand(void);
static void KillOutputModeHand(omObjData *object);
static omObjData *CreateSystem(void);
