#include "REL/m427Dll.h"

#include "dolphin/gx/GXEnum.h"
#include "dolphin/gx/GXStruct.h"
#include "dolphin/gx/GXVert.h"
#include "dolphin/pad.h"
#include "ext_math.h"
#include "game/animdata.h"
#include "game/audio.h"
#include "game/hsfanim.h"
#include "game/hsfdraw.h"
#include "game/hsfman.h"
#include "game/hsfmotion.h"
#include "game/memory.h"
#include "game/object.h"
#include "game/pad.h"
#include "game/sprite.h"
#include "string.h"

extern s32 rand8(void);
extern LightData Hu3DLocalLight[0x20];

#define FABS(value) ((value < 0) ? -(value) : (value))

typedef struct M427DllStruct2 {
    s32 unk0[3];
    s32 unkC;
    s32 unk10;
    s32 unk14[7];
    s32 unk30[7];
    HsfVector2f unk4C[7];
    f32 unk84;
    f32 unk88;
    s32 unk8C;
    f32 unk90;
    f32 unk94;
    f32 unk98;
    s32 unk9C;
    s32 unkA0;
} M427DllStruct2; // sizeof 0xA4

typedef struct M427DllStruct3 {
    Vec rot;
    Vec cen;
    f32 zoom;
} M427DllStruct3; // sizeof 0x1C

typedef struct M427DllMapStruct {
    u8 unk0;
    char unk_1;
    s16 unk2;
    s16 unk4;
    char unk_6[0x2];
    AnimData *unk8;
    Vec unkC;
    Vec unk18;
    Vec unk24;
    Vec unk30;
    Vec2f unk3C;
    Vec2f unk44;
    Vec2f unk4C;
    Vec2f unk54;
    Vec2f unk5C[4];
    GXColor unk7C;
    void *unk80;
    s32 unk84;
    float unk88;
    float unk8C;
    float unk90;
    float unk94;
} M427DllMapStruct; // sizeof 0x98

typedef struct M427DllMapStruct2 {
    s8 unk0;
    s16 unk2;
    s16 unk4;
} M427DllMapStruct2; // sizeof 0x6

typedef struct M427DllMapSubstruct {
    s16 unk0;
    Vec unk4;
} M427DllMapSubstruct; // sizeof 0x10

typedef struct M427DllMapSubstruct2 {
    s16 unk0;
    Vec unk4;
    s16 unk10[2];
    s16 unk14[4];
} M427DllMapSubstruct2; // sizeof 0x1C

typedef struct M427DllMapSubstruct7 {
    s16 unk0;
    s32 unk4;
    void *unk8;
} M427DllMapSubstruct7; // sizeof 0xC

typedef struct M427DllMapUNKB8 {
    s16 unk0;
    s16 unk2;
    s16 unk4;
    s16 unk6;
    u8 unk8;
    s16 unkA;
    float unkC;
    float unk_10;
    float unk_14;
    s16 unk18;
    s16 unk1A;
    s16 unk1C;
    s16 unk1E;
    float unk20;
    float unk24;
    float unk28;
    float unk2C;
} M427DllMapUNKB8; // sizeof 0x30

typedef struct M427DllMapUNK17E {
    s16 unk0;
    s16 unk2;
} M427DllMapUNK17E; // sizeof 0x4

typedef struct M427DllMapSubstruct3Sub {
    s16 unk0;
    void *unk4;
    u32 unk8;
} M427DllMapSubstruct3Sub; // sizeof 0xC

typedef struct M427DllMapSubstruct3 {
    s16 unk0;
    s16 unk2[11];
    s16 unk18;
    s16 unk1A;
    s16 unk1C;
    s16 unk1E;
    s16 unk20;
    char unk_22[2];
    float unk24[4];
    s16 unk34[4];
    s16 unk3C[4];
    s16 unk44[0xB];
    s16 unk5A;
    s16 unk5C;
    char unk_5E[2];
    Vec unk_60;
    Vec unk_6C;
    Vec unk78;
    Vec unk84;
    f32 unk90;
    M427DllMapSubstruct3Sub unk94;
    char unk_A0[0xC];
    struct M427DllMapStruct6 *unkAC;
    s16 unkB0[1];
    char unk_B2[0x6];
    M427DllMapUNKB8 unkB8[2][2];
    s16 unk178[3];
    M427DllMapUNK17E unk17E[2][2];
    s16 unk18E[2];
    char unk194[4];
} M427DllMapSubstruct3; // sizeof 0x198

typedef struct M427DllMapStruct3Sub {
    AnimData *unk_00;
    AnimData *unk_04;
    float unk_08;
    float unk_0C;
    float unk_10;
    float unk_14;
} M427DllMapStruct3Sub; // sizeof 0x18

typedef struct M427DllMapStruct3 {
    u8 unk0;
    M427DllMapSubstruct3 unk4[2];
    M427DllMapStruct3Sub unk334;
    M427DllMapSubstruct2 unk34C[3];
    M427DllMapSubstruct unk3A0[5];
} M427DllMapStruct3; // sizeof 0x3F0

typedef struct M427DllMapSubstruct5 {
    s16 unk0;
    s16 unk2;
    s16 unk4;
    s16 unk6;
    Vec unk8;
    char unk14[0x8];
} M427DllMapSubstruct5; // sizeof 0x1C

typedef struct M427DllMapStruct4 {
    s16 unk0;
    Vec *unk4;
    Vec2f *unk8;
    Vec *unkC;
    GXColor *unk10;
    s16 unk14;
    s16 unk16;
    s16 unk18;
    M427DllMapSubstruct5 *unk1C;
    void *unk20;
    u32 unk24;
    void *unk28;
    u32 unk2C;
    void *unk30;
    u32 unk34;
    f32 unk38;
    f32 unk3C;
    f32 unk40;
    f32 unk44;
    s16 unk48[1];
    s16 unk4A;
} M427DllMapStruct4; // sizeof 0x4C

typedef struct M427DllMapStruct5 {
    f32 unk0;
    f32 unk4;
    f32 unk8;
    f32 unkC;
    f32 unk10;
} M427DllMapStruct5; // sizeof 0x14

typedef struct M427DllMapStruct6 {
    s16 unk_00;
    Vec *unk_04;
    Vec *unk_08;
    float unk_0C;
    float unk_10;
    float unk_14;
    float unk_18;
    float unk_1C;
    float unk_20;
    float unk_24;
    AnimData *unk_28;
    Vec *unk_2C;
    Vec2f *unk_30;
    Vec *unk_34;
    s16 unk_38;
    s16 unk_3A;
    s16 unk_3C;
    char pad_3E[2];
    void *unk_40;
    u32 unk_44;
    M427DllMapSubstruct5 *unk_48;
    float unk_4C;
    float unk_50;
    float unk_54;
    float unk_58;
    float unk_5C;
    /* 0x60 */ float unk_60;
} M427DllMapStruct6; /* size = 0x64, stored in unk_120 */

typedef struct M427DllMapSubstruct6 {
    /* 0x00 */ float unk_00;
    /* 0x04 */ float unk_04;
    /* 0x08 */ float unk_08;
    /* 0x0C */ char pad_0C[0xC]; /* maybe part of unk_08[4]? */
    /* 0x18 */ float unk_18;
    /* 0x1C */ float unk_1C;
    /* 0x20 */ float unk_20;
    /* 0x24 */ float unk_24;
    /* 0x28 */ float unk_28;
    /* 0x2C */ float unk_2C;
    /* 0x30 */ float unk_30;
    /* 0x34 */ s16 unk_34;
    /* 0x36 */ s16 unk_36;
    /* 0x38 */ s16 unk_38;
    /* 0x3A */ char pad_3A[2];
    /* 0x3C */ s32 unk_3C;
    /* 0x40 */ s16 unk_40;
    /* 0x42 */ char pad_42[2];
    /* 0x44 */ float unk_44;
    /* 0x48 */ Vec unk_48;
    /* 0x54 */ Vec unk_54;
    /* 0x60 */ s16 unk_60;
    /* 0x62 */ s8 unk_62;
    /* 0x63 */ char pad_63[1];
} M427DllMapSubstruct6; // sizeof 0x64

typedef void (*M427DllHook)(ModelData *model, struct M427DllMapStruct7 *particle, Mtx matrix);

typedef struct M427DllMapStruct7 {
    /* 0x00 */ s16 unk_00;
    /* 0x02 */ char pad_02[2];
    /* 0x04 */ u32 unk_04;
    /* 0x08 */ u8 unk_08;
    /* 0x09 */ char pad_09[3]; /* maybe part of unk_08[4]? */
    /* 0x0C */ M427DllHook unk_0C;
    /* 0x10 */ AnimData *unk_10;
    /* 0x14 */ s16 unk_14;
    /* 0x16 */ char pad_16[2];
    /* 0x18 */ M427DllMapSubstruct6 *unk_18;
    /* 0x1C */ Vec *unk_1C;
    /* 0x20 */ Vec2f *unk_20;
    /* 0x24 */ GXColor *unk_24;
    /* 0x28 */ void *unk_28;
    /* 0x2C */ Vec unk_2C;
    /* 0x38 */ float unk_38;
    /* 0x3C */ float unk_3C;
    /* 0x40 */ float unk_40;
    /* 0x44 */ float unk_44;
    /* 0x48 */ float unk_48;
    /* 0x4C */ float unk_4C;
    /* 0x50 */ float unk_50;
    /* 0x54 */ float unk_54;
    /* 0x58 */ float unk_58;
    /* 0x5C */ Vec2f *unk_5C;
    /* 0x60 */ float unk_60;
    /* 0x64 */ float unk_64;
} M427DllMapStruct7; /* size = 0x68, stored in unk_120 */

GXColor lbl_1_data_E8 = { 0xFF, 0xFF, 0xFF, 0xFF };

omObjData *lbl_1_bss_548;
M427DllMapStruct3 lbl_1_bss_158;
M427DllMapStruct2 lbl_1_bss_F8[0x10];
AnimData *lbl_1_bss_F4;
M427DllMapStruct *lbl_1_bss_F0;
s16 lbl_1_bss_EC[2];
s16 lbl_1_bss_E8[2];
M427DllMapStruct5 *lbl_1_bss_E4;
M427DllMapStruct4 lbl_1_bss_98;
f32 lbl_1_bss_94;
s8 lbl_1_bss_91;
s8 lbl_1_bss_90;

void fn_1_372C(void);
void fn_1_4218(omObjData *object);
void fn_1_44F4(f32, f32, f32, f32, f32);
void fn_1_48EC(ModelData *model, Mtx matrix);
void fn_1_4D7C(ModelData *model, Mtx matrix);
void fn_1_50A0(ModelData *model, Mtx matrix);
void fn_1_510C(s32, s16, s16);
void fn_1_558C(M427DllMapStruct4 *);
void fn_1_618C(ModelData *model, Mtx matrix);
void fn_1_6760(omObjData *object);
void fn_1_C2C8(Vec *arg0, Vec *arg1, Vec *arg2, Vec *arg3);
void fn_1_D22C(ModelData *model, struct M427DllMapStruct7 *arg1, Mtx matrix);
