#include "REL/m427Dll.h"

#include "dolphin/gx/GXEnum.h"
#include "dolphin/gx/GXStruct.h"
#include "dolphin/gx/GXVert.h"
#include "ext_math.h"
#include "game/audio.h"
#include "game/chrman.h"
#include "game/gamework.h"
#include "game/gamework_data.h"
#include "game/hsfdraw.h"
#include "game/hsfformat.h"
#include "game/hsfman.h"
#include "game/hsfmotion.h"
#include "game/memory.h"
#include "game/minigame_seq.h"
#include "game/object.h"
#include "game/objsub.h"
#include "game/pad.h"
#include "game/wipe.h"
#include "string.h"

#ifndef __MWERKS__
#include "game/frand.h"
#endif

typedef struct M427DllPlayerWork2 {
    /* 0x00 */ s32 unk_00;
    /* 0x04 */ s32 unk_04;
    /* 0x08 */ s32 unk_08;
    /* 0x0C */ s32 unk_0C;
    /* 0x10 */ s32 unk_10;
    /* 0x14 */ s32 unk_14;
    /* 0x18 */ s32 unk_18;
    /* 0x1C */ s32 unk_1C;
    /* 0x20 */ s32 unk_20;
    /* 0x24 */ s32 unk_24;
    /* 0x28 */ s32 unk_28;
    /* 0x2C */ s32 unk_2C;
    /* 0x30 */ s32 unk_30;
    /* 0x34 */ s32 unk_34;
    /* 0x38 */ s32 unk_38;
    /* 0x3C */ s32 unk_3C;
    /* 0x40 */ s32 unk_40;
    /* 0x44 */ s32 unk_44;
    /* 0x48 */ s32 unk_48;
    /* 0x4C */ s32 unk_4C;
    /* 0x50 */ s32 unk_50;
    /* 0x54 */ s32 unk_54;
    /* 0x58 */ s32 unk_58;
    /* 0x5C */ s32 unk_5C;
    /* 0x60 */ s32 unk_60;
    /* 0x64 */ s32 unk_64;
    /* 0x68 */ float unk_68;
    /* 0x6C */ float unk_6C;
    /* 0x70 */ float unk_70;
} M427DllPlayerWork2; /* size = 0x74 */

typedef struct M427DllPlayerWork {
    /* 0x00 */ omObjData *unk_00[2];
    /* 0x08 */ M427DllPlayerWork2 *unk_08[2];
    /* 0x10 */ s32 unk_10;
    /* 0x14 */ s32 unk_14;
    /* 0x18 */ s32 unk_18;
    /* 0x1C */ s32 unk_1C;
    /* 0x20 */ s32 unk_20;
    /* 0x24 */ s32 unk_24;
    /* 0x28 */ float unk_28;
    /* 0x2C */ float unk_2C;
    /* 0x30 */ s32 unk_30[5];
    /* 0x34 */ char unk44[8];
    /* 0x4C */ float unk_4C;
    /* 0x50 */ float unk_50;
    /* 0x54 */ float unk_54;
    /* 0x58 */ float unk_58;
    /* 0x5C */ float unk_5C;
    /* 0x60 */ s32 unk_60;
    /* 0x64 */ float unk_64;
    /* 0x68 */ s32 unk_68;
    /* 0x6C */ char unk6C[4];
} M427DllPlayerWork; /* size = 0x70 */

typedef struct M427DllBss57CStruct {
    /* 0x00 */ s32 unk_00;
    /* 0x04 */ s32 unk_04;
    /* 0x08 */ s32 unk_08;
    /* 0x0C */ s32 unk_0C;
    /* 0x10 */ s32 unk_10;
    /* 0x14 */ s32 unk_14;
    /* 0x18 */ s32 unk_18;
    /* 0x1C */ Vec unk_1C;
    /* 0x28 */ Vec unk_28;
    /* 0x34 */ float unk_34;
    /* 0x38 */ char unk38[4];
} M427DllBss57CStruct; /* size = 0x3C */

typedef struct M427DllBss590Struct {
    /* 0x00 */ s32 unk_00;
    /* 0x04 */ s32 unk_04;
    /* 0x08 */ s32 unk_08;
    /* 0x0C */ float unk_0C;
    /* 0x10 */ float unk_10;
    /* 0x14 */ Vec unk_14[2];
    /* 0x2C */ Vec unk_2C[2];
    /* 0x44 */ Vec unk_44;
    /* 0x50 */ float unk_50;
    /* 0x54 */ float unk_54;
    /* 0x58 */ float unk_58;
    /* 0x5C */ float unk_5C;
    /* 0x60 */ float unk_60;
    /* 0x64 */ float unk_64;
    /* 0x68 */ float unk_68;
    /* 0x6C */ float unk_6C;
    /* 0x70 */ float unk_70;
    /* 0x74 */ float unk_74;
    /* 0x78 */ Vec *unk_78;
    /* 0x7C */ Vec *unk_7C;
    /* 0x80 */ Vec *unk_80;
} M427DllBss590Struct; /* size = 0x84 */

void fn_1_10830(omObjData *object);
void fn_1_1143C(omObjData *object);
void fn_1_115B4(omObjData *object);
void fn_1_119C0(omObjData *object);
void fn_1_11A74(omObjData *object);
void fn_1_11ED8(omObjData *object);
void fn_1_12514(omObjData *object);
void fn_1_12518(omObjData *object);
void fn_1_12580(omObjData *object);
void fn_1_12B08(void);
void fn_1_13F24(void);
void fn_1_13FB8(void);
s32 fn_1_155E0(float arg8, float arg9, float argA, float *arg0);
float fn_1_15714(float arg8, float arg9);
void fn_1_158D8(float arg8, float arg9, Vec *arg0);
s32 fn_1_15AF0(s32 arg0, Vec *arg1, Vec *arg2, Vec *arg3, Vec *arg4);
void fn_1_1607C(s32 arg0);
s32 fn_1_160D4(s32 arg0, Vec *arg1, float arg8);
s32 fn_1_16260(s32 arg0, Vec *arg2, Vec *arg3, Vec *arg4, float arg8);
float fn_1_16594(float arg8, float arg9);
void fn_1_16E3C(Vec *arg0, Vec *arg1, Vec *arg2, s32 arg3);
