#include "ext_math.h"
#include "game/audio.h"
#include "game/chrman.h"
#include "game/gamework_data.h"
#include "game/hsfdraw.h"
#include "game/hsfmotion.h"
#include "game/minigame_seq.h"
#include "game/objsub.h"
#include "game/pad.h"
#include "game/wipe.h"

#include "REL/m417Dll.h"

typedef struct UnkM417Struct8 {
    /* 0x00 */ u16 unk_00;
    /* 0x04 */ float unk_04;
    /* 0x08 */ float unk_08;
    /* 0x0C */ float unk_0C;
    /* 0x10 */ u32 unk_10;
} UnkM417Struct8; /* size = 0x14 */

typedef struct UnkM417Struct10 {
    /* 0x04 */ s32 unk_00;
    /* 0x08 */ s32 unk_04;
    /* 0x08 */ s32 unk_08;
    /* 0x0C */ u32 unk_0C;
    /* 0x10 */ u32 unk_10;
    /* 0x14 */ s32 unk_14;
    /* 0x18 */ s32 unk_18;
    /* 0x1C */ s32 unk_1C;
    /* 0x20 */ float unk_20;
    /* 0x24 */ float unk_24;
    /* 0x28 */ s32 unk_28;
    /* 0x2C */ s32 unk_2C;
    /* 0x30 */ s32 unk_30;
    /* 0x34 */ s32 unk_34;
    /* 0x38 */ s32 unk_38;
    /* 0x3C */ s32 unk_3C;
    /* 0x40 */ s32 unk_40;
    /* 0x44 */ s32 unk_44;
    /* 0x48 */ s32 unk_48;
    /* 0x4C */ s32 unk_4C;
    /* 0x50 */ u16 unk_50;
    /* 0x52 */ char unk52[2];
    /* 0x54 */ s32 unk_54;
    /* 0x58 */ char unk58[4];
    /* 0x5C */ s16 unk_5C;
    /* 0x5E */ char unk5E[6];
    /* 0x64 */ float unk_64;
    /* 0x68 */ float unk_68;
    /* 0x6C */ float unk_6C;
    /* 0x70 */ float unk_70;
    /* 0x74 */ float unk_74;
    /* 0x78 */ s32 unk_78;
    /* 0x7C */ float unk_7C;
    /* 0x80 */ u32 unk_80;
    /* 0x84 */ u32 unk_84;
    /* 0x88 */ float unk_88;
    /* 0x8C */ float unk_8C;
    /* 0x90 */ u32 unk_90;
    /* 0x94 */ char unk94[4];
    /* 0x98 */ float unk_98;
    /* 0x9C */ s32 unk_9C;
    /* 0xA0 */ s32 unk_A0;
    /* 0xA4 */ u32 unk_A4;
    /* 0xA8 */ u32 unk_A8;
    /* 0xAC */ float unk_AC;
    /* 0xB0 */ float unk_B0;
    /* 0xB4 */ Vec unk_B4;
    /* 0xC0 */ u32 unk_C0;
    /* 0xC4 */ u32 unk_C4;
    /* 0xC8 */ Vec unk_C8;
    /* 0xD4 */ Vec unk_D4;
    /* 0xE0 */ Vec unk_E0;
    /* 0xEC */ Vec unk_EC;
    /* 0xF8 */ Vec unk_F8;
    /* 0x104 */ Vec unk_104;
    /* 0x110 */ Vec unk_110;
    /* 0x11C */ Quaternion unk_11C;
    /* 0x12C */ float unk_12C;
    /* 0x130 */ float unk_130;
    /* 0x134 */ float unk_134;
    /* 0x138 */ float unk_138;
    /* 0x13C */ float unk_13C;
    /* 0x140 */ float unk_140;
    /* 0x144 */ float unk_144;
    /* 0x148 */ float unk_148;
    /* 0x14C */ Vec unk_14C;
    /* 0x158 */ char unk_158[0xC];
    /* 0x164 */ Quaternion unk_164;
    /* 0x174 */ Quaternion unk_174;
    /* 0x184 */ Quaternion unk_184;
    /* 0x194 */ Quaternion unk_194;
    /* 0x1A4 */ Quaternion unk_1A4;
    /* 0x1B4 */ Quaternion unk_1B4;
    /* 0x1C4 */ Mtx unk_1C4;
    /* 0x1F4 */ Mtx unk_1F4;
    /* 0x224 */ Mtx unk_224;
    /* 0x254 */ Vec unk_254[16]; // maybe less
} UnkM417Struct10; /* size = 0x314 */

void fn_1_7C8C(omObjData *object);
void fn_1_82FC(omObjData *object);
void fn_1_86E8(omObjData *object);
void fn_1_8B0C(omObjData *object);
void fn_1_8D30(omObjData *object);
void fn_1_8E44(omObjData *object);
void fn_1_91E0(omObjData *object);
void fn_1_9298(omObjData *object);
void fn_1_9A1C(omObjData *object);
void fn_1_9C14(omObjData *object);
void fn_1_9FF0(omObjData *object);
void fn_1_AD24(omObjData *object);
void fn_1_ADC4(omObjData *object);
void fn_1_B2C0(omObjData *object);
void fn_1_B8A0(omObjData *object, u32 arg1);
s32 fn_1_BA2C(omObjData *object);
void fn_1_BC70(float arg8, float arg9, Quaternion *arg0);

s32 lbl_1_data_50[][2] = {
    { DATA_MAKE_NUM(DATADIR_M417, 1), DATA_MAKE_NUM(DATADIR_M417, 6) },
    { DATA_MAKE_NUM(DATADIR_M417, 1), DATA_MAKE_NUM(DATADIR_M417, 7) },
    { DATA_MAKE_NUM(DATADIR_M417, 1), DATA_MAKE_NUM(DATADIR_M417, 8) },
