#include "ext_math.h"
#include "game/audio.h"
#include "game/hsfdraw.h"
#include "game/hsfmotion.h"
#include "game/sprite.h"

#include "REL/m417Dll.h"

typedef struct UnkM417Struct3 {
    /* 0x00 */ s16 unk_00;
    /* 0x02 */ char unk02[4];
    /* 0x06 */ s16 unk_06;
    /* 0x08 */ Vec unk_08;
    /* 0x14 */ Vec unk_14;
    /* 0x20 */ float unk_20;
    /* 0x24 */ float unk_24;
    /* 0x28 */ float unk_28;
    /* 0x2C */ float unk_2C;
    /* 0x30 */ float unk_30;
    /* 0x34 */ float unk_34;
} UnkM417Struct3; /* size = 0x38 */

typedef struct UnkM417Struct5 {
    /* 0x00 */ Vec unk_00;
    /* 0x0C */ float unk_0C;
    /* 0x10 */ float unk_10;
    /* 0x14 */ float unk_14;
    /* 0x18 */ float unk_18;
    /* 0x1C */ s32 unk_1C;
    /* 0x20 */ float *unk_20;
    /* 0x24 */ u16 *unk_24;
} UnkM417Struct5; /* size = 0x28 */

typedef struct UnkM417Struct6 {
    /* 0x00 */ u32 unk_00;
    /* 0x04 */ Vec unk_04;
    /* 0x10 */ float unk_10;
    /* 0x14 */ float unk_14;
    /* 0x18 */ float unk_18;
    /* 0x1C */ float unk_1C;
    /* 0x20 */ float unk_20;
    /* 0x24 */ float unk_24;
    /* 0x28 */ float unk_28;
    /* 0x2C */ s32 unk_2C;
    /* 0x30 */ char unk30[0x30];
} UnkM417Struct6; /* size = 0x60 */

typedef struct UnkM417Struct4 {
    /* 0x00 */ float unk_00; // maybe Vec
    /* 0x04 */ float unk_04;
    /* 0x08 */ float unk_08;
    /* 0x0C */ Vec unk_0C;
    /* 0x18 */ u32 unk_18;
    /* 0x1C */ u16 *unk_1C;
    /* 0x20 */ float *unk_20;
    /* 0x24 */ float *unk_24;
    /* 0x28 */ s32 *unk_28;
    /* 0x2C */ Vec *unk_2C;
    /* 0x30 */ Vec *unk_30;
    /* 0x34 */ Vec *unk_34;
    /* 0x38 */ u16 (*unk_38)[4];
    /* 0x3C */ UnkM417Struct5 unk_3C[3];
    /* 0xB4 */ UnkM417Struct6 unk_B4[16];
    /* 0x6B4 */ s32 unk_6B4;
    /* 0x6B8 */ float unk_6B8;
    /* 0x6BC */ Vec *unk_6BC[2];
    /* 0x6C4 */ Vec *unk_6C4[2];
    /* 0x6CC */ GXColor *unk_6CC[2];
    /* 0x6D4 */ Vec2f *unk_6D4[2];
    /* 0x6DC */ s32 unk_6DC;
    /* 0x6E0 */ void *unk_6E0[2];
    /* 0x6E8 */ s32 unk_6E8[2];
    /* 0x6F0 */ u32 unk_6F0;
    /* 0x6F4 */ void *unk_6F4;
    /* 0x6F8 */ char unk6F8[8];
} UnkM417Struct4; /* size = 0x700 */

float fn_1_2F08(float arg8, float arg9, float arg10);
void fn_1_3400(omObjData *object);
void fn_1_3534(omObjData *object);
UnkM417Struct3 *fn_1_3574(omObjData *object, s16 arg1, s16 arg2);
void fn_1_37A0(omObjData *object, UnkM417Struct3 *arg1);
void fn_1_3B1C(omObjData *object, UnkM417Struct3 *arg1);
void fn_1_3BC4(omObjData *object);
void fn_1_3D54(omObjData *object);
void fn_1_3D58(omObjData *object);
void fn_1_57B0(omObjData *object);
void fn_1_5E3C(omObjData *object);
void fn_1_604C(ModelData *model, Mtx mtx);
void fn_1_6B04(ModelData *model, Mtx mtx);
void fn_1_6B60(ModelData *model, Mtx mtx);
void fn_1_6B94(ModelData *model, ParticleData *particle, Mtx mtx);
void fn_1_6D64(s32 arg0, u32 arg1, float arg8, float arg9, float argA);

omObjData *lbl_1_bss_878;
UnkM417Struct4 lbl_1_bss_178;
UnkM417Struct2 lbl_1_bss_68[17];
AnimData *lbl_1_bss_64;
AnimData *lbl_1_bss_60;
AnimData *lbl_1_bss_5C;
s16 lbl_1_bss_58;
