#include "game/board/main.h"
#include "REL/mentDll.h"
#include "ext_math.h"
#include "game/armem.h"
#include "game/chrman.h"
#include "game/hsfdraw.h"
#include "game/hsfman.h"
#include "game/hsfmotion.h"
#include "game/minigame_seq.h"
#include "game/objsub.h"
#include "game/pad.h"
#include "game/printfunc.h"
#include "game/saveload.h"
#include "game/sprite.h"
#include "game/window.h"
#include "game/wipe.h"

typedef struct MentDllUnkBssE4Struct {
    /* 0x00 */ s32 unk_00;
    /* 0x04 */ s32 unk_04;
    /* 0x08 */ s32 unk_08;
    /* 0x0C */ float unk_0C;
    /* 0x10 */ float unk_10;
    /* 0x14 */ float unk_14;
    /* 0x18 */ float unk_18;
} MentDllUnkBssE4Struct; /* size = 0x1C */

typedef struct MentDllUnkBss16C4Struct {
    /* 0x00 */ s32 unk_00;
    /* 0x04 */ s32 unk_04;
    /* 0x08 */ s32 unk_08;
    /* 0x0C */ float unk_0C;
    /* 0x10 */ float unk_10;
    /* 0x14 */ float unk_14;
    /* 0x18 */ float unk_18;
    /* 0x1C */ float unk_1C;
    /* 0x20 */ float unk_20;
    /* 0x24 */ float unk_24;
    /* 0x28 */ float unk_28;
    /* 0x2C */ float unk_2C;
} MentDllUnkBss16C4Struct; /* size = 0x30 */

typedef void (*MentDllUnkFunc)(omObjData *, ...);

typedef struct MentDllUnkBss3114Struct {
    /* 0x00 */ omObjData *unk_00;
    /* 0x04 */ MentDllUnkFunc unk_04;
    /* 0x08 */ s32 unk_08;
    /* 0x0C */ s32 unk_0C;
    /* 0x10 */ char pad_10[0x48]; /* maybe part of unk_0C[0x13]? */
    /* 0x58 */ s32 unk_58;
    /* 0x5C */ s32 unk_5C;
    /* 0x60 */ s32 unk_60;
    /* 0x64 */ s32 unk_64;
    /* 0x68 */ s32 unk_68;
    /* 0x6C */ s32 unk_6C;
    /* 0x70 */ s32 unk_70[4];
    /* 0x80 */ s32 unk_80[4];
} MentDllUnkBss3114Struct; /* size = 0x90 */

typedef struct MentDllUnkBss33ACStruct { // maybe the same as the other one?
    /* 0x00 */ omObjData *unk_00;
    /* 0x04 */ MentDllUnkFunc unk_04;
    /* 0x08 */ s32 unk_08;
    /* 0x0C */ s32 unk_0C;
    /* 0x10 */ char pad_10[0x20];
    /* 0x30 */ s32 unk_30;
    /* 0x34 */ s32 unk_34;
    /* 0x38 */ char pad_38[0x20];
} MentDllUnkBss33ACStruct; /* size = 0x58 */

typedef struct MentDllUnkBss35BCStruct {
    /* 0x00 */ omObjData *unk_00;
    /* 0x04 */ MentDllUnkFunc unk_04;
    /* 0x08 */ s32 unk_08[5];
    /* 0x1C */ s32 unk_1C[5];
    /* 0x30 */ s32 unk_30;
    /* 0x34 */ s32 unk_34;
    /* 0x38 */ s32 unk_38;
    /* 0x3C */ s32 unk_3C;
    /* 0x40 */ s32 unk_40;
    /* 0x44 */ s32 unk_44[5];
} MentDllUnkBss35BCStruct; /* size = 0x58 */

void fn_1_116F4(void);
void fn_1_1184C(omObjData *arg0, MentDllUnkBss35BCStruct *arg1);
void fn_1_11908(omObjData *arg0, s32 arg1);
void fn_1_121D8(void);
void fn_1_127FC(omObjData *arg0, MentDllUnkBss33ACStruct *arg1);
void fn_1_12E40(void);
void fn_1_134A8(void);
void fn_1_13970(void);
void fn_1_13D60(void);
void fn_1_13DEC(void);
void fn_1_13EDC(void);
void fn_1_13F68(void);
void fn_1_14058(void);
void fn_1_14148(void);
void fn_1_14238(void);
void fn_1_14328(void);
void fn_1_14418(void);
void fn_1_146D0(void);
void fn_1_147C0(void);
void fn_1_148B0(void);
void fn_1_149A0(void);
void fn_1_14A2C(void);
void fn_1_14AB8(void);
void fn_1_14BA8(void);
void fn_1_14CE0(void);
void fn_1_15098(void);
void fn_1_151B8(MentDllUnkBss35BCStruct *arg0, s32 arg1, s32 arg2, s32 arg3);
void fn_1_15950(void);
void fn_1_15CB4(omObjData *arg0, MentDllUnkBss3114Struct *arg1);
s32 fn_1_1648C(MentDllUnkBss3114Struct *arg0);
