#include "ext_math.h"
#include "game/chrman.h"
#include "game/gamework.h"
#include "game/gamework_data.h"
#include "game/hsfdraw.h"
#include "game/hsfman.h"
#include "game/hsfmotion.h"
#include "game/objsub.h"
#include "game/pad.h"
#include "game/sprite.h"
#include "game/window.h"
#include "game/wipe.h"

#include "REL/ztardll.h"

typedef void (*ZtarUnkFunc)(omObjData *, ...);

typedef struct ZtarDllUnkStruct2 {
    /* 0x00 */ omObjData *unk_00;
    /* 0x04 */ ZtarUnkFunc unk_04;
    /* 0x08 */ s32 unk_08;
    /* 0x0C */ s32 unk_0C;
    /* 0x10 */ s32 unk_10;
    /* 0x14 */ s32 unk_14;
    /* 0x18 */ char pad_18[0x10]; /* maybe part of unk_14[5]? */
    /* 0x28 */ s32 unk_28;
    /* 0x2C */ s32 unk_2C;
    /* 0x30 */ s32 unk_30;
    /* 0x34 */ s32 unk_34;
    /* 0x38 */ char pad_38[0x10]; /* maybe part of unk_34[5]? */
    /* 0x48 */ s32 unk_48;
    /* 0x4C */ s32 unk_4C;
    /* 0x50 */ s32 unk_50;
    /* 0x54 */ s32 unk_54;
    /* 0x58 */ s32 unk_58;
    /* 0x5C */ s32 unk_5C;
} ZtarDllUnkStruct2; /* size = 0x60 */

void fn_1_106E8(s32 arg0);
void fn_1_10764(s32 arg0);
void fn_1_108C8(s32);
void fn_1_10A80(void);
void fn_1_10B24(void);
s32 fn_1_10C18(s32 arg0);
s32 fn_1_10C98(s32 arg0);
float fn_1_10D60(float arg8, float arg9, float argA, float argB);
float fn_1_10E38(float arg8, float arg9, float argA, float argB);
void fn_1_10FBC(s32 arg0);
void fn_1_11960(void);
void fn_1_11C64(void);
void fn_1_11F68(void);
void fn_1_122A8(s32 arg0);
void fn_1_A02C(void);
void fn_1_A248(void);
void fn_1_A574(void);
void fn_1_A610(void);
void fn_1_A8E8(void);
void fn_1_ABC4(void);
void fn_1_AE94(void);
void fn_1_AEE4(omObjData *object, ZtarDllUnkStruct2 *arg1);
void fn_1_B468(omObjData *object, ZtarDllUnkStruct2 *arg1);
void fn_1_BA40(void);
void fn_1_BD7C(s32 arg0);
void fn_1_BFF0(s32 arg0);
void fn_1_C06C(s32 arg0, s32 arg1);
void fn_1_C4B8(s32 arg0);
void fn_1_C8EC(s32 arg0);
void fn_1_CAF0(void);
