#include "REL/executor.h"
#include "game/audio.h"
#include "game/chrman.h"
#include "game/data.h"
#include "game/gamework_data.h"
#include "game/hsfanim.h"
#include "game/hsfman.h"
#include "game/hsfmotion.h"
#include "game/mapspace.h"
#include "game/minigame_seq.h"
#include "game/object.h"
#include "game/objsub.h"
#include "game/pad.h"
#include "game/process.h"
#include "game/sprite.h"
#include "game/window.h"
#include "game/wipe.h"

#include "dolphin.h"
#include "ext_math.h"

typedef struct {
    /* 0x00 */ s16 unk00;
    /* 0x02 */ s16 unk02[3];
    /* 0x08 */ char unk08[4];
    /* 0x0C */ s16 unk0C;
    /* 0x0E */ s16 unk0E;
    /* 0x10 */ s16 unk10;
    /* 0x12 */ char unk12[2];
    /* 0x14 */ s32 unk14;
    /* 0x18 */ s32 unk18;
    /* 0x1C */ s32 unk1C;
    /* 0x20 */ s32 unk20[2];
    /* 0x28 */ s32 unk28;
    /* 0x2C */ s32 unk2C;
    /* 0x30 */ s32 unk30;
    /* 0x34 */ s32 unk34;
    /* 0x38 */ s32 unk38;
    /* 0x3C */ s32 unk3C;
    /* 0x40 */ s32 unk40;
    /* 0x44 */ s32 unk44;
    /* 0x48 */ float unk48;
    /* 0x4C */ float unk4C;
    /* 0x50 */ float unk50[2];
    /* 0x58 */ float unk58[2];
} UnkM445Struct_00; // Size 0x60

typedef struct {
    /* 0x00 */ s16 unk00;
    /* 0x02 */ s16 unk02;
    /* 0x04 */ s16 unk04;
    /* 0x06 */ s16 unk06;
    /* 0x08 */ s16 unk08[16];
    /* 0x28 */ s16 unk28;
    /* 0x2A */ char unk2A[2];
    /* 0x2C */ s32 unk2C;
    /* 0x30 */ s32 unk30;
    /* 0x34 */ s32 unk34;
} UnkM445Struct_01; // Size 0x38

typedef struct {
    /* 0x00 */ s16 unk00;
    /* 0x02 */ s16 unk02;
    /* 0x04 */ s16 unk04;
    /* 0x06 */ s16 unk06;
    /* 0x08 */ s16 unk08[8];
    /* 0x18 */ s32 unk18;
    /* 0x1C */ s32 unk1C;
    /* 0x20 */ s32 unk20;
    /* 0x24 */ s32 unk24;
    /* 0x28 */ s32 unk28;
    /* 0x2C */ s32 unk2C;
    /* 0x30 */ s32 unk30;
    /* 0x34 */ float unk34;
    /* 0x38 */ float unk38;
    /* 0x3C */ float unk3C;
    /* 0x40 */ float unk40;
    /* 0x44 */ float unk44;
    /* 0x48 */ float unk48;
    /* 0x4C */ float unk4C;
    /* 0x50 */ float unk50;
    /* 0x54 */ float unk54;
    /* 0x58 */ float unk58;
    /* 0x5C */ float unk5C;
    /* 0x60 */ float unk60;
    /* 0x64 */ char unk64[0xC];
    /* 0x70 */ Vec unk70;
    /* 0x7C */ s8 unk7C;
    /* 0x7D */ s8 unk7D;
    /* 0x7E */ s8 unk7E;
    /* 0x7F */ s8 unk7F;
    /* 0x80 */ u16 unk80;
    /* 0x82 */ u16 unk82;
    /* 0x84 */ float unk84;
    /* 0x88 */ float unk88;
    /* 0x8C */ char unk8C[4];
    /* 0x90 */ s32 unk90;
    /* 0x94 */ char unk94[4];
    /* 0x98 */ s32 unk98;
} UnkM445Struct_02; // Size 0x9C

typedef struct {
    /* 0x00 */ char unk00[0x18];
    /* 0x18 */ float unk18;
    /* 0x1C */ char unk1C[4];
    /* 0x20 */ float unk20;
} UnkM445Struct_03; // Size unknown

typedef struct {
    /* 0x00 */ UnkM445Struct_03 *unk00;
    /* 0x04 */ s32 unk04;
    /* 0x08 */ s32 unk08;
    /* 0x0C */ s32 unk0C;
} UnkM445Struct_04; // Size unknown

void ObjectSetup(void);
void fn_1_4B8(float arg0, float arg1, s32 arg2);
void fn_1_50C(omObjData *arg0);
void fn_1_510(omObjData *arg0);
BOOL fn_1_520(s32 arg0);
void fn_1_550(void);
float fn_1_1858(float arg0);
UnkM445Struct_01 *fn_1_18D8(void);
void fn_1_1934(void);
void fn_1_1968(void);
s32 fn_1_1AD0(s32 arg0);
void fn_1_1B0C(void);
void fn_1_1C64(void);
s8 fn_1_2BF4(s32 arg0, s32 arg1);
void fn_1_2CAC(Vec *arg0, float arg1, float arg2);
s8 fn_1_2E68(s32 arg0, s32 arg1);
u8 fn_1_2F38(s32 arg0, s32 arg1);
u16 fn_1_3010(s32 arg0);
u16 fn_1_3094(s32 arg0);
s32 fn_1_3114(UnkM445Struct_02 *arg0, float arg1, float arg2, float arg3);
s32 fn_1_3334(UnkM445Struct_02 *arg0, s32 *arg1);
void fn_1_3548(UnkM445Struct_02 *arg0);
float fn_1_42A0(float arg0, float arg1, float arg2);
BOOL fn_1_43A4(UnkM445Struct_02 *arg0, float arg1, float arg2);
void fn_1_45D0(UnkM445Struct_02 *arg0);
void fn_1_557C(void);
void fn_1_55F0(void);
