#include "ext_math.h"
#include "game/esprite.h"
#include "game/gamework_data.h"
#include "game/hsfdraw.h"
#include "game/hsfex.h"
#include "game/hsfman.h"
#include "game/wipe.h"
#include "game/window.h"

#include "REL/present.h"

#define NUM_CHARACTERS 8

#define PRESENT_MDL_MAX 134
#define PRESENT_MAX 60

#define PRESENT_COUNT_CHAR_ROOM 6
#define PRESENT_COUNT_MG_ROOM 11

#define PRESENT_CONSTELLATION 5

#define ROOM_MARIO 0
#define ROOM_LUIGI 1
#define ROOM_PEACH 2
#define ROOM_YOSHI 3
#define ROOM_WARIO 4
#define ROOM_TROPHY 5
#define ROOM_DK 6
#define ROOM_DAISY 7
#define ROOM_WALUIGI 8
#define ROOM_MG 9
#define ROOM_MAX 9

#define ROOM_CHANGE_LEFT 1
#define ROOM_CHANGE_RIGHT 2

typedef struct PresentWork {
    /* 0x00 */ BOOL cursorVisibleF;
    /* 0x04 */ BOOL roomNotEmptyF;
    /* 0x08 */ BOOL constellationSelF;
    /* 0x0C */ s32 execMode;
    /* 0x10 */ omObjData *object[PRESENT_MDL_MAX];
    /* 0x228 */ PresentWindow *presentDescWindow;
    /* 0x22C */ PresentWindow *btnLegendWindow;
    /* 0x230 */ s16 cursor;
    /* 0x234 */ s32 room;
    /* 0x238 */ s32 idxInRoom;
    /* 0x23C */ float rot;
    /* 0x240 */ float rotPrev;
    /* 0x244 */ float rotTarget;
    /* 0x248 */ float timeRot;
    /* 0x24C */ float presentFallingTime;
    /* 0x250 */ float rotSpeed;
    /* 0x254 */ float presentFallingSpeed;
    /* 0x258 */ float cursorTime;
    /* 0x25C */ float cursorSpeed;
    /* 0x260 */ Vec2f cursorPos;
    /* 0x268 */ Vec2f newCursorPos;
    /* 0x270 */ BOOL presentUnlockedF[PRESENT_MAX];
    /* 0x360 */ char unk360[4];
} PresentWork; /* size = 0x364 */

typedef struct UnkLightDataStruct {
    /* 0x00 */ Vec src;
    /* 0x0C */ Vec dest;
    /* 0x18 */ GXColor color;
} UnkLightDataStruct; /* size = 0x1C */ // same as option::state::UnkLightDataStruct

typedef struct PresentData {
    /* 0x00 */ s32 cursorPosIdx;
    /* 0x04 */ s32 unk04;
    /* 0x08 */ s32 nameMess;
    /* 0x0C */ s32 descMess;
} PresentData; /* size = 0x10 */

typedef struct RoomData {
    /* 0x00 */ s32 presentCount;
    /* 0x04 */ PresentData presentData[11];
} RoomData; /* size = 0xB4 */

typedef struct PresentDistanceStruct {
    /* 0x00 */ s32 present;
    /* 0x04 */ float distance;
} PresentDistanceStruct; /* size = 0x08 */

static void ExecSelectRoom(omObjData *object);
static void ChangeRoom(omObjData *object, s32 direction);
static void ExecSelectPresent(omObjData *object);
static void GetCursorPos(omObjData *object, float *x, float *y, float *z);
static void SetCameraRot(omObjData *object, float rot, s32 duration);
static void RotateCamera(omObjData *object);
static BOOL CameraRotationDoneCheck(omObjData *object);
static void ShowHidePresents(omObjData *object);
static BOOL PresentUnlocked(omObjData *object, s32 room, s32 present);
static s32 UnlockedPresents(omObjData *object, s32 room);
static s32 MoveCursor(omObjData *object, s32 arg1);
static s32 TotalPresentsInRoom(s32 room);
static void ExecPresentGet(omObjData *object);
static s32 fn_1_393C(s32 arg0, s32 arg1);

static UnkLightDataStruct lightTbl = {
    { 0.0f, 400.0f, 0.0f },
    { 0.0f, -400.0f, -500.0f },
    { 255, 255, 255, 255 },
};
