#include "game/audio.h"
#include "game/chrman.h"
#include "game/data.h"
#include "game/esprite.h"
#include "game/gamework_data.h"
#include "game/hsfdraw.h"
#include "game/hsfman.h"
#include "game/hsfmotion.h"
#include "game/memory.h"
#include "game/minigame_seq.h"
#include "game/object.h"
#include "game/pad.h"
#include "game/process.h"
#include "game/sprite.h"
#include "game/wipe.h"

#include "dolphin.h"
#include "ext_math.h"

#define frand7() (frand() & 0x7F)

extern u32 GlobalCounter;

typedef struct {
    /* 0x00 */ s32 unk00;
    /* 0x04 */ s32 unk04;
    /* 0x08 */ s32 unk08;
    /* 0x0C */ s32 unk0C;
    /* 0x10 */ void *unk10;
} StructBssD0Data; // Size 0x14

typedef struct {
    /* 0x00 */ Vec unk00;
    /* 0x0C */ Vec unk0C;
    /* 0x18 */ float unk18;
} StructData0; // Size 0x1C

typedef struct {
    /* 0x00 */ StructBssD0Data *unk00;
    /* 0x04 */ AnimData *unk04;
} StructM423_00; // Size 8

typedef struct {
    /* 0x00 */ s16 unk00;
    /* 0x02 */ s16 unk02;
    /* 0x04 */ s16 unk04;
    /* 0x06 */ s16 unk06;
    /* 0x08 */ Vec unk08;
} StructM423_01; // Size 0x14

typedef struct {
    /* 0x00 */ s16 unk00;
    /* 0x02 */ s16 unk02;
    /* 0x04 */ s16 unk04;
    /* 0x06 */ char unk06[2];
    /* 0x08 */ Vec unk08;
    /* 0x14 */ Vec *unk14;
    /* 0x18 */ Vec *unk18;
    /* 0x1C */ GXColor *unk1C;
    /* 0x20 */ StructM423_01 *unk20;
    /* 0x24 */ float unk24[4];
    /* 0x34 */ u32 unk34;
    /* 0x38 */ void *unk38;
} StructM423_02; // Size 0x3C

typedef struct {
    /* 0x00 */ s16 unk00;
    /* 0x02 */ s16 unk02;
    /* 0x04 */ StructM423_02 *unk04;
} StructM423_03; // Size 8

typedef struct {
    /* 0x00 */ s16 unk00;
    /* 0x02 */ s16 unk02;
    /* 0x04 */ Vec unk04;
    /* 0x10 */ char unk10[8];
    /* 0x18 */ float unk18;
    /* 0x1C */ char unk1C[0xC];
    /* 0x28 */ float unk28;
    /* 0x2C */ float unk2C;
    /* 0x30 */ float unk30;
    /* 0x34 */ float unk34;
    /* 0x38 */ Vec unk38;
    /* 0x44 */ GXColor unk44;
    /* 0x48 */ s32 unk48;
} StructM423_04; // Size 0x4C

typedef struct struct_m423_05 {
    /* 0x00 */ s16 unk00;
    /* 0x02 */ s16 unk02;
    /* 0x00 */ char unk04[0x1C];
    /* 0x20 */ u8 unk20;
    /* 0x21 */ u8 unk21;
    /* 0x22 */ u8 unk22;
    /* 0x23 */ s8 unk23;
    /* 0x24 */ char unk24[2];
    /* 0x26 */ s16 unk26;
    /* 0x28 */ s32 unk28;
    /* 0x2C */ s32 unk2C;
    /* 0x30 */ u32 unk30;
    /* 0x34 */ s32 unk34;
    /* 0x38 */ AnimData *unk38;
    /* 0x3C */ StructM423_04 *unk3C;
    /* 0x40 */ Vec *unk40;
    /* 0x44 */ float (*unk44)[2];
    /* 0x48 */ void *unk48;
    /* 0x4C */ void *unk4C;
    /* 0x50 */ ModelData *unk50;
} StructM423_05; // Size 0x54

typedef struct {
    /* 0x00 */ float unk00;
    /* 0x04 */ float unk04;
    /* 0x08 */ char unk08[4];
    /* 0x0C */ float unk0C;
    /* 0x10 */ float unk10;
    /* 0x14 */ char unk14[4];
    /* 0x18 */ float unk18;
    /* 0x1C */ float unk1C;
    /* 0x20 */ char unk20[4];
    /* 0x24 */ float unk24;
    /* 0x28 */ float unk28;
    /* 0x2C */ char unk2C[4];
    /* 0x30 */ float unk30;
    /* 0x34 */ float unk34;
    /* 0x38 */ char unk38[4];
} StructM423_08; // Size 0x3C

typedef struct {
    /* 0x00 */ float unk00;
    /* 0x04 */ float unk04;
    /* 0x08 */ float unk08;
    /* 0x0C */ float unk0C;
    /* 0x10 */ float unk10;
    /* 0x14 */ float unk14;
    /* 0x18 */ float unk18;
    /* 0x1C */ float unk1C;
    /* 0x20 */ float unk20;
    /* 0x24 */ float unk24;
} StructM423_09; // Size 0x28

typedef struct {
    /* 0x000 */ u16 unk00;
    /* 0x002 */ u16 unk02;
    /* 0x004 */ float unk04;
    /* 0x008 */ float unk08;
    /* 0x00C */ float unk0C;
    /* 0x010 */ float unk10;
    /* 0x014 */ Vec unk14;
} StructM423_0A; // Size 0x20

typedef struct {
    /* 0x000 */ StructM423_0A unk00[16];
    /* 0x200 */ AnimData *unk200;
    /* 0x204 */ s32 unk204;
    /* 0x208 */ void *unk208;
    /* 0x20C */ StructM423_08 *unk20C;
    /* 0x210 */ StructM423_09 *unk210;
    /* 0x214 */ GXColor *unk214;
    /* 0x218 */ s32 unk218;
    /* 0x21C */ s32 unk21C;
    /* 0x220 */ void *unk220;
} StructM423_0B; // Size 0x224

typedef struct {
    /* 0x000 */ s32 unk00;
    /* 0x004 */ s32 unk04;
    /* 0x008 */ s32 unk08;
    /* 0x00C */ s32 unk0C;
    /* 0x010 */ s32 unk10[24];
    /* 0x070 */ s32 unk70[24][3];
    /* 0x190 */ s16 unk190[10][2];
} StructM423_0C; // Size 0x1B8

typedef struct {
    /* 0x00 */ s16 unk00;
    /* 0x02 */ s16 unk02;
    /* 0x04 */ s16 unk04;
    /* 0x06 */ s16 unk06;
    /* 0x08 */ s16 unk08;
    /* 0x0A */ s16 unk0A;
    /* 0x0C */ s16 unk0C;
    /* 0x0E */ s16 unk0E;
    /* 0x10 */ s16 unk10;
    /* 0x12 */ s16 unk12;
    /* 0x14 */ s32 unk14;
    /* 0x18 */ s32 unk18;
    /* 0x1C */ s32 unk1C;
    /* 0x20 */ Vec unk20;
    /* 0x2C */ Vec unk2C;
    /* 0x38 */ Vec unk38;
    /* 0x44 */ float unk44;
    /* 0x48 */ float unk48;
    /* 0x4C */ float unk4C;
    /* 0x50 */ Vec unk50;
    /* 0x5C */ Vec unk5C;
    /* 0x68 */ Vec unk68;
    /* 0x74 */ Vec unk74;
    /* 0x80 */ Vec unk80;
    /* 0x8C */ float unk8C;
    /* 0x90 */ float unk90;
} StructBssA8Data; // Size 0x94

typedef struct {
    /* 0x00 */ s16 unk00;
    /* 0x02 */ s16 unk02;
    /* 0x04 */ s16 unk04;
    /* 0x06 */ s16 unk06;
    /* 0x08 */ s16 unk08;
    /* 0x0A */ s16 unk0A;
} StructBssCCData; // Size 0xC

typedef struct {
    /* 0x00 */ s16 unk00;
    /* 0x02 */ s16 unk02;
    /* 0x04 */ s16 unk04;
    /* 0x06 */ s16 unk06;
    /* 0x08 */ s16 unk08;
    /* 0x0A */ s16 unk0A;
    /* 0x0C */ s16 unk0C;
    /* 0x0E */ s16 unk0E;
    /* 0x10 */ s16 unk10;
    /* 0x12 */ s16 unk12;
    /* 0x14 */ s16 unk14;
    /* 0x16 */ s16 unk16;
    /* 0x18 */ s16 unk18;
    /* 0x1A */ char unk1A[2];
    /* 0x1C */ float unk1C[15];
    /* 0x58 */ s32 unk58;
    /* 0x5C */ s32 unk5C;
    /* 0x60 */ float unk60;
    /* 0x64 */ s32 unk64;
    /* 0x68 */ s32 unk68;
    /* 0x6C */ s32 unk6C;
    /* 0x70 */ s32 unk70;
    /* 0x74 */ s32 unk74;
    /* 0x78 */ float unk78;
    /* 0x7C */ float unk7C;
    /* 0x80 */ s32 unk80;
    /* 0x84 */ s32 unk84;
    /* 0x88 */ float unk88;
    /* 0x8C */ float unk8C;
    /* 0x90 */ s32 unk90;
    /* 0x94 */ s32 unk94;
    /* 0x98 */ s32 unk98;
    /* 0x9C */ s32 unk9C;
    /* 0xA0 */ s32 unkA0;
    /* 0xA4 */ s32 unkA4;
    /* 0xA8 */ float unkA8;
    /* 0xAC */ s32 unkAC;
    /* 0xB0 */ float unkB0;
    /* 0xB4 */ float unkB4;
    /* 0xB8 */ float unkB8;
    /* 0xBC */ float unkBC;
    /* 0xC0 */ float unkC0;
    /* 0xC4 */ float unkC4;
    /* 0xC8 */ Vec unkC8;
    /* 0xD4 */ Vec unkD4;
    /* 0xE0 */ float unkE0;
    /* 0xE4 */ float unkE4;
    /* 0xE8 */ float unkE8;
    /* 0xEC */ float unkEC;
    /* 0xF0 */ float unkF0;
    /* 0xF4 */ float unkF4;
} StructBssBCData; // Size 0xF8

typedef struct {
    /* 0x000 */ s16 unk00;
    /* 0x002 */ s16 unk02;
    /* 0x004 */ Vec unk04;
    /* 0x010 */ Vec unk10;
    /* 0x004 */ char unk1C[0xC];
    /* 0x028 */ float unk28;
    /* 0x02C */ float unk2C;
    /* 0x030 */ float unk30;
    /* 0x034 */ float unk34;
    /* 0x038 */ char unk38[4];
    /* 0x03C */ float unk3C;
    /* 0x040 */ s32 unk40;
    /* 0x044 */ float unk44[12][4];
    /* 0x104 */ Vec unk104[12][3];
} StructBss94Data; // Size 0x2B4

typedef struct {
    /* 0x00 */ s32 unk00;
    /* 0x04 */ s32 unk04;
    /* 0x08 */ AnimData *unk08;
} StructBssA4Data; // Size 0xC

void fn_1_318(omObjData *arg0);
void fn_1_3B0(omObjData *arg0);
void fn_1_DFC(omObjData *arg0);
void fn_1_E60(omObjData *arg0);
void fn_1_F10(void);
void fn_1_F60(omObjData *arg0);
void fn_1_11A4(omObjData *arg0);
void fn_1_1238(void);
void fn_1_12A0(ModelData *arg0, Mtx arg1);
s32 fn_1_13A0(StructBssD0Data *arg0);
void fn_1_1444(s32 arg0);
void fn_1_14A0(ModelData *arg0, Mtx arg1);
s32 fn_1_18FC(void);
void fn_1_1B5C(ModelData *arg0, StructM423_02 *arg1);
void fn_1_1F5C(ModelData *arg0, StructM423_02 *arg1);
void fn_1_2290(ModelData *arg0, StructM423_02 *arg1);
void fn_1_2624(ModelData *arg0, StructM423_02 *arg1);
void fn_1_29B8(s32 arg0);
void fn_1_29BC(ModelData *arg0, Mtx arg1);
void fn_1_2C08(s32 arg0);
void fn_1_34D8(void);
void fn_1_3528(omObjData *arg0);
void fn_1_3898(omObjData *arg0);
void fn_1_3A64(void);
void fn_1_3A8C(void);
void fn_1_3BFC(void);
void fn_1_3FE0(omObjData *arg0);
