#include "ext_math.h"
#include "game/audio.h"
#include "game/chrman.h"
#include "game/flag.h"
#include "game/frand.h"
#include "game/gamework.h"
#include "game/hsfanim.h"
#include "game/hsfman.h"
#include "game/memory.h"
#include "game/minigame_seq.h"
#include "game/objsub.h"
#include "game/pad.h"
#include "game/sprite.h"
#include "game/wipe.h"

#include "string.h"

#include "REL/m453Dll.h"

typedef struct M453DllWork {
    /* 0x00 */ u8 unk_00;
    /* 0x04 */ Vec unk_04;
    /* 0x10 */ Vec unk_10;
    /* 0x1C */ Vec unk_1C;
    /* 0x28 */ Vec unk_28;
    /* 0x34 */ Vec unk_34;
    /* 0x40 */ Vec unk_40;
    /* 0x4C */ Vec unk_4C;
    /* 0x58 */ Vec unk_58;
    /* 0x64 */ Vec unk_64[3];
    /* 0x88 */ Vec unk_88[3];
    /* 0xAC */ Vec unk_AC[3];
    /* 0xD0 */ Vec unk_D0[3];
    /* 0xF4 */ float unk_F4[3];
    /* 0x100 */ float unk_100[3];
    /* 0x10C */ float unk_10C[3];
    /* 0x118 */ float unk_118[3];
    /* 0x124 */ float unk_124[3];
    /* 0x130 */ float unk_130;
    /* 0x134 */ float unk_134;
    /* 0x138 */ float unk_138;
    /* 0x13C */ float unk_13C;
    /* 0x140 */ float unk_140;
    /* 0x144 */ float unk_144;
    /* 0x148 */ float unk_148;
} M453DllWork; /* size 0x14C */

typedef struct M453DllUnkStruct {
    s16 unk_00;
    s16 unk_02;
    float unk_04;
    float unk_08;
    char unk0C[0x34];
} M453DllUnkStruct; /* 0x40 */

typedef struct M453DllWork2 {
    u8 unk_00;
    u8 unk_01;
    u8 unk_02;
    u8 unk_03;
    u8 unk_04;
    u8 unk_05;
    u8 unk_06;
    u8 unk_07;
    char unk08[2];
    u8 unk_0A;
    char unk0B;
    u8 unk_0C;
    u8 unk_0D;
    u8 unk_0E;
    s16 unk_10;
    s16 unk_12;
    s16 unk_14;
    s16 unk_16;
    s16 unk_18;
    s16 unk_1A;
    float unk_1C;
    float unk_20;
    float unk_24;
    float unk_28;
    Vec unk_2C;
    Vec unk_38;
    float unk_44;
    float unk_48;
    float unk_4C;
    Vec unk_50;
    M453DllUnkStruct unk_5C;
    u8 unk_9C;
    s32 unk_A0;
} M453DllWork2; /* size 0xA4 */ // same as Unkm403Struct_01

void fn_1_440(omObjData *object);
void fn_1_460(omObjData *object);
void fn_1_848(omObjData *object);
void fn_1_FFC(omObjData *object);
