#define HUSPR_USE_OLD_DEFS
#include "dolphin/gx/GXEnum.h"
#include "dolphin/gx/GXStruct.h"
#include "dolphin/gx/GXVert.h"
#include "ext_math.h"
#include "game/audio.h"
#include "game/chrman.h"
#include "game/esprite.h"
#include "game/flag.h"
#include "game/frand.h"
#include "game/gamework_data.h"
#include "game/hsfanim.h"
#include "game/hsfdraw.h"
#include "game/hsfman.h"
#include "game/hsfmotion.h"
#include "game/memory.h"
#include "game/minigame_seq.h"
#include "game/object.h"
#include "game/objsub.h"
#include "game/pad.h"
#include "game/printfunc.h"
#include "game/sprite.h"
#include "game/window.h"
#include "game/wipe.h"
#include "math.h"
#include "string.h"

#include "REL/m425Dll.h"

extern u8 texMtxTbl[]; // TODO maybe put in hsfdraw.h?

typedef struct M425DllWork {
    u8 unk_00;
    u8 unk_01;
    u8 unk_02;
    u8 unk_03;
    u8 unk_04;
    u8 unk_05;
    u8 unk_06;
    char unk07[2];
    u8 unk_09;
    u8 unk_0A;
    u8 unk_0B;
    u8 unk_0C;
    char unk0D;
    s16 unk_0E;
    float unk_10;
    float unk_14;
    Vec unk_18;
    Vec unk_24;
    Vec unk_30;
    float unk_3C[8];
    s32 unk_5C;
    float unk_60;
    s32 unk_64;
    s32 unk_68;
} M425DllWork; /* size = 0x6C */

typedef struct M425DllWork2 {
    char unk00[4];
    Vec unk_04;
    Vec unk_10;
    Vec unk_1C;
    Vec unk_28;
    float unk_34;
    float unk_38;
    float unk_3C;
    float unk_40;
    float unk_44;
    float unk_48;
    char unk4C[0x18];
    float unk_64;
    float unk_68;
    float unk_6C;
    char unk70[4];
    s16 unk_74;
    s16 unk_76;
} M425DllWork2; /* size = 0x78 */

typedef struct M425DllUnkStruct {
    s16 unk_00;
    s16 unk_02;
    s16 unk_04;
    char unk06[0x42];
} M425DllUnkStruct; /* size = 0x48 */

typedef struct M425DllUnkStruct2 {
    AnimData *unk_00;
    s16 unk_04;
    Vec unk_08;
    Mtx unk_14;
    Vec2f *unk_44;
    s16 unk_48;
} M425DllUnkStruct2; /* size = 0x4C */

typedef struct M425DllUnkStruct3 {
    char unk00[0xC];
    s16 unk_0C;
    void *unk_10;
    Vec *unk_14;
    GXColor *unk_18;
    Vec *unk_1C;
    GXColor unk_20;
    GXColor unk_24;
    s16 unk_28;
    s16 unk_2A;
    M425DllUnkStruct2 *unk_2C;
} M425DllUnkStruct3; /* size = 0x30 */

typedef struct M425DllUnkBss10Struct {
    /* 0x00 */ u8 unk_00;
    /* 0x01 */ char pad_01[1];
    /* 0x02 */ u8 unk_02;
    /* 0x03 */ u8 unk_03;
    /* 0x04 */ float unk_04;
    /* 0x08 */ Vec unk_08;
    /* 0x14 */ float unk_14;
    /* 0x18 */ float unk_18;
    /* 0x1C */ float unk_1C;
    /* 0x20 */ float unk_20;
    /* 0x24 */ float unk_24;
    /* 0x28 */ float unk_28;
    /* 0x2C */ float unk_2C;
    /* 0x30 */ float unk_30;
    /* 0x34 */ float unk_34;
    /* 0x38 */ float unk_38;
    /* 0x3C */ float unk_3C;
    /* 0x40 */ float unk_40;
    union {
        /* 0x44 */ s16 unk_44[0x20];
        struct {
            float unk_44f;
            float unk_48;
            char unk4C[4];
            float unk_50;
            char unk54[0x30];
        };
    };
} M425DllUnkBss10Struct; /* size = 0x84 */

void fn_1_1B40(omObjData *object);
void fn_1_2784(omObjData *object);
void fn_1_2870(omObjData *object);
void fn_1_2A94(s16 arg0, Vec *arg1, Vec *arg2, float arg8);
void fn_1_2B2C(omObjData *object);
void fn_1_2E78(omObjData *object);
void fn_1_33E0(omObjData *object);
void fn_1_3764(omObjData *object);
s16 fn_1_3ED0(s32 arg0, s16 arg1, ParticleHook arg2);
void fn_1_3F80(ModelData *model, ParticleData *particle, Mtx matrix);
void fn_1_460(omObjData *object);
void fn_1_480(omObjData *object);
void fn_1_4A88(ModelData *model, ParticleData *particle, Mtx matrix);
void fn_1_5044(s16 arg0);
void fn_1_573C(Vec2f **arg0, s16 arg1, Vec2f *arg2);
void fn_1_57D4(ModelData *model, Mtx matrix);
void fn_1_5C20(ModelData *model, Mtx matrix);
