#include "dolphin/gx/GXEnum.h"
#include "dolphin/gx/GXVert.h"
#include "dolphin/pad.h"
#include "ext_math.h"
#include "game/audio.h"
#include "game/chrman.h"
#include "game/esprite.h"
#include "game/flag.h"
#include "game/frand.h"
#include "game/gamework_data.h"
#include "game/hsfdraw.h"
#include "game/hsfman.h"
#include "game/hsfmotion.h"
#include "game/memory.h"
#include "game/minigame_seq.h"
#include "game/object.h"
#include "game/objsub.h"
#include "game/pad.h"
#include "game/printfunc.h"
#include "game/sprite.h"
#include "game/window.h"
#include "game/wipe.h"
#include "string.h"

#ifndef __MWERKS__
#include "game/hsfex.h"
#endif

s32 rand8(void);

typedef struct UnkCameraStruct {
    /* 0x00 */ float unk_00;
    /* 0x04 */ float unk_04;
    /* 0x08 */ float unk_08;
    /* 0x0C */ float unk_0C;
    /* 0x10 */ float unk_10;
    /* 0x14 */ float unk_14;
} UnkCameraStruct; /* size = 0x18 */

typedef struct M449DllUnkStruct {
    /* 0x00 */ s32 unk_00[4];
    /* 0x10 */ s32 unk_10[4];
} M449DllUnkStruct; /* size = 0x20 */

typedef struct M449DllWork {
    s32 unk_00;
    s32 unk_04;
    s32 unk_08;
    s32 unk_0C;
    s32 unk_10;
    s32 unk_14;
    s32 unk_18;
    s32 unk_1C;
    float unk_20;
    float unk_24;
    float unk_28;
    float unk_2C;
    s32 unk_30;
    s32 unk_34;
    s32 unk_38;
    float unk_3C;
    float unk_40;
    s32 unk_44;
    s32 unk_48;
    s32 unk_4C;
    s32 unk_50;
    s32 unk_54;
    float unk_58;
    float unk_5C;
    float unk_60[4];
    float unk_70[4];
    float unk_80[4];
    float unk_90[4];
    float unk_A0[4];
    float unk_B0[4];
    float unk_C0[4];
    float unk_D0[4];
    float unk_E0[4];
    s32 unk_F0[4];
    s32 unk_100[4];
    s32 unk_110[4];
    s32 unk_120[4];
    s32 unk_130[4];
    s32 unk_140[4];
    s32 unk_150[4];
    float unk_160[4];
    float unk_170[4];
    s32 unk_180[4];
    s32 unk_190;
    float unk_194[4];
    float unk_1A4[4];
    s32 unk_1B4[4];
    s32 unk_1C4[4];
    char unk1D4[0x30];
    s32 unk_204;
    s32 unk_208;
    s32 unk_20C;
    s32 unk_210;
    s32 unk_214;
} M449DllWork; /* size = 0x218 */

typedef struct UnkBss64Struct {
    /* 0x00 */ s32 unk_00;
    /* 0x04 */ float unk_04[2];
} UnkBss64Struct; /* size = 0x0C */

void fn_1_9A38(omObjData *arg0);

s32 lbl_1_data_0[0x12] = {
    0x50001A,
    0x500019,
    0x500016,
    0x500016,
    0x500016,
    0x500017,
    0x500017,
    0x500017,
    0x610000,
    0x50001A,
    0x500019,
    0x500016,
    0x500016,
    0x500016,
    0x500017,
    0x500017,
    0x500017,
    0x610000,
};
s32 lbl_1_data_48[0x12] = { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 };
s32 lbl_1_data_90[4] = { 0x5F0000, 0x500000, 0x5F0017, 0x5F0085 };
s32 lbl_1_data_A0[4] = { 0x50001C, 0x50001E, 0x50001D, 0x50001F };
u8 lbl_1_data_B0[0x38] = { 0x00, 0x01, 0x00, 0x00, 0x00, 0x01, 0x01, 0x01, 0x00, 0x00, 0x00, 0x08, 0x00, 0x00, 0x00, 0x08, 0x00, 0x00, 0x00, 0x08,
    0x00, 0x00, 0x00, 0x08, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x08,
    0x00, 0x00, 0x00, 0x08, 0x00, 0x00, 0x00, 0x08, 0x00, 0x00, 0x00, 0x08

};
