#include "REL/executor.h"
#include "game/audio.h"
#include "game/chrman.h"
#include "game/data.h"
#include "game/esprite.h"
#include "game/flag.h"
#include "game/gamework_data.h"
#include "game/hsfanim.h"
#include "game/hsfman.h"
#include "game/hsfmotion.h"
#include "game/memory.h"
#include "game/minigame_seq.h"
#include "game/object.h"
#include "game/objsub.h"
#include "game/pad.h"
#include "game/process.h"
#include "game/sprite.h"
#include "game/window.h"
#include "game/wipe.h"

#include "dolphin.h"
#include "ext_math.h"
#include "version.h"

typedef struct {
    /* 0x00 */ s32 unk00;
    /* 0x04 */ s32 unk04;
    /* 0x08 */ s32 unk08;
    /* 0x0C */ s32 unk0C;
    /* 0x10 */ s32 unk10;
    /* 0x14 */ char unk14[4];
    /* 0x18 */ s32 unk18;
    /* 0x1C */ s32 unk1C;
    /* 0x20 */ s32 unk20;
    /* 0x24 */ s32 unk24;
    /* 0x28 */ s32 unk28;
    /* 0x2C */ s32 unk2C;
    /* 0x30 */ s32 unk30;
    /* 0x34 */ s32 unk34;
    /* 0x38 */ s32 unk38;
    /* 0x3C */ float unk3C;
    /* 0x40 */ float unk40;
    /* 0x44 */ float unk44;
    /* 0x48 */ float unk48;
} UnkM448Struct_00; // Size 0x4C

typedef struct {
    /* 0x00 */ s32 unk00;
    /* 0x04 */ s32 unk04;
    /* 0x08 */ s32 unk08;
    /* 0x0C */ s32 unk0C;
    /* 0x10 */ float unk10;
    /* 0x14 */ char unk14[4];
    /* 0x18 */ s32 unk18;
    /* 0x1C */ s32 unk1C;
    /* 0x20 */ s32 unk20;
} UnkM448Struct_01; // Size 0x24

typedef struct {
    /* 0x00 */ s32 unk00;
    /* 0x04 */ float unk04[3];
} UnkM448Struct_02; // Size 0x10

void fn_1_A0(void);
void fn_1_38C(void);
void fn_1_478(void);
void fn_1_4FC(ModelData *model, Mtx matrix);
void fn_1_1338(omObjData *arg0);
void fn_1_4310(omObjData *arg0);
void fn_1_6DAC(void);
void fn_1_7148(omObjData *arg0);
void fn_1_7DC4(ModelData *model, ParticleData *particle, Mtx matrix);
void fn_1_81C0(omObjData *arg0);
void fn_1_8DD0(omObjData *arg0);
void fn_1_9508(omObjData *arg0);
void ObjectSetup(void);
void fn_1_9B00(omObjData *arg0);

UnkM448Struct_01 lbl_1_bss_16C[20];
UnkM448Struct_02 lbl_1_bss_9C[13];
omObjData *lbl_1_bss_98;
omObjData *lbl_1_bss_94;
omObjData *lbl_1_bss_8C[2];
omObjData *lbl_1_bss_88;
s32 lbl_1_bss_84;
s32 lbl_1_bss_80;
s32 lbl_1_bss_7C;
s32 lbl_1_bss_78;
s32 lbl_1_bss_74;
Process *lbl_1_bss_70;
s32 lbl_1_bss_6C;
s32 lbl_1_bss_68;
s32 lbl_1_bss_64;
s32 lbl_1_bss_60;
GXTexObj lbl_1_bss_40;
char lbl_1_bss_3C_pad[4];
float lbl_1_bss_38;
s32 lbl_1_bss_34;
char lbl_1_bss_30_pad[4];
