#include "REL/m436Dll.h"
#include "game/chrman.h"
#include "game/data.h"
#include "game/gamework_data.h"
#include "game/hsfdraw.h"
#include "game/hsfman.h"
#include "game/hsfmotion.h"
#include "game/minigame_seq.h"
#include "game/objsub.h"
#include "game/pad.h"
#include "game/printfunc.h"
#include "game/process.h"
#include "game/window.h"
#include "game/wipe.h"

#include "ext_math.h"

typedef struct {
    /* 0x00 */ omObjData *unk00;
    /* 0x04 */ s32 unk04;
    /* 0x08 */ s32 unk08;
    /* 0x0C */ s32 unk0C;
    /* 0x10 */ s32 unk10;
    /* 0x14 */ s32 unk14;
    /* 0x18 */ s32 unk18;
    /* 0x1C */ s32 unk1C;
    /* 0x20 */ s32 unk20;
    /* 0x24 */ s32 unk24;
    /* 0x28 */ s32 unk28;
    /* 0x2C */ float unk2C;
} StructBss3E4; // Size 0x30

typedef struct {
    /* 0x00 */ s32 unk00;
    /* 0x04 */ s32 unk04;
    /* 0x08 */ s32 unk08;
    /* 0x0C */ s32 unk0C;
} StructBss4A4; // Size 0x10

typedef struct {
    /* 0x00 */ s32 unk00;
    /* 0x04 */ float unk04;
    /* 0x08 */ s32 unk08[15];
    /* 0x44 */ s32 unk44[15];
    /* 0x80 */ float unk80[15][2];
} StructBss234; // Size 0xF8

typedef struct {
    /* 0x00 */ omObjData *unk00;
    /* 0x04 */ s32 unk04;
    /* 0x08 */ char unk08[0xC];
} StructBss220; // Size 0x14

typedef struct {
    /* 0x00 */ omObjData *unk00;
    /* 0x04 */ Vec unk04[8];
} StructBss1BC; // Size 0x64

typedef struct {
    /* 0x00 */ omObjData *unk00;
    /* 0x04 */ s32 unk04;
    /* 0x08 */ float unk08[6];
    /* 0x20 */ char unk20[8];
    /* 0x28 */ float unk28[6];
    /* 0x40 */ char unk40[8];
    /* 0x48 */ float unk48[6];
    /* 0x60 */ char unk60[8];
    /* 0x68 */ float unk68[6];
    /* 0x80 */ char unk80[8];
    /* 0x88 */ float unk88[6];
    /* 0xA0 */ char unkA0[8];
} StructBssD8; // Size 0xA8

typedef struct {
    /* 0x00 */ omObjData *unk00;
    /* 0x04 */ char unk04[0x10];
} StructBss1A8; // Size 0x14

typedef struct {
    /* 0x00 */ omObjData *unk00;
    /* 0x04 */ char unk04[0x10];
} StructBss180; // Size 0x14

typedef struct {
    /* 0x00 */ char unk00[0x28];
    /* 0x28 */ s32 unk28;
    /* 0x2C */ char unk2C[0xC];
} StructBss3AC; // Size 0x38

s32 fn_1_538C(s32 arg0);

StructBss4A4 lbl_1_bss_4A4;
StructBss3E4 lbl_1_bss_3E4[4];
StructBss3AC lbl_1_bss_3AC;
s32 lbl_1_bss_3A4[2];
StructBss32C lbl_1_bss_32C;
StructBss234 lbl_1_bss_234;
StructBss220 lbl_1_bss_220;
StructBss1BC lbl_1_bss_1BC;
StructBss1A8 lbl_1_bss_1A8;
StructBss180 lbl_1_bss_180[2];
StructBssD8 lbl_1_bss_D8;
StructBssC0 lbl_1_bss_C0;
StructBssC0 lbl_1_bss_A8;
Mtx lbl_1_bss_78;
Mtx lbl_1_bss_48;
Vec lbl_1_bss_3C;
StructBssC0 lbl_1_bss_24;
s32 lbl_1_bss_20_pad; // unused
s32 lbl_1_bss_1C;
s32 lbl_1_bss_18;
s32 lbl_1_bss_14;
s32 lbl_1_bss_10;
s32 lbl_1_bss_C;
s32 lbl_1_bss_8;
s32 lbl_1_bss_4;
Process *lbl_1_bss_0;

s32 lbl_1_data_0[]
    = { DATA_MAKE_NUM(DATADIR_M436, 13), DATA_MAKE_NUM(DATADIR_M436, 14), DATA_MAKE_NUM(DATADIR_M436, 15), DATA_MAKE_NUM(DATADIR_M436, 16),
