#include "REL/executor.h"
#include "game/audio.h"
#include "game/chrman.h"
#include "game/data.h"
#include "game/frand.h"
#include "game/gamework_data.h"
#include "game/hsfanim.h"
#include "game/hsfman.h"
#include "game/hsfmotion.h"
#include "game/memory.h"
#include "game/minigame_seq.h"
#include "game/object.h"
#include "game/objsub.h"
#include "game/pad.h"
#include "game/process.h"
#include "game/sprite.h"
#include "game/wipe.h"

#include "dolphin.h"
#include "ext_math.h"

typedef struct {
    /* 0x00 */ s16 unk00;
    /* 0x02 */ s16 unk02[5];
    /* 0x0C */ s16 unk0C;
    /* 0x0E */ s16 unk0E;
    /* 0x10 */ Vec unk10;
    /* 0x1C */ Vec unk1C;
} UnkBss138InnerStruct00; // Size 0x28

typedef struct {
    /* 0x000 */ s16 unk00;
    /* 0x002 */ char unk02[2];
    /* 0x004 */ Vec unk04;
    /* 0x010 */ Vec unk10;
    /* 0x01C */ UnkBss138InnerStruct00 unk1C[5];
    /* 0x0E4 */ UnkBss138InnerStruct00 unkE4[5];
    /* 0x1AC */ UnkBss138InnerStruct00 unk1AC[4];
    /* 0x24C */ char unk24C[0x28];
    /* 0x274 */ UnkBss138InnerStruct00 unk274[5];
} UnkBss138Struct; // Size 0x33C

typedef struct {
    /* 0x00 */ float unk00;
    /* 0x04 */ float unk04;
    /* 0x08 */ float unk08;
    /* 0x0C */ float unk0C;
    /* 0x10 */ float unk10;
    /* 0x14 */ float unk14;
    /* 0x18 */ float unk18;
    /* 0x1C */ float unk1C;
    /* 0x20 */ float unk20;
} UnkBss474DoublyInnerStruct6C; // Size unknown

// Maybe HsfObject, but unk1C doesn't seem to match.
typedef struct {
    /* 0x00 */ char unk00[0x1C];
    /* 0x1C */ UnkBss474DoublyInnerStruct6C unk1C;
} UnkBss474InnerStruct6C; // Size unknown

typedef struct {
    /* 0x00 */ float unk00;
    /* 0x04 */ float unk04;
    /* 0x08 */ float unk08;
    /* 0x0C */ float unk0C;
    /* 0x10 */ float unk10;
    /* 0x14 */ float unk14;
    /* 0x18 */ float unk18;
    /* 0x1C */ float unk1C;
    /* 0x20 */ float unk20;
} UnkBss474InnerStructE4; // Size 0x24

typedef struct {
    /* 0x000 */ s16 unk00;
    /* 0x002 */ s16 unk02;
    /* 0x004 */ s16 unk04;
    /* 0x006 */ s16 unk06;
    /* 0x008 */ s16 unk08;
    /* 0x00A */ s16 unk0A;
    /* 0x00C */ s16 unk0C;
    /* 0x00E */ s16 unk0E[9];
    /* 0x020 */ s16 unk20;
    /* 0x022 */ s16 unk22[9];
    /* 0x034 */ s32 unk34;
    /* 0x038 */ s32 unk38;
    /* 0x03C */ s32 unk3C;
    /* 0x040 */ s32 unk40;
    /* 0x044 */ s32 unk44;
    /* 0x048 */ float unk48;
    /* 0x04C */ float unk4C;
    /* 0x050 */ float unk50;
    /* 0x054 */ float unk54;
    /* 0x058 */ float unk58;
    /* 0x05C */ float unk5C;
    /* 0x060 */ float unk60;
    /* 0x064 */ float unk64;
    /* 0x068 */ float unk68;
    /* 0x06C */ UnkBss474InnerStruct6C *unk6C[10];
    /* 0x094 */ UnkBss474InnerStruct6C *unk94[10];
    /* 0x0BC */ UnkBss474InnerStruct6C *unkBC[10];
    /* 0x0E4 */ UnkBss474InnerStructE4 unkE4[10];
    /* 0x24C */ AnimData *unk24C;
    /* 0x250 */ AnimData *unk250;
    /* 0x254 */ s8 unk254;
    /* 0x255 */ s8 unk255;
    /* 0x256 */ s8 unk256;
    /* 0x257 */ s8 unk257;
    /* 0x258 */ u16 unk258;
    /* 0x25A */ char unk25A[0xA];
    /* 0x264 */ s32 unk264;
    /* 0x268 */ s32 unk268;
} UnkBss474Struct; // Size 0x26C

typedef struct {
    /* 0x00 */ UnkBss474Struct *unk00;
    /* 0x04 */ s32 unk04;
    /* 0x08 */ s32 unk08;
    /* 0x0C */ s32 *unk0C;
} UnkFn64A3Struct; // Size unknown

void fn_1_E80(omObjData *arg0);
void fn_1_F8C(float arg0);
void fn_1_1074(void);
void fn_1_1498(s16 layer);
s32 fn_1_1520(void);
s32 fn_1_1C4C(void);
s32 fn_1_20C8(void);
void fn_1_25D0(void);
void fn_1_34B0(ModelData *model, ParticleData *particle, Mtx matrix, s32 arg3);
void fn_1_3A60(ModelData *model, ParticleData *particle, Mtx matrix);
void fn_1_3A9C(ModelData *model, ParticleData *particle, Mtx matrix);
void fn_1_3AD8(ModelData *model, ParticleData *particle, Mtx matrix);
void fn_1_3B14(ModelData *model, ParticleData *particle, Mtx matrix);
void fn_1_3B50(void);
void fn_1_3F34(void);
void fn_1_4218(void);
void fn_1_4454(void);
void fn_1_4968(void);
void fn_1_4BB0(void);
void fn_1_4E8C(void);
void fn_1_507C(void);
void fn_1_5384(void);
void fn_1_544C(void);
void fn_1_5554(void);
void fn_1_58BC(void);
void fn_1_5910(void);
s8 fn_1_5D58(s32 arg0, s32 arg1);
u8 fn_1_5E10(s32 arg0, s32 arg1);
u16 fn_1_5ED0(s32 arg0);
