#include "REL/mgmodedll.h"
#include "game/audio.h"
#include "game/wipe.h"

#include "ext_math.h"

typedef struct {
    /* 0x00 */ omObjData *unk00;
    /* 0x04 */ void (*unk04)(omObjData *, ...);
    /* 0x08 */ s32 unk08[4];
    /* 0x18 */ char unk18[4];
    /* 0x1C */ s32 unk1C[4];
    /* 0x2C */ char unk2C[4];
    /* 0x30 */ s32 unk30;
    /* 0x34 */ s32 unk34;
    /* 0x38 */ char unk38[0xC];
    /* 0x44 */ s32 unk44[2];
} StructBss2050; // Size unknown

typedef struct {
    /* 0x00 */ char unk00[8];
    /* 0x08 */ s32 unk08;
    /* 0x0C */ char unk0C[0x10];
    /* 0x1C */ s32 unk1C;
    /* 0x20 */ char unk20[0x10];
    /* 0x30 */ s32 unk30;
} UnkFunc1EE58Struct; // Size unknown

typedef struct {
    /* 0x00 */ s32 unk00;
    /* 0x04 */ s32 unk04;
    /* 0x08 */ s32 unk08;
    /* 0x0C */ float unk0C;
    /* 0x10 */ float unk10;
    /* 0x14 */ float unk14;
    /* 0x18 */ float unk18;
    /* 0x1C */ float unk1C;
    /* 0x20 */ float unk20;
    /* 0x24 */ float unk24;
    /* 0x28 */ float unk28;
    /* 0x2C */ float unk2C;
} StructBss3CC; // Size 0x30

void fn_1_19A30(StructBss8 *arg0);
void fn_1_19B8C(void);
void fn_1_19D00(void);
void fn_1_19E94(void);
void fn_1_19F5C(omObjData *arg0);
void fn_1_1A564(void);
void fn_1_1A6A0(void);
void fn_1_1A8E8(void);
void fn_1_1AA28(void);
void fn_1_1AB58(void);
void fn_1_1AC88(StructBss2050 *arg0, s32 arg1, s32 arg2, s32 arg3);
void fn_1_1B260(s32 arg0);
void fn_1_1BCEC(void);
void fn_1_1BECC(void);
void fn_1_1C09C(StructBss2050 *arg0, s32 arg1, s32 arg2, s32 arg3);
void fn_1_1CB4C(void);
void fn_1_1CEB0(omObjData *arg0, StructBss8_24 *arg1);
void fn_1_1D49C(StructBss8_24 *arg0);
s32 fn_1_1D688(StructBss8_24 *arg0);
void fn_1_1DD74(s32 arg0, StructBss8_24 *arg1);
void fn_1_1E608(StructBss8_24 *arg0);
void fn_1_1EB20(StructBss8_24 *arg0);
void fn_1_1EBE8(void);
void fn_1_1ED20(void);
void fn_1_1EE58(s32 arg0, UnkFunc1EE58Struct *arg1);
void fn_1_1F32C(omObjData *arg0);
void fn_1_1FABC(void);
void fn_1_1FC44(s32 arg0);
