#include "ext_math.h"
#include "game/audio.h"
#include "game/chrman.h"
#include "game/gamework.h"
#include "game/gamework_data.h"
#include "game/hsfman.h"
#include "game/hsfmotion.h"
#include "game/memory.h"
#include "game/minigame_seq.h"
#include "game/object.h"
#include "game/objsub.h"
#include "game/pad.h"
#include "game/sprite.h"
#include "game/wipe.h"
#include "string.h"

#include "REL/m456Dll.h"
#include "version.h"

#ifndef __MWERKS__
#include "game/esprite.h"
#include "game/frand.h"
#endif

typedef struct M456DllMainWork {
    struct {
        u8 unk_00_field0 : 1;
        u8 unk_00_field1 : 1;
        u8 unk_00_field2 : 1;
        u8 unk_00_field3 : 1;
    };
    s16 unk_02;
    s16 unk_04;
    s8 unk_06;
    s8 unk_07;
    u16 unk_08;
    u16 unk_0A;
    s32 unk_0C;
    s32 unk_10;
    s16 unk_14;
    s16 unk_16;
    s16 unk_18;
    s16 unk_1A;
    char unk1C[4];
    s32 unk_20;
    s32 unk_24;
    s16 unk_28;
    s16 unk_2A;
    s16 unk_2C;
    s16 unk_2E;
    s16 unk_30;
} M456DllMainWork; /* size = 0x34 */

typedef struct M456DllData0Struct {
    /* 0x00 */ float unk_00;
    /* 0x04 */ float unk_04;
    /* 0x08 */ float unk_08;
    /* 0x0C */ float unk_0C;
    /* 0x10 */ float unk_10;
    /* 0x14 */ float unk_14;
    /* 0x18 */ float unk_18;
} M456DllData0Struct; /* size = 0x1C */

typedef struct M456DllData1B0Struct {
    /* 0x00 */ u32 unk_00;
    /* 0x04 */ s32 unk_04;
} M456DllData1B0Struct; /* size = 0x08 */

typedef struct M456DllDataE4Struct {
    /* 0x00 */ s32 unk_00;
    /* 0x04 */ u32 unk_04;
} M456DllDataE4Struct; /* size = 0x08 */

typedef struct M456DllBss18Struct {
    s32 unk_00;
    s32 unk_04;
    s32 unk_08;
    float unk_0C;
    float unk_10;
    s32 unk_14;
    s32 unk_18;
    float unk_1C;
    s16 unk_20[0x10];
} M456DllBss18Struct; /* size 0x40 */

void fn_1_1304(omObjData *object);
void fn_1_2040(omObjData *object);
float fn_1_2090(float arg8, float arg9, float argA);
void fn_1_2194(Process *process);
void fn_1_21F8(s32 arg0, s32 arg1, float arg8);
void fn_1_2448(omObjData *object);
void fn_1_2918(Process *process);
void fn_1_2AC4(omObjData *object);
void fn_1_3C0(omObjData *object);
void fn_1_498(omObjData *);
void fn_1_BE4(omObjData *);
void fn_1_C40(Process *process);
void fn_1_CC4(void);
s32 fn_1_D2C(void);
s32 fn_1_F4C(void);
void fn_1_FD0(omObjData *object);

M456DllData0Struct lbl_1_data_0[2] = {
    { 500.0f, 0.0f, 1000.0f, 0.0f, 40.0f, 0.0f, 0.0f },
    { 1985.0f, 0.0f, 100.0f, 100.0f, -13.0f, 0.0f, 0.0f },
};
