#include "REL/executor.h"
#include "game/chrman.h"
#include "game/data.h"
#include "game/esprite.h"
#include "game/flag.h"
#include "game/frand.h"
#include "game/gamework.h"
#include "game/gamework_data.h"
#include "game/hsfanim.h"
#include "game/hsfdraw.h"
#include "game/hsfman.h"
#include "game/hsfmotion.h"
#include "game/memory.h"
#include "game/minigame_seq.h"
#include "game/object.h"
#include "game/objsub.h"
#include "game/pad.h"
#include "game/printfunc.h"
#include "game/process.h"
#include "game/sprite.h"
#include "game/wipe.h"

#include "dolphin.h"
#include "ext_math.h"

#undef ABS
#define ABS(x) ((0 > (x)) ? -(x) : (x))

typedef struct unk_bss_790_struct {
    /* 0x00 */ u16 unk00;
    /* 0x02 */ s16 unk02;
    /* 0x04 */ struct unk_bss_790_struct *unk04;
    /* 0x08 */ struct unk_bss_790_struct *unk08;
} UnkBss790Struct; // Size 0xC

typedef struct unk_bss_778_struct {
    /* 0x00 */ HsfanimStruct00 *unk00;
    /* 0x04 */ s32 *unk04;
    /* 0x08 */ s32 unk08;
    /* 0x0C */ s32 unk0C;
    /* 0x10 */ struct unk_bss_778_struct *unk10;
    /* 0x14 */ struct unk_bss_778_struct *unk14;
} UnkBss778Struct; // Size 0x18

typedef struct {
    /* 0x00 */ u32 unk00;
    /* 0x04 */ s16 unk04;
    /* 0x06 */ char unk06[2]; // padding?
} UnkBss5E8Struct; // Size 8

typedef struct {
    /* 0x00 */ Vec unk00;
    /* 0x0C */ Vec unk0C;
    /* 0x18 */ float unk18;
    /* 0x1C */ float unk1C;
    /* 0x20 */ float unk20;
    /* 0x24 */ float unk24;
    /* 0x28 */ s32 unk28;
    /* 0x2C */ u8 unk2C;
    /* 0x2D */ u8 unk2D;
    /* 0x2E */ char unk2E[2];
    /* 0x30 */ float *unk30;
    /* 0x34 */ u16 *unk34;
} UnkFn2480Struct; // Size 0x38

typedef struct {
    /* 0x00 */ Vec unk00;
    /* 0x0C */ float unk0C;
} UnkBssACStruct; // Size 0x10

typedef struct {
    /* 0x00 */ Vec *unk00;
    /* 0x04 */ Vec *unk04;
    /* 0x08 */ u8 (*unk08)[0xC]; // Vec?
    /* 0x0C */ u16 (*unk0C)[4];
    /* 0x10 */ UnkFn2480Struct *unk10;
    /* 0x14 */ Vec *unk14;
    /* 0x18 */ Vec *unk18;
    /* 0x1C */ GXColor *unk1C;
    /* 0x20 */ float (*unk20)[2];
    /* 0x24 */ void *unk24;
    /* 0x28 */ u32 unk28;
} UnkBss5ACStruct; // Size unknown

typedef struct {
    /* 0x00 */ void *unk00;
    /* 0x04 */ s32 unk04;
    /* 0x08 */ u16 unk08;
    /* 0x0A */ u16 unk0A;
    /* 0x0C */ GXBool unk0C;
    /* 0x0D */ char unk0D[3]; // padding?
} UnkBss10Struct; // Size 0x10

typedef struct {
    /* 0x00 */ float unk00;
    /* 0x04 */ s32 unk04;
} UnkBssA4InnerStruct; // Size 8

typedef struct {
    /* 0x000 */ UnkBssA4InnerStruct *unk00;
    /* 0x004 */ s32 unk04;
    /* 0x008 */ s32 unk08;
    /* 0x00C */ s32 unk0C[10];
    /* 0x034 */ float unk34;
    /* 0x038 */ float unk38;
    /* 0x03C */ float unk3C;
    /* 0x040 */ float unk40;
    /* 0x044 */ s32 unk44;
    /* 0x048 */ s32 unk48;
    /* 0x04C */ Vec unk4C;
    /* 0x058 */ float unk58;
    /* 0x05C */ float unk5C;
    /* 0x060 */ float unk60;
    /* 0x064 */ float unk64;
    /* 0x068 */ float unk68;
    /* 0x06C */ float unk6C;
    /* 0x070 */ float unk70;
    /* 0x074 */ float unk74;
    /* 0x078 */ u16 unk78;
    /* 0x07A */ char unk7A[2];
    /* 0x07C */ s32 unk7C;
    /* 0x080 */ s32 unk80;
    /* 0x084 */ s32 unk84;
    /* 0x088 */ s32 unk88;
    /* 0x08C */ s32 unk8C;
    /* 0x090 */ s32 unk90;
    /* 0x094 */ s32 unk94;
    /* 0x098 */ s32 unk98;
    /* 0x09C */ s32 unk9C;
    /* 0x0A0 */ Vec unkA0[5];
    /* 0x0DC */ s32 unkDC[5];
    /* 0x0F0 */ s16 unkF0[5];
    /* 0x0FA */ char unkFA[2];
    /* 0x0FC */ float unkFC;
    /* 0x100 */ s32 unk100;
    /* 0x104 */ s32 unk104;
    /* 0x108 */ s32 unk108;
    /* 0x10C */ s32 unk10C;
    /* 0x110 */ s32 unk110;
} UnkBssA4Data; // Size 0x114

// Functions fn_1_0..fn_1_1FC4 are identical to the ones in m402Dll.
// lbl_1_bss_790..lbl_1_bss_5E8 seems to be the same as well.

void fn_1_0(void);
void fn_1_24(u16 arg0, s16 arg1);
s16 fn_1_AC(s16 arg0);
void fn_1_150(void);
void fn_1_174(s16 arg0, HsfanimStruct00 *arg1, s32 arg2, s32 arg3, s32 arg4, Vec *arg5, u8 arg6);
void fn_1_2D8(void);
void fn_1_414(void);
s16 fn_1_46C(s32 arg0);
void fn_1_580(s32 *arg0, s32 arg1, s32 arg2);
void fn_1_798(s32 arg0);
void fn_1_9EC(void);
void fn_1_A40(void);
void fn_1_B4C(float arg0, s32 arg1);
void fn_1_11F4(float arg0, Vec *arg1, Vec *arg2, Vec *arg3);
void fn_1_1350(Vec *arg0, Vec *arg1, Vec *arg2);
s32 fn_1_13DC(float arg0, Vec *arg1);
void fn_1_1710(float arg0, Vec *arg1);
void fn_1_1A60(Vec *arg0, s16 arg1, Vec *arg2);
void fn_1_1D18(s16 arg0, char *arg1, Vec *arg2);
void fn_1_1D70(s16 arg0, char *arg1, Vec *arg2, Mtx arg3);
float fn_1_1E20(float arg0, float arg1, float arg2);
