#include "REL/w04Dll.h"
#include "game/audio.h"
#include "game/data.h"
#include "game/gamework_data.h"
#include "game/hsfanim.h"
#include "game/hsfdraw.h"
#include "game/hsfman.h"
#include "game/memory.h"
#include "game/object.h"
#include "game/objsub.h"
#include "game/pad.h"
#include "game/process.h"
#include "game/sprite.h"
#include "game/window.h"
#include "game/board/audio.h"
#include "game/board/main.h"
#include "game/board/model.h"
#include "game/board/player.h"
#include "game/board/space.h"
#include "game/board/ui.h"
#include "game/board/window.h"
#include "game/frand.h"

#include "dolphin.h"
#include "ext_math.h"

typedef struct {
    /* 0x00 */ char unk00[0x50];
    /* 0x50 */ u32 unk50; // pointer?
    /* 0x54 */ s32 unk54;
} UnkParticleDataStruct; // Size unknown

typedef struct {
    /* 0x00 */ s16 unk00;
    /* 0x02 */ s16 unk02;
    /* 0x04 */ s16 unk04;
    /* 0x06 */ s16 unk06;
    /* 0x08 */ s16 unk08;
    /* 0x0A */ s16 unk0A;
    /* 0x0C */ s16 unk0C;
    /* 0x0E */ s16 unk0E;
    /* 0x10 */ float unk10;
    /* 0x14 */ float unk14;
    /* 0x18 */ float unk18;
    /* 0x1C */ float unk1C;
    /* 0x20 */ Vec unk20;
    /* 0x2C */ Process *unk2C;
} BssE4Data; // Size 0x30

static void fn_1_20EC(void);
static void fn_1_28BC(void);
static void fn_1_2B8C(void);
static void fn_1_2C10(void);
static void fn_1_2E60(s16 arg0);
static void fn_1_2EE8(s32 arg0);
static s32 fn_1_2F54(u32 arg0);
static BssE4Data *fn_1_2FBC(s16 arg0);
static void fn_1_2FDC(void);
static void fn_1_30A4(void);
static void fn_1_38D8(void);
static s32 fn_1_3C9C(void);
static void fn_1_45A8(void);
static void fn_1_4630(void);
static s32 fn_1_4680(s16 arg0);
static void fn_1_4848(void);
static void fn_1_5018(void);
static void fn_1_52A0(s16 arg0, Vec *arg1);
static void fn_1_55A0(void);
static void fn_1_5648(void);
static void fn_1_5828(void);
static s16 fn_1_58A4(Vec *arg0);
static void fn_1_5980(s16 arg0);
static void fn_1_59C4(omObjData *arg0);
static void fn_1_5A2C(ModelData *model, ParticleData *particle, Mtx matrix);

static s16 lbl_1_bss_FA;
static s16 lbl_1_bss_F4[3];
static Process *lbl_1_bss_E4[4];
