#include "game/board/ui.h"
#include "game/audio.h"
#include "game/chrman.h"
#include "game/data.h"
#include "game/gamework.h"
#include "game/gamework_data.h"
#include "game/hsfex.h"
#include "game/hsfman.h"
#include "game/object.h"
#include "game/pad.h"
#include "game/process.h"
#include "game/sprite.h"
#include "game/window.h"
#include "game/board/com.h"
#include "game/board/item.h"
#include "game/board/main.h"
#include "game/board/model.h"
#include "game/board/player.h"
#include "game/board/tutorial.h"

#include "ext_math.h"

typedef struct {
    /* 0x00 */ struct {
        u8 unk00_bit0 : 1;
        u8 unk00_bit1 : 1;
        u8 unk00_bit2 : 1;
        u8 unk00_bit3 : 1;
        u8 unk00_bit4 : 1;
        u8 unk00_bit5 : 1;
        u8 unk00_bit6 : 1;
    };
    /* 0x01 */ s8 unk01;
    /* 0x02 */ s16 unk02;
    /* 0x04 */ Vec unk04;
    /* 0x10 */ Vec unk10;
} UnkUiStatusStruct; // Size 0x1C

typedef struct {
    /* 0x00 */ s8 unk00[6];
    /* 0x06 */ s16 unk06[6];
    /* 0x12 */ s16 unk12[6];
    /* 0x1E */ s16 unk1E[6];
    /* 0x2A */ char unk2A[2];
    /* 0x2C */ Vec unk2C[6];
    /* 0x74 */ Vec unk74[6];
} UnkUiWindowStruct; // Size 0xBC

typedef struct {
    struct {
        u8 unk00_bit0 : 1;
        u8 unk00_bit3 : 3;
        u8 unk00_bit5 : 2;
        u8 unk00_bit6 : 1;
        u8 unk00_bit7 : 1;
    };
    s8 unk01;
    s8 unk02;
    u8 unk03;
    s16 unk04;
    s16 unk06;
} UnkUiWork01;

typedef struct {
    struct {
        u8 unk00_bit0 : 1;
        u8 unk00_bit3 : 3;
        u8 unk00_bit5 : 2;
    };
    s8 unk01;
    char unk02[2];
    float unk04;
} UnkUiWork02;

typedef struct {
    struct {
        u8 unk00_bit0 : 1;
        u8 unk00_bit1 : 1;
    };
    s8 unk01;
    s8 unk02;
    s8 unk03;
    Vec *unk04;
} UnkUiWork03;

typedef struct {
    struct {
        u8 unk00_bit0 : 1;
    };
    s8 unk01;
    s8 unk02;
    s8 unk03;
    UnkUiWindowStruct *unk04;
} UnkUiWork04;

void BoardPlayerSparkSet(s32);
void BoardBowserSuitMotionCreate(void);
s16 BoardBowserSuitPlayerModelGet(void);

static void KillAllBoardStatus(void);
