#include "REL/executor.h"
#include "game/chrman.h"
#include "game/data.h"
#include "game/esprite.h"
#include "game/flag.h"
#include "game/frand.h"
#include "game/gamework.h"
#include "game/gamework_data.h"
#include "game/hsfanim.h"
#include "game/hsfdraw.h"
#include "game/hsfman.h"
#include "game/hsfmotion.h"
#include "game/memory.h"
#include "game/minigame_seq.h"
#include "game/object.h"
#include "game/objsub.h"
#include "game/pad.h"
#include "game/printfunc.h"
#include "game/process.h"
#include "game/sprite.h"
#include "game/wipe.h"

#include "dolphin.h"
#include "ext_math.h"
#include "rel_sqrt_consts.h"

#undef ABS
#define ABS(x) ((0 > (x)) ? -(x) : (x))

typedef struct unk_bss_204_struct {
    /* 0x00 */ u16 unk00;
    /* 0x02 */ s16 unk02;
    /* 0x04 */ struct unk_bss_204_struct *unk04;
    /* 0x08 */ struct unk_bss_204_struct *unk08;
} UnkBss204Struct; // Size 0xC

typedef struct unk_bss_1ec_struct {
    /* 0x00 */ HsfanimStruct00 *unk00;
    /* 0x04 */ s32 *unk04;
    /* 0x08 */ s32 unk08;
    /* 0x0C */ s32 unk0C;
    /* 0x10 */ struct unk_bss_1ec_struct *unk10;
    /* 0x14 */ struct unk_bss_1ec_struct *unk14;
} UnkBss1ECStruct; // Size 0x18

typedef struct {
    /* 0x00 */ u32 unk00;
    /* 0x04 */ s16 unk04;
    /* 0x06 */ char unk06[2]; // padding?
} UnkBss5CStruct; // Size 8

typedef struct {
    /* 0x00 */ float unk00;
    /* 0x04 */ float unk04;
    /* 0x08 */ float unk08;
    /* 0x0C */ float unk0C;
    /* 0x10 */ float unk10;
    /* 0x14 */ float unk14;
    /* 0x18 */ float unk18;
    /* 0x1C */ float unk1C;
    /* 0x20 */ float unk20;
    /* 0x24 */ float unk24;
    /* 0x28 */ float unk28;
    /* 0x2C */ float unk2C;
    /* 0x30 */ float unk30;
    /* 0x34 */ s32 unk34;
    /* 0x38 */ s32 unk38;
    /* 0x3C */ s32 unk3C;
    /* 0x40 */ s32 unk40;
    /* 0x44 */ s32 unk44;
    /* 0x48 */ s32 unk48;
    /* 0x4C */ s32 unk4C;
    /* 0x50 */ s32 unk50;
    /* 0x54 */ s32 unk54;
    /* 0x58 */ s32 unk58;
    /* 0x5C */ s32 unk5C;
    /* 0x60 */ s32 unk60;
} UnkFn27A8Struct; // Size 0x64

typedef struct {
    /* 0x00 */ float unk00;
    /* 0x04 */ float unk04;
    /* 0x08 */ float unk08;
    /* 0x0C */ float unk0C;
    /* 0x10 */ s32 unk10;
} UnkData234Struct; // Size 0x14

typedef struct {
    /* 0x00 */ float unk00;
    /* 0x04 */ float unk04;
    /* 0x08 */ float unk08;
    /* 0x0C */ float unk0C;
    /* 0x10 */ float unk10;
    /* 0x14 */ float unk14;
    /* 0x18 */ s32 unk18;
} UnkFn6AB4Struct; // Size 0x1C

typedef struct {
    /* 0x00 */ Vec unk00;
    /* 0x0C */ float unk0C;
    /* 0x10 */ float unk10;
    /* 0x14 */ float unk14;
    /* 0x18 */ float unk18;
    /* 0x1C */ float unk1C;
    /* 0x20 */ float unk20;
    /* 0x24 */ Vec unk24;
    /* 0x30 */ float unk30;
    /* 0x34 */ float unk34;
    /* 0x38 */ s32 unk38;
} UnkFn70E4Struct; // Size 0x3C

static void fn_1_0(void);
static void fn_1_24(u16 arg0, s16 arg1);
static s16 fn_1_AC(s16 arg0);
static void fn_1_150(void);
static void fn_1_174(s16 arg0, HsfanimStruct00 *arg1, s32 arg2, s32 arg3, s32 arg4, Vec *arg5, u8 arg6);
static void fn_1_2D8(void);
static void fn_1_414(void);
static s16 fn_1_46C(s32 arg0);
static void fn_1_580(s32 *arg0, s32 arg1, s32 arg2);
static void fn_1_798(s32 arg0);
static void fn_1_9EC(void);
static void fn_1_A40(void);
static void fn_1_B4C(float arg0, s32 arg1);
static void fn_1_11F4(float arg0, Vec *arg1, Vec *arg2, Vec *arg3);
static void fn_1_1350(Vec *arg0, Vec *arg1, Vec *arg2);
static s32 fn_1_13DC(float arg0, Vec *arg1);
static void fn_1_1710(float arg0, Vec *arg1);
static void fn_1_1A60(Vec *arg0, s16 arg1, Vec *arg2);
static void fn_1_1D18(s16 arg0, char *arg1, Vec *arg2);
static void fn_1_1D70(s16 arg0, char *arg1, Vec *arg2, Mtx arg3);
