#include "REL/executor.h"
#include "game/chrman.h"
#include "game/object.h"
#include "game/objsub.h"
#include "game/frand.h"
#include "game/wipe.h"
#include "game/minigame_seq.h"

#include "game/gamework_data.h"

#include "game/pad.h"
#include "game/printfunc.h"
#include "game/mapspace.h"

#include "game/hsfman.h"
#include "game/hsfmotion.h"
#include "game/hsfanim.h"
#include "game/hsfdraw.h"

#include "game/esprite.h"
#include "game/sprite.h"

#include "ext_math.h"
#include "rel_sqrt_consts.h"


#undef ABS
#define ABS(x) ((0 > (x)) ? -(x) : (x))

typedef struct unk_bss_1F8_struct {
    /* 0x00 */ u16 unk00;
    /* 0x02 */ s16 unk02;
    /* 0x04 */ struct unk_bss_1F8_struct *unk04;
    /* 0x08 */ struct unk_bss_1F8_struct *unk08;
} UnkBss1F8Struct; // Size 0xC

typedef struct unk_bss_1E0_struct {
    /* 0x00 */ HsfanimStruct00 *unk00;
    /* 0x04 */ s32 *unk04;
    /* 0x08 */ s32 unk08;
    /* 0x0C */ s32 unk0C;
    /* 0x10 */ struct unk_bss_1E0_struct *unk10;
    /* 0x14 */ struct unk_bss_1E0_struct *unk14;
} UnkBss1E0Struct; // Size 0x18

typedef struct {
    /* 0x00 */ u32 unk00;
    /* 0x04 */ s16 unk04;
} UnkBss1B0Struct; // Size 8

UnkBss1F8Struct lbl_1_bss_1F8;
UnkBss1E0Struct lbl_1_bss_1E0;
Process *lbl_1_bss_1DC;
Vec lbl_1_bss_1D0;
Vec lbl_1_bss_1C4;
Vec lbl_1_bss_1B8;
Vec lbl_1_bss_1AC;
u32 lbl_1_bss_1A8;
s32 lbl_1_bss_1A4;
u32 lbl_1_bss_1A0;
s16 lbl_1_bss_19E;
s16 lbl_1_bss_19C;
s32 lbl_1_bss_198;
s32 lbl_1_bss_194;
float lbl_1_bss_190;
s32 lbl_1_bss_150[16];
UnkBss1B0Struct lbl_1_bss_50[32];

void fn_1_0(void) {
    lbl_1_bss_1F8.unk04 = NULL;
    lbl_1_bss_1F8.unk08 = NULL;
}

void fn_1_24(u16 arg0, s16 arg1) {
    UnkBss1F8Struct *temp_r31;
    UnkBss1F8Struct *temp_r30;
    UnkBss1F8Struct *temp_r29;

    temp_r31 = HuMemDirectMallocNum(HEAP_SYSTEM, sizeof(*temp_r31), MEMORY_DEFAULT_NUM);
    temp_r31->unk00 = arg0;
    temp_r31->unk02 = arg1;
    temp_r30 = &lbl_1_bss_1F8;
    temp_r29 = temp_r30->unk08;
    temp_r30->unk08 = temp_r31;
    if (NULL != temp_r29) {
        temp_r29->unk04 = temp_r31;
    }
    temp_r31->unk04 = temp_r30;
