#include "dolphin/pad.h"
#include "game/audio.h"
#include "game/chrman.h"
#include "game/data.h"
#include "game/esprite.h"
#include "game/gamework_data.h"
#include "game/hsfdraw.h"
#include "game/hsfman.h"
#include "game/hsfmotion.h"
#include "game/minigame_seq.h"
#include "game/object.h"
#include "game/objsub.h"
#include "game/pad.h"
#include "game/printfunc.h"
#include "game/process.h"
#include "game/sprite.h"
#include "game/window.h"
#include "game/wipe.h"
#include "string.h"

#include "ext_math.h"
#include "version.h"

s32 rand8(void);

#define MSM_SE_BOWSER_LAUGH 0x3A
#define MSM_SE_BOWSER_HOWL 0x3E
#define MSM_SE_KOOPA_KID_DROP 0x5B
#define MSM_SE_PLAYER_DROP 0x33D
#define MSM_SE_WIND 0x6D7
#define MSM_SE_INVINCIBILITY 0x7E6

#define MSM_MUS_BACKGROUND 0x4D

#define MODEL_ID_PLAYER_PLAYER 0

#define MODEL_ID_GAME_SKY 0
#define MODEL_ID_GAME_RING 1
#define MODEL_ID_GAME_MUSHROOM 2
#define MODEL_ID_GAME_INVINCE_SHINING 3
#define MODEL_ID_GAME_INVINCE_SPARKS 4
#define MODEL_ID_GAME_KOOPA_KID 5
#define MODEL_ID_GAME_WAR_FAN 6

#define CHARACTER_BOWSER -1
#define PAD_IDX_COM -1

#define PLAYER_STATE_INITIAL_ADVANCE 2 // TODO is this right?
#define PLAYER_STATE_FALLING 16

#define PREV_TRIG_L 0
#define PREV_TRIG_R 1

typedef struct PlayerData {
    /* 0x00 */ s32 group;
    /* 0x04 */ s32 player;
    /* 0x08 */ s32 character;
    /* 0x0C */ s32 padIdx;
    /* 0x10 */ s32 diff;
    /* 0x14 */ s32 state;
    /* 0x18 */ s32 unk18;
    /* 0x1C */ s32 invinceTime;
    /* 0x20 */ s32 unk20;
    /* 0x24 */ s32 unk24;
    /* 0x28 */ s32 unk28;
    /* 0x2C */ s32 unk2C;
    /* 0x30 */ s32 stamina;
    /* 0x34 */ s32 unk34;
    /* 0x38 */ s32 prevTrig;
    /* 0x3C */ s32 unk3C;
    /* 0x40 */ s32 unk40;
    /* 0x44 */ s32 unk44;
    /* 0x48 */ float unk48;
    /* 0x4C */ s32 unk4C;
} PlayerData; // Size 0x50

typedef struct StructBss78 {
    /* 0x00 */ s32 unk00;
    /* 0x04 */ float unk04[3];
} StructBss78; // Size 0x10

typedef struct StructData28C {
    /* 0x00 */ s32 unk00;
    /* 0x04 */ s32 unk04;
    /* 0x08 */ float unk08;
    /* 0x0C */ float unk0C;
    /* 0x10 */ float unk10;
    /* 0x14 */ float unk14;
} StructData28C; // Size 0x18

typedef struct SparkData {
    /* 0x00 */ float scale;
    /* 0x04 */ float xOffset;
    /* 0x08 */ float yOffset;
} SparkData; // Size 0x0C

static void M457Exit(omObjData *object);

static StructBss78 lbl_1_bss_78[5];
static omObjData *mainObj;
static omObjData *omViewObj;
static omObjData *playerObj[2];
static omObjData *gameObj;
static s32 lbl_1_bss_60;
static s32 gameState;
static char lbl_1_bss_58[4]; // unused
static s32 lbl_1_bss_54;
static s32 lbl_1_bss_50;
static Process *objman;
static s32 lightId;
static s32 lbl_1_bss_44;
static s32 lbl_1_bss_40;
static s32 lbl_1_bss_3C;
static char lbl_1_bss_38[4]; // unused
static float lbl_1_bss_34;
static float lbl_1_bss_30;
static float lbl_1_bss_2C;
static float lbl_1_bss_28;
static s32 lbl_1_bss_24;
static s32 lbl_1_bss_20;
static s32 lbl_1_bss_1C;
static s32 lbl_1_bss_18;
static BOOL againstBrowserF;
static s32 m457MesEndF;
static char lbl_1_bss_8[8]; // unused
static s32 lbl_1_bss_4;
static char lbl_1_bss_0[4]; // unused

