#include "game/audio.h"
#include "game/chrman.h"
#include "game/data.h"
#include "game/sprite.h"
#include "game/esprite.h"
#include "game/gamework_data.h"
#include "game/hsfdraw.h"
#include "game/hsfman.h"
#include "game/hsfmotion.h"
#include "game/minigame_seq.h"
#include "game/object.h"
#include "game/objsub.h"
#include "game/pad.h"
#include "game/printfunc.h"
#include "game/process.h"
#include "game/window.h"
#include "game/wipe.h"
#include "string.h"

#include "ext_math.h"

s32 rand8(void);

typedef struct {
    /* 0x00 */ s32 unk00;
    /* 0x04 */ s32 unk04;
    /* 0x08 */ s32 unk08;
    /* 0x0C */ s32 unk0C;
    /* 0x10 */ s32 unk10;
    /* 0x14 */ s32 unk14;
    /* 0x18 */ s32 unk18;
    /* 0x1C */ s32 unk1C;
    /* 0x20 */ s32 unk20;
    /* 0x24 */ s32 unk24;
    /* 0x28 */ s32 unk28;
    /* 0x2C */ s32 unk2C;
    /* 0x30 */ s32 unk30;
    /* 0x34 */ s32 unk34;
    /* 0x38 */ s32 unk38;
    /* 0x3C */ s32 unk3C;
    /* 0x40 */ s32 unk40;
    /* 0x44 */ s32 unk44;
    /* 0x48 */ float unk48;
    /* 0x4C */ s32 unk4C;
} StructBss68Data; // Size 0x50

typedef struct {
    /* 0x00 */ s32 unk00;
    /* 0x04 */ float unk04[3];
} StructBss78; // Size 0x10

typedef struct {
    /* 0x00 */ s32 unk00;
    /* 0x04 */ s32 unk04;
    /* 0x08 */ float unk08;
    /* 0x0C */ float unk0C;
    /* 0x10 */ float unk10;
    /* 0x14 */ float unk14;
} StructData28C; // Size 0x18

void fn_1_7AE4(omObjData* arg0);

StructBss78 lbl_1_bss_78[5];
omObjData* lbl_1_bss_74;
omObjData* lbl_1_bss_70;
omObjData* lbl_1_bss_68[2];
omObjData* lbl_1_bss_64;
s32 lbl_1_bss_60;
s32 lbl_1_bss_5C;
char lbl_1_bss_58[4]; // unused
s32 lbl_1_bss_54;
s32 lbl_1_bss_50;
Process* lbl_1_bss_4C;
s32 lbl_1_bss_48;
s32 lbl_1_bss_44;
s32 lbl_1_bss_40;
s32 lbl_1_bss_3C;
char lbl_1_bss_38[4]; // unused
float lbl_1_bss_34;
float lbl_1_bss_30;
float lbl_1_bss_2C;
float lbl_1_bss_28;
s32 lbl_1_bss_24;
s32 lbl_1_bss_20;
s32 lbl_1_bss_1C;
s32 lbl_1_bss_18;
s32 lbl_1_bss_14;
s32 lbl_1_bss_10;
char lbl_1_bss_8[8]; // unused
s32 lbl_1_bss_4;
char lbl_1_bss_0[4]; // unused

s32 lbl_1_data_0[] = {
    DATA_MAKE_NUM(DATADIR_M457, 23),
    DATA_MAKE_NUM(DATADIR_M457, 22),
    DATA_MAKE_NUM(DATADIR_M457, 24),
    DATA_MAKE_NUM(DATADIR_M457, 24),
    DATA_MAKE_NUM(DATADIR_M457, 24),
    DATA_MAKE_NUM(DATADIR_M457, 24),
