#include "REL/w01Dll.h"
#include "REL/board_executor.h"
#include "game/audio.h"
#include "game/chrman.h"
#include "game/data.h"
#include "game/gamework_data.h"
#include "game/hsfdraw.h"
#include "game/hsfman.h"
#include "game/hsfmotion.h"
#include "game/object.h"
#include "game/objsub.h"
#include "game/pad.h"
#include "game/process.h"
#include "game/window.h"
#include "game/wipe.h"
#include "game/board/audio.h"
#include "game/board/boo_house.h"
#include "game/board/com.h"
#include "game/board/lottery.h"
#include "game/board/main.h"
#include "game/board/model.h"
#include "game/board/player.h"
#include "game/board/shop.h"
#include "game/board/space.h"
#include "game/board/star.h"
#include "game/board/ui.h"
#include "game/board/view.h"
#include "game/board/window.h"
#include "game/board/map_object.h"

#include "dolphin.h"
#include "ext_math.h"

typedef struct {
    struct {
        u8 unk00_field0 : 1;
    };
} Bss10Work;

typedef struct {
    struct {
        u8 unk00_field0 : 1;
        u8 unk00_field1 : 3;
        u8 unk00_field2 : 1;
        u8 unk00_field3 : 1;
    };
    u8 unk01;
    u8 unk02;
    char unk03[1];
    s16 unk04;
    char unk06[2];
    float unk08;
} Bss18Work;

typedef struct {
    /* 0x00 */ s8 unk00;
    /* 0x01 */ s8 unk01;
    /* 0x02 */ s16 unk02;
    /* 0x04 */ s16 unk04;
    /* 0x06 */ s16 unk06;
    /* 0x08 */ float unk08;
    /* 0x0C */ char unk0C[4];
    /* 0x10 */ float unk10;
    /* 0x14 */ Vec unk14;
    /* 0x20 */ Mtx unk20;
} BssCData; // Size 0x50

typedef struct {
    struct {
        u8 unk00_field0 : 1;
    };
    s8 unk01;
    char unk02[2];
    BssCData *unk04;
} BssCWork;

typedef struct {
    /* 0x00 */ s16 unk00;
    /* 0x02 */ s16 unk02;
    /* 0x04 */ float unk04;
    /* 0x08 */ Vec unk08;
    /* 0x14 */ Vec unk14;
} Bss20Data; // Size 0x20

typedef struct {
    struct {
        u8 unk00_field0 : 1;
    };
    u8 unk01;
    char unk02[2];
    Bss20Data *unk04;
} Bss20Work;

static void fn_1_730(void);
static void fn_1_774(void);
static s32 fn_1_778(void);
static s32 fn_1_814(void);
static void fn_1_9E8(void);
static void fn_1_D00(void);
static void fn_1_D04(void);
static void fn_1_1254(void);
static void fn_1_128C(void);
static void fn_1_130C(void);
static s32 fn_1_157C(void);
static void fn_1_1670(void);
static void fn_1_1700(void);
static void fn_1_1990(void);
static void fn_1_1AD8(BoardCameraData *camera);
static void fn_1_1B3C(void);
static void fn_1_1EE4(void);
static void fn_1_1F2C(omObjData *arg0);
static void fn_1_1FA4(void);
static float fn_1_2524(void);
static void fn_1_276C(void);
static void fn_1_2F18(void);
static void fn_1_3350(void);
static void fn_1_3514(s32 arg0);
static void fn_1_35B4(s32 arg0);
static void fn_1_3624(void);
static void fn_1_45F4(void);
