#include "REL/w01Dll.h"
#include "game/audio.h"
#include "game/chrman.h"
#include "game/data.h"
#include "game/gamework_data.h"
#include "game/hsfanim.h"
#include "game/frand.h"

#include "game/hsfman.h"
#include "game/memory.h"
#include "game/minigame_seq.h"
#include "game/object.h"
#include "game/objsub.h"
#include "game/pad.h"
#include "game/sprite.h"
#include "game/window.h"
#include "game/board/audio.h"
#include "game/board/com.h"
#include "game/board/main.h"
#include "game/board/model.h"
#include "game/board/player.h"
#include "game/board/window.h"

#include "dolphin.h"
#include "ext_math.h"

typedef struct {
    /* 0x00 */ Vec unk00;
    /* 0x0C */ float unk0C;
} Data690InnerStruct; // Size 0x10

typedef Data690InnerStruct Data690Block[15];

typedef struct {
    /* 0x00 */ s16 unk00;
    /* 0x02 */ s16 unk02;
    /* 0x04 */ Vec unk04;
    /* 0x10 */ Vec unk10;
    /* 0x1C */ u16 unk1C;
    /* 0x1E */ char unk1E[2];
    /* 0x20 */ float unk20;
    /* 0x24 */ u16 unk24;
    /* 0x26 */ s16 unk26;
    /* 0x28 */ s16 unk28;
    /* 0x2A */ char unk2A[2];
} Bss720Data; // Size 0x2C

typedef struct {
    /* 0x00 */ char unk00[4];
    /* 0x04 */ Data690Block *unk04;
    /* 0x08 */ u16 unk08;
    /* 0x0A */ char unk0A[2];
    /* 0x0C */ float unk0C;
    /* 0x10 */ float unk10;
    /* 0x14 */ float unk14;
    /* 0x18 */ float unk18;
    /* 0x1C */ float unk1C;
    /* 0x20 */ Vec unk20;
    /* 0x2C */ Vec unk2C;
    /* 0x38 */ float unk38;
    /* 0x3C */ float unk3C;
    /* 0x40 */ s16 unk40;
    /* 0x42 */ char unk42[2];
} Bss714Data; // Size 0x44

static void fn_1_A4B8(omObjData *arg0);
static void fn_1_A554(void);
static void fn_1_A5FC(void);
static void fn_1_A6E0(omObjData *arg0);
static float fn_1_B018(Data690Block *arg0);
static void fn_1_B088(omObjData *arg0);
static void fn_1_B1CC(omObjData *arg0, u16 *arg1, u16 *arg2);
static void fn_1_B3B8(omObjData *arg0);
static void fn_1_B478(omObjData *arg0);
static void fn_1_BAF8(omObjData *arg0);
static void fn_1_BCDC(omObjData *arg0);
static void fn_1_BF00(omObjData *arg0);
static void fn_1_BF68(omObjData *arg0);
static void fn_1_C000(void);
static void fn_1_C0FC(omObjData *arg0);
static void fn_1_C25C(void);
static void fn_1_C844(void);
static void fn_1_C894(omObjData *arg0);
static void fn_1_C94C(Vec *arg0, Vec *arg1, Vec *arg2);
static float fn_1_C998(Vec *arg0);
static u32 fn_1_CB44(Vec *arg0, float arg1);
static void fn_1_CEC4(void);
static void fn_1_D034(void);
static void fn_1_D07C(omObjData *arg0);
