#include "REL/w01Dll.h"
#include "game/audio.h"
#include "game/chrman.h"
#include "game/data.h"
#include "game/frand.h"
#include "game/gamework_data.h"
#include "game/hsfanim.h"

#include "game/board/audio.h"
#include "game/board/com.h"
#include "game/board/main.h"
#include "game/board/model.h"
#include "game/board/player.h"
#include "game/board/window.h"
#include "game/hsfman.h"
#include "game/memory.h"
#include "game/minigame_seq.h"
#include "game/object.h"
#include "game/objsub.h"
#include "game/pad.h"
#include "game/sprite.h"
#include "game/window.h"

#include "dolphin.h"
#include "ext_math.h"

typedef struct {
    /* 0x00 */ Vec pos;
    /* 0x0C */ float len;
} SpaceAmidaPathPoint; // Size 0x10

typedef SpaceAmidaPathPoint SpaceAmidaMap[15];

typedef struct {
    /* 0x00 */ s16 unk00;
    /* 0x02 */ s16 unk02;
    /* 0x04 */ Vec rocketPos;
    /* 0x10 */ Vec jumpDir;
    /* 0x1C */ u16 waitTime;
    /* 0x20 */ float jumpTime;
    /* 0x24 */ u16 comDelay;
    /* 0x26 */ s16 comChoice;
    /* 0x28 */ s16 comInputTimer;
} SpaceAmidaGameWork; // Size 0x2C

typedef struct {
    /* 0x00 */ char unk00[4];
    /* 0x04 */ SpaceAmidaMap *map;
    /* 0x08 */ u16 mapCursor;
    /* 0x0C */ float len;
    /* 0x10 */ float speed;
    /* 0x14 */ float maxSpeed;
    /* 0x18 */ float rocketXOfs;
    /* 0x1C */ float kemuriSize;
    /* 0x20 */ Vec kemuriScale;
    /* 0x2C */ Vec kemuriScaleVel;
    /* 0x38 */ float kemuriTPLvl;
    /* 0x3C */ float unk3C;
    /* 0x40 */ s16 targetNo;
} RocketWork; // Size 0x44

static void SpaceAmidaMainUpdate(omObjData *obj);
static void SpaceAmidaStop(void);
static void SpaceAmidaKill(void);
static void SpaceAmidaRocketObjUpdate(omObjData *obj);
static float SpaceAmidaMapLenGet(SpaceAmidaMap *obj);
static void SpaceAmidaComChoiceSet(omObjData *obj);
static void SpaceAmidaComInputGet(omObjData *obj, u16 *stkBtn, u16 *btn);
static void SpaceAmidaGameOpen(omObjData *obj);
static void SpaceAmidaGameUpdate(omObjData *obj);
static void SpaceAmidaRocketJump(omObjData *obj);
static void SpaceAmidaRocketKemuriExec(omObjData *obj);
static void SpaceAmidaRocketWait(omObjData *obj);
static void SpaceAmidaRocketUp(omObjData *obj);
static void SpaceAmidaCoinWin(void);
static void SpaceAmidaJumpDown(omObjData *obj);
static void SpaceAmidaCoinRainMain(void);
static void SpaceAmidaReturnWinMain(void);
static void SpaceAmidaGameStop(omObjData *obj);
static void SpaceAmidaDirGet(Vec *a, Vec *b, Vec *result);
