#include "REL/w03Dll.h"
#include "game/board/main.h"
#include "game/board/model.h"
#include "game/board/player.h"
#include "game/board/space.h"
#include "game/board/window.h"
#include "game/data.h"

#include "game/hsfdraw.h"
#include "game/hsfman.h"

#include "game/pad.h"
#include "game/wipe.h"

#include "ext_math.h"

// structs

typedef struct w03UnkStruct5 {
    /* 0x00 */ struct {
        u8 unk00_bit0 : 1;
        u8 unk00_bit1 : 2;
        u8 unk00_bit3 : 1;
        u8 unk00_bit4 : 4;
    };
    /* 0x01 */ char unk_01[3];
    /* 0x04 */ f32 unk_04;
    /* 0x08 */ f32 unk_08;
} w03UnkStruct5;

typedef struct w03UnkStruct4 {
    /* 0x00 */ struct {
        u8 unk00_bit0 : 1;
    };
} w03UnkStruct4;

typedef struct w03StructUnk3 {
    /* 0x00 */ s16 unk_00;
    /* 0x02 */ s16 model;
    /* 0x04 */ f32 unk_04;
    /* 0x08 */ Vec unk_08;
    /* 0x14 */ Vec unk_14;
} w03StructUnk3;

typedef struct w03StructUnk2 {
    /* 0x00 */ struct {
        u8 unkbit_00 : 1;
        u8 unkbit_01 : 2;
        u8 unkbit_03 : 1;
        u8 unkbit_04 : 1;
    };
    s8 unk_01;
    s8 unk_02;
    u8 unk_03;
    s16 model;
    char unk_06[2];
    w03StructUnk3 *unk_08;
} w03StructUnk2;

// function signatures
void fn_1_313C(void);
void fn_1_3218(void);
void fn_1_3304(void);
s32 fn_1_3478(s32);
void fn_1_3814(s32);
void fn_1_3968(s32);
void fn_1_3E88(s32);
void fn_1_3F5C(s32);
void fn_1_4354(s32);
void fn_1_48EC(s32);
void fn_1_4A9C(void);
void fn_1_50D4(omObjData *arg0);
void fn_1_5838(s32);
void fn_1_5AC8(omObjData *arg0);
void fn_1_5C5C(omObjData *arg0, w03UnkStruct5 *arg1);
void fn_1_602C(omObjData *arg0, w03UnkStruct5 *arg1);
f32 fn_1_61A4(omObjData *arg0, w03UnkStruct5 *arg1);
void fn_1_629C(s8 arg0);
s32 fn_1_62D0(void);
void fn_1_62FC(void);

// bss
float lbl_1_bss_80[20][2];
s8 lbl_1_bss_7D;
s8 lbl_1_bss_7C;
