#include "dolphin/gx/GXEnum.h"
#include "dolphin/gx/GXStruct.h"
#include "dolphin/gx/GXVert.h"
#include "ext_math.h"
#include "game/audio.h"
#include "game/chrman.h"
#include "game/flag.h"
#include "game/gamework_data.h"
#include "game/hsfanim.h"
#include "game/hsfdraw.h"
#include "game/hsfman.h"
#include "game/hsfmotion.h"
#include "game/memory.h"
#include "game/minigame_seq.h"
#include "game/object.h"
#include "game/objsub.h"
#include "game/pad.h"
#include "game/printfunc.h"
#include "game/sprite.h"
#include "game/window.h"
#include "game/wipe.h"
#include "string.h"

#include "REL/m430Dll.h"

#ifndef __MWERKS__
#include "game/esprite.h"
#include "game/frand.h"

void GXSetTevIndWarp(GXTevStageID tev_stage, GXIndTexStageID ind_stage, GXBool signed_offsets, GXBool replace_mode, GXIndTexMtxID matrix_sel);
#endif

inline double fabs2(double x)
{
    return (double)fabs(x);
}

typedef struct M430DllUnkStruct2 {
    s32 unk_00;
    s16 unk_04;
    char unk06[2];
    s16 unk_08;
    s16 unk_0A;
    Vec unk_0C;
    Vec unk_18;
    float unk_24;
    float unk_28;
    float unk_2C;
    float unk_30;
    float unk_34;
    float unk_38;
} M430DllUnkStruct2; /* size 0x3C */

typedef struct M430DllWork {
    s32 unk_00;
    Vec unk_04;
    s32 unk_10;
    s32 unk_14;
    s16 unk_18;
    s16 unk_1A;
    s16 unk_1C;
    s16 unk_1E;
    float unk_20;
    s16 unk_24[0xC];
    s32 unk_3C;
    s16 unk_40[0xA];
    s16 unk_54[0xA];
    s16 unk_68[0xA];
    s32 unk_7C;
    s16 unk_80[6];
    s16 unk_8C[6];
    s16 unk_98[6];
    s32 unk_A4[6];
    s32 unk_BC;
    M430DllUnkStruct2 *unk_C0;
} M430DllWork; /* size 0xC4 */

typedef struct M430DllWork2 {
    s16 unk_00;
    char unk02[4];
    s16 unk_06;
    Vec unk_08;
    Vec unk_14;
    float unk_20;
    float unk_24;
    float unk_28;
    float unk_2C;
    float unk_30;
    float unk_34;
    float unk_38;
    float unk_3C;
} M430DllWork2; /* size 0x40 */

typedef struct M430DllBss60Struct {
    /* 0x00 */ u32 unk_00;
    /* 0x04 */ s32 unk_04;
    /* 0x08 */ s32 unk_08;
    /* 0x0C */ s32 unk_0C;
    /* 0x10 */ s32 unk_10;
    /* 0x14 */ s32 unk_14;
    /* 0x18 */ s32 unk_18;
    /* 0x1C */ u32 unk_1C;
    /* 0x20 */ s32 unk_20;
    /* 0x24 */ float unk_24;
    /* 0x28 */ float unk_28;
    /* 0x2C */ Vec *unk_2C;
    /* 0x30 */ Vec *unk_30;
    /* 0x34 */ void *unk_34;
    /* 0x38 */ void *unk_38;
    /* 0x3C */ char pad_3C[4];
    /* 0x40 */ s32 unk_40;
    /* 0x44 */ Vec *unk_44[2];
    /* 0x4C */ char pad_4C[8];
    /* 0x54 */ GXColor *unk_54[2];
    /* 0x5C */ s32 unk_5C;
    /* 0x60 */ void *unk_60;
    /* 0x64 */ u32 unk_64;
    /* 0x68 */ u32 unk_68;
    /* 0x6C */ void *unk_6C;
} M430DllBss60Struct; /* size = 0x70 */

void fn_1_4CB4(omObjData *object);
void fn_1_5DF8(omObjData *object);
void fn_1_6180(M430DllWork *arg0);
void fn_1_6540(M430DllWork *arg0);
void fn_1_6754(M430DllWork *arg0);
void fn_1_6DC8(M430DllWork *arg0);
M430DllUnkStruct2 *fn_1_70AC(omObjData *arg0, s32 arg1, s16 arg2);
void fn_1_732C(omObjData *object, M430DllUnkStruct2 *arg1);
void fn_1_76D8(omObjData *object, M430DllUnkStruct2 *arg1);
void fn_1_7848(omObjData *object);
void fn_1_7CAC(omObjData *object);
void fn_1_7EAC(omObjData *object, M430DllWork2 *arg1);
void fn_1_803C(omObjData *object);
void fn_1_8264(omObjData *object);
void fn_1_82F4(omObjData *object, M430DllBss60Struct *arg1);
void fn_1_86B4(omObjData *object, M430DllBss60Struct *arg1);
void fn_1_8B5C(omObjData *object, M430DllBss60Struct *arg1);
void fn_1_8CE0(ModelData *model, Mtx matrix);
void fn_1_963C(ModelData *model, Mtx matrix, u32 arg2);
void fn_1_9C90(ModelData *model, Mtx matrix);
