#include "msm/msmstream.h"
#include "msm/msmmem.h"
#include "msm/msmsys.h"

typedef struct {
    /* 0x00 */ SND_STREAMID stid;
    /* 0x04 */ s16 streamId;
    /* 0x06 */ u8 status;
    /* 0x07 */ u8 stereoF;
    /* 0x08 */ u8 volBase;
    /* 0x09 */ u8 vol;
    /* 0x0A */ u8 volFade;
    /* 0x0B */ u8 pauseVol;
    /* 0x0C */ u8 panBase;
    /* 0x0D */ u8 pan;
    /* 0x0E */ s8 slotL;
    /* 0x0F */ s8 slotR;
    /* 0x10 */ u32 pauseLen;
    /* 0x14 */ volatile s32 pauseTime;
    /* 0x18 */ volatile s32 pauseTimeMax;
    /* 0x1C */ s32 fadeVol;
    /* 0x20 */ s32 unk20;
    /* 0x24 */ volatile s32 fadeMaxTime;
    /* 0x28 */ s32 fadeTime;
    /* 0x2C */ s8 span;
    /* 0x2D */ s8 auxA;
    /* 0x2E */ s8 auxB;
    /* 0x30 */ void* streamBuf;
    /* 0x34 */ u32 streamBufSize;
    /* 0x38 */ u32 streamFrq;
    /* 0x3C */ struct {
        volatile u8 bufNo : 1;
        volatile u8 firstF : 1;
        u8 streamOffF : 1;
        u8 readBusyF : 1;
        volatile u8 shutdownF : 1;
        volatile u8 pauseF : 1;
        volatile u8 updateAramF : 1;
    };
    s32 frq;
    /* 0x44 */ SND_ADPCMSTREAM_INFO* adpcmInfo;
    /* 0x48 */ s32 streamBaseOfs;
    /* 0x4C */ u32 streamPos;
    /* 0x50 */ u32 loopLen;
    /* 0X54 */ s32 loopEndOfs;
    /* 0x58 */ u32 streamReadSize;
    /* 0x5C */ void* streamReadBuf;
    /* 0X60 */ s32 streamPosStart;
    /* 0x64 */ u32 unk64;
    /* 0x68 */ s32 unk68;
    /* 0x6C */ s32 unk6C;
    /* 0x70 */ DVDFileInfo file;
} MSM_STREAM_SLOT; // Size 0xAC

static struct {
    /* 0x00 */ s32 sampleFrq;
    /* 0x04 */ u32 bufSize;
    /* 0x08 */ s32 frq;
    /* 0x0C */ s32 pdtEntryNum;
    /* 0x10 */ s8 time;
    /* 0x11 */ u8 masterVol;
    /* 0x12 */ u8 outputMode;
    /* 0x14 */ u32* streamPackList;
    /* 0x18 */ s8* streamPackFlag;
    /* 0x1C */ SND_ADPCMSTREAM_INFO* adpcmParam;
    /* 0x20 */ MSM_STREAM_SLOT* slot;
    MSM_STREAM_HEADER header ATTRIBUTE_ALIGN(32);
} StreamInfo; // Size 0x60

typedef struct {
    /* 0x00 */ u8 vol;
    /* 0x01 */ u8 pan;
    /* 0x02 */ u8 span;
    /* 0x03 */ u8 auxA;
    /* 0x04 */ u8 auxB;
    /* 0x08 */ s32 sampleOfs;
} STREAM_PARAM;

static void msmStreamPauseFade(s32 streamNo);
static void msmStreamFade(s32 streamNo);
static void msmStreamDvdCallback(s32 result, DVDFileInfo* fileInfo);
static void msmStreamStopSub(s32 streamNo, s32 speed);
static void msmStreamDvdCallback2(s32 result, DVDFileInfo* fileInfo);
static u32 msmStreamUpdateFunc(void* buffer1, u32 len1, void* buffer2, u32 len2, u32 user);
static s32 msmStreamSlotInit(MSM_STREAM_SLOT* arg0, MSM_STREAM_PACK* arg1, STREAM_PARAM* arg2, s32 arg3);
static void msmStreamPauseOff(s32 streamNo);
static void msmStreamPauseOn(s32 streamNo, s32 arg1);
static s32 msmStreamPackStartStereo(s32 streamId, MSM_STREAMPARAM *param, s32 sampleOfs);
static s32 msmStreamPackStartMono(s32 streamId, MSM_STREAMPARAM *param, s32 sampleOfs);
static void msmStreamSlotOff(s32 streamNo);

static inline void msmStreamClose(s32 streamNo) {
    MSM_STREAM_SLOT* slot;

    slot = &StreamInfo.slot[streamNo];
    DVDClose(&slot->file);
