#include "msm/msmstream.h"
#include "msm/msmmem.h"
#include "msm/msmsys.h"

typedef struct {
    /* 0x00 */ SND_STREAMID unk00;
    /* 0x04 */ s16 unk04;
    /* 0x06 */ u8 unk06;
    /* 0x07 */ u8 unk07;
    /* 0x08 */ u8 unk08;
    /* 0x09 */ u8 unk09;
    /* 0x0A */ u8 unk0A;
    /* 0x0B */ u8 unk0B;
    /* 0x0C */ u8 unk0C;
    /* 0x0D */ u8 unk0D;
    /* 0x0E */ s8 unk0E;
    /* 0x0F */ s8 unk0F;
    /* 0x10 */ u32 unk10;
    /* 0x14 */ volatile s32 unk14;
    /* 0x18 */ volatile s32 unk18;
    /* 0x1C */ s32 unk1C;
    /* 0x20 */ char unk20[4];
    /* 0x24 */ volatile s32 unk24;
    /* 0x28 */ s32 unk28;
    /* 0x2C */ s8 unk2C;
    /* 0x2D */ s8 unk2D;
    /* 0x2E */ s8 unk2E;
    /* 0x2F */ char unk2F[1];
    /* 0x30 */ void* unk30;
    /* 0x34 */ u32 unk34;
    /* 0x38 */ u32 unk38;
    /* 0x3C */ struct {
        volatile u8 unk3C_0 : 1;
        volatile u8 unk3C_1 : 1;
        u8 unk3C_2 : 1;
        u8 unk3C_3 : 1;
        volatile u8 unk3C_4 : 1;
        volatile u8 unk3C_5 : 1;
        volatile u8 unk3C_6 : 1;
    };
    /* 0x3D */ char unk3D[3];
    /* 0x40 */ s32 unk40;
    /* 0x44 */ SND_ADPCMSTREAM_INFO* unk44;
    /* 0x48 */ s32 unk48;
    /* 0x4C */ u32 unk4C;
    /* 0x50 */ u32 unk50;
    /* 0X54 */ s32 unk54;
    /* 0x58 */ u32 unk58;
    /* 0x5C */ void* unk5C;
    /* 0X60 */ s32 unk60;
    /* 0x64 */ u32 unk64;
    /* 0x68 */ s32 unk68;
    /* 0x6C */ s32 unk6C;
    /* 0x70 */ DVDFileInfo unk70;
} msmStreamUnk20Struct; // Size 0xAC

typedef struct {
    /* 0x00 */ s32 unk00;
    /* 0x04 */ u32 unk04;
    /* 0x08 */ s32 unk08;
    /* 0x0C */ s32 unk0C;
    /* 0x10 */ s8 unk10;
    /* 0x11 */ u8 unk11;
    /* 0x12 */ u8 unk12;
    /* 0x13 */ char unk13[1];
    /* 0x14 */ u32* unk14;
    /* 0x18 */ s8* unk18;
    /* 0x1C */ SND_ADPCMSTREAM_INFO* unk1C;
    /* 0x20 */ msmStreamUnk20Struct* unk20;
    /* 0x24 */ char unk24[0x1C];
    /* 0x40 */ s16 unk40;
    /* 0x42 */ s16 unk42;
    /* 0x44 */ s32 unk44;
    /* 0x48 */ s32 unk48;
    /* 0x4C */ s32 unk4C;
    /* 0x50 */ s32 unk50;
    /* 0x54 */ s32 unk54;
    /* 0x58 */ s32 unk58;
    /* 0x5C */ s32 unk5C;
} msmStreamStruct; // Size 0x60

typedef struct {
    /* 0x00 */ s32 unk00;
    /* 0x04 */ s16 unk04;
    /* 0x06 */ char unk06[2];
} StructSlotInitInnerArg1; // Size 8

typedef struct {
    /* 0x00 */ s8 unk00;
    /* 0x01 */ s8 unk01;
    /* 0x02 */ s8 unk02;
    /* 0x03 */ s8 unk03;
    /* 0x04 */ s8 unk04;
    /* 0x05 */ s8 unk05;
    /* 0x06 */ u16 unk06;
    /* 0x08 */ u32 unk08;
    /* 0x0C */ u32 unk0C;
    /* 0x10 */ StructSlotInitInnerArg1 unk10[2];
} StructSlotInitArg1; // Size unknown

typedef struct {
    /* 0x00 */ u8 unk00;
    /* 0x01 */ u8 unk01;
    /* 0x02 */ u8 unk02;
    /* 0x03 */ u8 unk03;
    /* 0x04 */ u8 unk04;
    /* 0x05 */ char unk05[3];
    /* 0x08 */ s32 unk08;
} StructSlotInitArg2; // Size unknown

static void msmStreamPauseFade(s32 arg0);
static void msmStreamFade(s32 arg0);
static void msmStreamDvdCallback(s32 result, DVDFileInfo* fileInfo);
static void msmStreamStopSub(s32 streamNo, s32 speed);
static void msmStreamDvdCallback2(s32 arg0, DVDFileInfo* arg1);
static u32 msmStreamUpdateFunc(void* buffer1, u32 len1, void* buffer2, u32 len2, u32 user);
static s32 msmStreamSlotInit(msmStreamUnk20Struct* arg0, StructSlotInitArg1* arg1, StructSlotInitArg2* arg2, s32 arg3);

static msmStreamStruct StreamInfo ATTRIBUTE_ALIGN(32);

static inline void msmStreamInline00(s32 streamNo) {
    msmStreamUnk20Struct* temp_ptr;

    temp_ptr = &StreamInfo.unk20[streamNo];
    DVDClose(&temp_ptr->unk70);
    temp_ptr->unk06 = 0;
}

s32 msmStreamGetStatus(int streamNo) {
    msmStreamUnk20Struct* temp_r3;
    s32 var_r4;

    if (streamNo < 0 || streamNo >= StreamInfo.unk44) {
        return 0;
    }
