#include "ext_math.h"
#include "game/audio.h"
#include "game/chrman.h"
#include "game/esprite.h"
#include "game/gamework.h"
#include "game/hsfex.h"
#include "game/hsfman.h"
#include "game/hsfmotion.h"
#include "game/minigame_seq.h"
#include "game/objsub.h"
#include "game/pad.h"
#include "game/printfunc.h"
#include "game/wipe.h"

// #ifndef __MWERKS__
#include "game/frand.h"
// #endif

typedef struct M459DllBss18Struct {
    /* 0x00 */ s32 unk_00;
    /* 0x04 */ s16 unk_04[8];
    /* 0x14 */ s16 unk_14[8];
    /* 0x24 */ u8 unk_24[2];
    /* 0x28 */ s32 unk_28;
    /* 0x2C */ s32 unk_2C;
} M459DllBss18Struct; /* size = 0x30 */

typedef struct M459DllBss4CStruct {
    /* 0x00 */ s16 unk_00[6];
    /* 0x0C */ s32 unk_0C;
    /* 0x10 */ s32 unk_10;
    /* 0x14 */ s32 unk_14;
} M459DllBss4CStruct; /* size = 0x18 */

typedef struct M459DllBss64Struct {
    /* 0x00 */ s32 unk_00;
    /* 0x04 */ s32 unk_04;
    /* 0x08 */ s16 unk_08;
} M459DllBss64Struct; /* size = 0xC */

typedef struct M459DllBss70Struct {
    /* 0x00 */ s32 unk_00;
    /* 0x04 */ s16 unk_04;
    /* 0x08 */ s32 unk_08;
} M459DllBss70Struct; /* size = 0xC */

typedef struct M459DllBss7CStruct {
    /* 0x00 */ s32 unk_00;
    /* 0x04 */ s32 unk_04;
    /* 0x08 */ u32 unk_08;
    /* 0x0C */ s16 unk_0C[2];
} M459DllBss7CStruct; /* size = 0x10 */

typedef struct M459DllBssCCStruct {
    /* 0x000 */ s32 unk_00;
    /* 0x004 */ s32 unk_04;
    /* 0x008 */ s32 unk_08;
    /* 0x00C */ Vec unk_0C;
    /* 0x018 */ float unk_18;
    /* 0x01C */ float unk_1C;
    /* 0x020 */ float unk_20;
    /* 0x024 */ char pad_24[0x4];
    /* 0x028 */ s32 unk_28[5];
    /* 0x03C */ s32 unk_3C[5];
    /* 0x050 */ float unk_50;
    /* 0x054 */ float unk_54;
    /* 0x058 */ float unk_58;
    /* 0x05C */ float unk_5C;
    /* 0x060 */ s16 unk_60;
    /* 0x062 */ s16 unk_62[0xC];
    /* 0x07A */ s16 unk_7A[0xC][6];
    /* 0x10A */ s16 unk_10A[2];
    /* 0x10E */ char pad_10E[2];
} M459DllBssCCStruct; /* size = 0x110 */

typedef struct M459DllBss61CStruct {
    /* 0x00 */ Vec unk_00;
    /* 0x0C */ Vec unk_0C;
    /* 0x18 */ float unk_18;
    /* 0x1C */ float unk_1C;
    /* 0x20 */ float unk_20;
    /* 0x24 */ float unk_24;
    /* 0x24 */ float unk_28;
    /* 0x2C */ float unk_2C;
    /* 0x30 */ float unk_30;
    /* 0x34 */ float unk_34;
    /* 0x38 */ float unk_38;
    /* 0x3C */ char unk3C[0xC];
    /* 0x48 */ Vec unk_48;
    /* 0x54 */ Vec unk_54;
    /* 0x60 */ char unk60[0xC];
    /* 0x6C */ float unk_6C;
    /* 0x70 */ float unk_70;
    /* 0x74 */ float unk_74;
    /* 0x78 */ float unk_78;
} M459DllBss61CStruct; /* size = 0x7C */

typedef struct M459DllData70Struct {
    /* 0x00 */ Vec unk_00;
    /* 0x0C */ Vec unk_0C;
    /* 0x18 */ GXColor unk_18;
} M459DllData70Struct; /* size = 0x1C */

void fn_1_11DC(float arg8, float arg9, float argA);
void fn_1_1204(float arg8, float arg9, float argA);
void fn_1_122C(void);
void fn_1_14B8(void);
void fn_1_19B4(M459DllBssCCStruct *arg0);
void fn_1_1A00(M459DllBssCCStruct *arg0);
void fn_1_1D8(void);
void fn_1_1FDC(M459DllBssCCStruct *arg0);
void fn_1_2044(M459DllBssCCStruct *arg0);
void fn_1_21AC(M459DllBssCCStruct *arg0);
void fn_1_23AC(M459DllBssCCStruct *arg0);
void fn_1_25C8(M459DllBssCCStruct *arg0);
void fn_1_27C8(M459DllBssCCStruct *arg0);
void fn_1_2930(M459DllBssCCStruct *arg0);
void fn_1_2B24(M459DllBssCCStruct *arg0);
void fn_1_2F18(M459DllBssCCStruct *arg0);
void fn_1_3004(M459DllBssCCStruct *arg0);
void fn_1_338C(M459DllBssCCStruct *arg0, float arg8);
void fn_1_3700(M459DllBssCCStruct *arg0);
void fn_1_4160(M459DllBssCCStruct *arg0);
float fn_1_4210(float arg8, float arg9, float argA);
void fn_1_4314(s32 arg0, u32 arg1);
void fn_1_4530(void);
