#include "ext_math.h"
#include "game/armem.h"
#include "game/audio.h"
#include "game/hsfman.h"
#include "game/hsfmotion.h"
#include "game/objsub.h"
#include "game/pad.h"
#include "game/printfunc.h"
#include "game/sprite.h"
#include "game/window.h"
#include "game/wipe.h"

#include "REL/mpexDll.h"

typedef void (*MpexDllUnkFunc2)(omObjData *, ...);

typedef struct MpexDllUnkStruct4 {
    /* 0x00 */ omObjData *unk_00;
    /* 0x04 */ MpexDllUnkFunc2 unk_04;
    /* 0x08 */ s32 unk_08;
    /* 0x0C */ s32 unk_0C;
    /* 0x10 */ s32 unk_10;
    /* 0x14 */ s32 unk_14;
    /* 0x18 */ char pad_18[0x10]; /* maybe part of unk_14[5]? */
    /* 0x28 */ s32 unk_28;
    /* 0x2C */ s32 unk_2C;
    /* 0x30 */ s32 unk_30;
    /* 0x34 */ s32 unk_34;
    /* 0x38 */ char pad_38[0x10]; /* maybe part of unk_34[5]? */
    /* 0x48 */ s32 unk_48;
    /* 0x4C */ s32 unk_4C;
    /* 0x50 */ s32 unk_50;
    /* 0x54 */ s32 unk_54;
    /* 0x58 */ s32 unk_58;
    /* 0x5C */ s32 unk_5C;
} MpexDllUnkStruct4; /* size = 0x60 */

void fn_1_1490C(void);
void fn_1_14B28(void);
void fn_1_14E54(void);
void fn_1_14EF0(void);
void fn_1_151C8(void);
void fn_1_154A4(void);
void fn_1_15774(void);
void fn_1_157C4(void);
void fn_1_15D48(void);
void fn_1_16320(void);
void fn_1_16600(s32 arg0);
void fn_1_16874(s32);
void fn_1_168F0(s32 arg0, s32 arg1);
void fn_1_16D3C(s32 arg0);
void fn_1_17170(s32);
void fn_1_17374(void);
void fn_1_17B04(omObjData *arg0, MpexDllUnkStruct4 *arg1);
void fn_1_18610(MpexDllUnkStruct4 *arg0);
void fn_1_18D30(MpexDllUnkStruct4 *arg0);
void fn_1_18DCC(omObjData *arg0, MpexDllUnkStruct4 *arg1);
s32 fn_1_19A98(MpexDllUnkStruct4 *arg0);
void fn_1_1A3BC(void);
void fn_1_1A5A4(s32 arg0);
void fn_1_1AEFC(s32);
void fn_1_1AF78(s32 arg0);
void fn_1_1B0DC(s32);
void fn_1_1B294(void);
void fn_1_1B338(void);
s32 fn_1_1B42C(s32 arg0);
s32 fn_1_1B4AC(s32 arg0);
float fn_1_1B52C(float, float, float, float); // seems implicit in main.c
