#include "ext_math.h"
#include "game/board/main.h"
#include "game/chrman.h"
#include "game/esprite.h"
#include "game/gamework.h"
#include "game/gamework_data.h"
#include "game/hsfman.h"
#include "game/hsfmotion.h"
#include "game/minigame_seq.h"
#include "game/object.h"
#include "game/objsub.h"
#include "game/pad.h"
#include "game/saveload.h"
#include "game/sprite.h"
#include "game/window.h"
#include "game/wipe.h"
#include "string.h"

#ifndef __MWERKS__
#include "game/hsfex.h"
#include "stdio.h"
#endif

#include "REL/mpexDll.h"

typedef void (*MpexDllUnkFunc2)(omObjData *, ...);

typedef struct MpexDllUnkStruct3 {
    /* 0x00 */ s32 unk_00;
    /* 0x04 */ s32 unk_04;
    /* 0x08 */ s32 unk_08;
    /* 0x0C */ s32 unk_0C;
    /* 0x10 */ s32 unk_10;
} MpexDllUnkStruct3; /* size = 0x14 */

typedef struct MpexDllUnkStruct4 {
    /* 0x00 */ omObjData *unk_00;
    /* 0x04 */ MpexDllUnkFunc2 unk_04;
    /* 0x08 */ s32 unk_08;
    /* 0x0C */ s32 unk_0C;
    /* 0x10 */ s32 unk_10;
    /* 0x14 */ char unk14[0x14];
    /* 0x28 */ s32 unk_28;
    /* 0x2C */ char unk2C[0x1C];
} MpexDllUnkStruct4; /* size = 0x48 */

s32 rand8(void);
float fn_1_1B52C(float arg8, float arg9, float argA, float argB);
float fn_1_1B574(float arg0, float arg1, float arg2, float arg3);
float fn_1_1B64C(float arg0, float arg1, float arg2, float arg3);

void fn_1_1015C(void);
void fn_1_10228(void);
void fn_1_10268(s32 arg0);
void fn_1_1045C(void);
void fn_1_107EC(void);
void fn_1_1085C(void);
void fn_1_10ABC(void);
void fn_1_10C30(void);
void fn_1_110F8(void);
void fn_1_114D4(void);
void fn_1_115A0(void);
void fn_1_115E0(s32 arg0);
void fn_1_117D4(void);
void fn_1_11930(void);
void fn_1_11984(void);
void fn_1_119E0(void);
void fn_1_11A3C(s32 arg0);
void fn_1_11E28(void);
void fn_1_11FC0(omObjData *object, MpexDllUnkStruct4 *arg1);
void fn_1_121E8(void);
void fn_1_125DC(float *arg0, s32 arg1);
void fn_1_32D8(void);
void fn_1_5D40(omObjData *arg0, MpexDllUnkStruct4 *arg1);
void fn_1_7D80(void);
void fn_1_7FC4(omObjData *arg0, MpexDllUnkStruct4 *arg1);
