#include "ext_math.h"
#include "game/audio.h"
#include "game/chrman.h"
#include "game/flag.h"
#include "game/gamework_data.h"
#include "game/hsfanim.h"
#include "game/hsfdraw.h"
#include "game/hsfman.h"
#include "game/hsfmotion.h"
#include "game/memory.h"
#include "game/minigame_seq.h"
#include "game/object.h"
#include "game/objsub.h"
#include "game/pad.h"
#include "game/printfunc.h"
#include "game/sprite.h"
#include "game/window.h"
#include "game/wipe.h"
#include "string.h"

#include "REL/m433Dll.h"

#ifndef __MWERKS__
#include "game/esprite.h"
#include "game/frand.h"
#endif

typedef struct M433PlayerWork {
    s32 unk_00;
    s32 unk_04;
    s32 unk_08;
    s32 unk_0C;
    char unk10[4];
    u32 unk_14;
    u32 unk_18;
    u32 unk_1C;
    s32 unk_20;
    float unk_24;
    float unk_28;
    s32 unk_2C;
    s32 unk_30;
    s32 unk_34;
    s32 unk_38;
    s32 unk_3C;
    s32 unk_40;
    s32 unk_44;
    s32 unk_48;
    s32 unk_4C;
    char unk50[4];
    s32 unk_54;
    char unk58[4];
    s32 unk_5C;
    s32 unk_60;
    s32 unk_64;
    s32 unk_68;
    s32 unk_6C;
    s32 unk_70;
    u32 unk_74;
    u32 unk_78;
    u32 unk_7C;
    u32 unk_80;
    u32 unk_84;
    u32 unk_88;
    s32 unk_8C;
    u32 unk_90;
    char unk94[4];
    float unk_98;
    s16 unk_9C;
    char unk9E[6];
    float unk_A4;
    float unk_A8;
    float unk_AC;
    float unk_B0;
    float unk_B4;
    float unk_B8;
    float unk_BC;
    float unk_C0;
    char unkC4[0x08];
    u32 unk_CC;
    u32 unk_D0;
    u32 unk_D4;
    u32 unk_D8;
    float unk_DC;
    float unk_E0;
    s32 unk_E4;
    s32 unk_E8;
    s32 unk_EC;
    s32 unk_F0;
    s32 unk_F4;
    u32 unk_F8;
    Vec unk_FC;
    Vec unk_108;
    Vec unk_114;
    float unk_120;
    float unk_124;
    Vec unk_128;
    Vec unk_134;
    Vec unk_140;
    omObjData *unk_14C;
} M433PlayerWork; /* size = 0x150 */

typedef struct M433PlayerWork2 {
    char unk00[0x18];
    s16 unk_18;
    char unk1A[0x16];
    float unk_30;
    float unk_34;
    float unk_38;
    char unk3C[0x7C];
    float unk_B8;
    float unk_BC;
    float unk_C0;
    float unk_C4;
    Mtx unk_C8;
    char unkF8[0x44];
} M433PlayerWork2; /* size = 0x13C */

typedef struct M433PlayerWork3SubStruct {
    char unk00[2];
    s16 unk_02[5];
} M433PlayerWork3SubStruct; /* size = 0xC */

typedef struct M433PlayerWork3SubStruct2 {
    char unk00[0x78];
    s16 unk_78;
    s16 unk_7A;
    char unk7C[0x28];
    s16 unk_A4;
    s16 unk_A6;
    char unkA8[0x3E8];
    s32 unk_490[2];
    char unk498[8];
} M433PlayerWork3SubStruct2; /* size = 0x4A0 */

typedef struct M433PlayerWork3 {
    s32 unk_00;
    s32 unk_04;
    s32 unk_08;
    char unk0C[0xC];
    s32 unk_18;
    s32 unk_1C;
    char unk20[0xC];
    s32 unk_2C;
    s32 unk_30;
    char unk34[0x18];
    M433PlayerWork3SubStruct unk_4C[2];
    M433PlayerWork3SubStruct2 unk_64;
} M433PlayerWork3; /* size = 0x504 */

typedef struct M433DllPlayerData24CStruct {
    /* 0x00 */ u16 unk_00;
    /* 0x04 */ float unk_04;
    /* 0x08 */ float unk_08;
    /* 0x0C */ float unk_0C;
    /* 0x10 */ u32 unk_10;
} M433DllPlayerData24CStruct; /* size = 0x14 */

typedef struct M433DllPlayerData6C0Struct {
    /* 0x00 */ s32 unk_00;
    /* 0x04 */ char pad_04[0xC]; /* maybe part of unk_00[4]? */
} M433DllPlayerData6C0Struct; /* size = 0x10 */

typedef struct M433DllPlayerData794Struct {
    /* 0x00 */ s32 unk_00;
    /* 0x04 */ s32 unk_04;
    /* 0x08 */ s32 unk_08;
} M433DllPlayerData794Struct; /* size = 0x0C */

void fn_1_10130(Vec *arg0, u32 arg1);
void fn_1_10260(float arg8, float arg9, u32 arg0, s32 arg1, Vec *arg2);
s32 fn_1_10614(Vec *arg0);
void fn_1_1070C(void);
u32 fn_1_10740(Vec *arg0);
u32 fn_1_107B0(Vec *arg0);
float fn_1_10848(void);
u32 fn_1_108C4(void);
u32 fn_1_10900(void);
float fn_1_10B20(float arg8, Vec *arg0);
s32 fn_1_10D24(Vec *arg0);
u32 fn_1_10EA4(void);
u32 fn_1_10ECC(u32 arg0);
s32 fn_1_10F00(u32 arg0);
u32 fn_1_10F38(u32 arg0);
s32 fn_1_10F6C(u32 arg0);
u32 fn_1_10FDC(void);
s32 fn_1_11004(u32 arg0, s32 arg1);
s32 fn_1_11060(u32 arg0);
float fn_1_11130(Vec *arg0, Vec *arg1, Vec *arg2, Vec *arg3);
void fn_1_5B98(omObjData *object);
void fn_1_6070(omObjData *object);
void fn_1_60C0(omObjData *object);
void fn_1_682C(omObjData *object);
void fn_1_722C(omObjData *object);
void fn_1_74D4(omObjData *object);
void fn_1_8408(omObjData *object);
void fn_1_873C(omObjData *object);
