#include "datadir_enum.h"
#include "dolphin/mtx.h"
#include "ext_math.h"
#include "game/audio.h"
#include "game/chrman.h"
#include "game/flag.h"
#include "game/gamework_data.h"
#include "game/hsfanim.h"
#include "game/hsfdraw.h"
#include "game/hsfman.h"
#include "game/hsfmotion.h"
#include "game/memory.h"
#include "game/minigame_seq.h"
#include "game/object.h"
#include "game/objsub.h"
#include "game/pad.h"
#include "game/printfunc.h"
#include "game/sprite.h"
#include "game/window.h"
#include "game/wipe.h"
#include "string.h"

#include "REL/m433Dll.h"

#ifndef __MWERKS__
#include "game/esprite.h"
#include "game/frand.h"
#endif

typedef struct M433PlayerWork {
    s32 unk_00;
    s32 unk_04;
    s32 unk_08;
    s32 unk_0C;
    u32 unk_10;
    u32 unk_14;
    u32 unk_18;
    u32 unk_1C;
    s32 unk_20;
    float unk_24;
    float unk_28;
    s32 unk_2C;
    s32 unk_30;
    s32 unk_34;
    s32 unk_38;
    s32 unk_3C;
    s32 unk_40;
    s32 unk_44;
    s32 unk_48;
    s32 unk_4C;
    char unk50[4];
    s32 unk_54;
    s32 unk_58;
    s32 unk_5C;
    s32 unk_60;
    s32 unk_64;
    s32 unk_68;
    s32 unk_6C;
    s32 unk_70;
    u32 unk_74;
    u32 unk_78;
    u32 unk_7C;
    u32 unk_80;
    u32 unk_84;
    u32 unk_88;
    s32 unk_8C;
    u32 unk_90;
    char unk94[4];
    float unk_98;
    s16 unk_9C;
    char unk9E[6];
    float unk_A4;
    float unk_A8;
    float unk_AC;
    float unk_B0;
    float unk_B4;
    float unk_B8;
    float unk_BC;
    float unk_C0;
    char unkC4[8];
    u32 unk_CC;
    u32 unk_D0;
    u32 unk_D4;
    u32 unk_D8;
    float unk_DC;
    float unk_E0;
    s32 unk_E4;
    s32 unk_E8;
    s32 unk_EC;
    s32 unk_F0;
    s32 unk_F4;
    u32 unk_F8;
    Vec unk_FC;
    Vec unk_108;
    Vec unk_114;
    float unk_120;
    float unk_124;
    Vec unk_128;
    Vec unk_134;
    Vec unk_140;
    omObjData *unk_14C;
} M433PlayerWork; /* size = 0x150 */

typedef struct M433PlayerWork2Sub {
    float unk_00;
    float unk_04;
    float unk_08;
    float unk_0C;
    float unk_10;
    float unk_14;
    float unk_18;
    float unk_1C;
    float unk_20;
    float unk_24;
    float unk_28;
    Vec unk_2C;
    Vec unk_38;
} M433PlayerWork2Sub; /* size = 0x44 */

typedef struct M433PlayerWork2 {
    s32 unk_00;
    s32 unk_04;
    s32 unk_08;
    s32 unk_0C;
    s32 unk_10;
    char unk14[4];
    u16 unk_18;
    char unk1A[0x16];
    Vec unk_30;
    Vec unk_3C;
    float unk_48;
    Vec unk_4C;
    char unk58[0x14];
    u32 unk_6C;
    s32 unk_70;
    s32 unk_74;
    u32 unk_78;
    float unk_7C[2];
    float unk_84[2];
    s32 unk_8C;
    u32 unk_90;
    u32 unk_94;
    s32 unk_98;
    float unk_9C;
    float unk_A0;
    float unk_A4;
    float unk_A8;
    Vec unk_AC;
    float unk_B8;
    Vec unk_BC;
    Mtx unk_C8;
    M433PlayerWork2Sub unk_F8;
} M433PlayerWork2; /* size = 0x13C */

typedef struct M433PlayerWork3Sub {
    s16 unk_00;
    s16 unk_02[5];
} M433PlayerWork3Sub; /* size = 0xC */

typedef struct M433PlayerWork3Sub2Sub {
    s16 unk_00[2];
    float unk_04[2];
    float unk_0C;
    float unk_10;
    float unk_14;
    float unk_18;
    float unk_1C;
    float unk_20;
    float unk_24;
    float unk_28;
} M433PlayerWork3Sub2Sub; /* size 0x2C */

typedef struct M433PlayerWork3Sub2Sub2 {
    s32 unk_00[2];
    char unk08[8];
} M433PlayerWork3Sub2Sub2; /* size 0x10 */

typedef struct M433PlayerWork3Sub2 {
    s32 unk_00;
    u32 unk_04;
    u32 unk_08;
    s32 unk_0C;
    s32 unk_10;
    s32 unk_14[2];
    u32 unk_1C;
    M433PlayerWork3Sub2Sub unk_20[4];
    M433PlayerWork3Sub2Sub2 unk_D0[3][0x14];
    M433PlayerWork3Sub2Sub2 unk_490;
} M433PlayerWork3Sub2; /* size = 0x4A0 */

typedef struct M433PlayerWork3 {
    u32 uGameEvent;
    s32 sWinGrp;
    u32 uServeGrp;
    u32 uPointGrp;
    u32 auServeCel[2];
    u32 auEvents[2];
    u32 unk_20[2];
    u32 unk_28;
    s32 unk_2C;
    s32 unk_30;
    u32 uContactCnt;
    s32 sGroundGrp;
    u32 uContactGrp;
    u32 uContactCel;
    u32 uTargetGrp;
    u32 unk_48;
    M433PlayerWork3Sub unk_4C[2];
    M433PlayerWork3Sub2 unk_64;
} M433PlayerWork3; /* size = 0x504 */

typedef struct M433DllPlayerData24CStruct {
    /* 0x00 */ u16 unk_00;
    /* 0x04 */ float unk_04;
    /* 0x08 */ float unk_08;
    /* 0x0C */ float unk_0C;
    /* 0x10 */ u32 unk_10;
} M433DllPlayerData24CStruct; /* size = 0x14 */

typedef struct M433DllPlayerData794Struct {
    /* 0x00 */ s32 unk_00;
    /* 0x04 */ s32 unk_04;
    /* 0x08 */ s32 unk_08;
} M433DllPlayerData794Struct; /* size = 0x0C */

void fn_1_10130(Vec *arg0, u32 arg1);
void fn_1_10260(float arg8, float arg9, u32 arg0, u32 arg1, Vec *arg2);
s32 fn_1_10614(Vec *arg0);
void fn_1_1070C(void);
u32 fn_1_10740(Vec *arg0);
u32 fn_1_107B0(Vec *arg0);
float fn_1_10848(void);
u32 fn_1_108C4(void);
u32 fn_1_10900(void);
float fn_1_10B20(float arg8, Vec *arg0);
s32 fn_1_10D24(Vec *arg0);
u32 fn_1_10EA4(void);
u32 fn_1_10ECC(u32 arg0);
s32 fn_1_10F00(u32 arg0);
u32 fn_1_10F38(u32 arg0);
s32 fn_1_10F6C(u32 arg0);
u32 fn_1_10FDC(void);
s32 fn_1_11004(u32 arg0, s32 arg1);
s32 fn_1_11060(u32 arg0);
float fn_1_11130(Vec *arg0, Vec *arg1, Vec *arg2, Vec *arg3);
void fn_1_5B98(omObjData *object);
void fn_1_6070(omObjData *object);
void fn_1_60C0(omObjData *object);
void fn_1_682C(omObjData *object);
void fn_1_722C(omObjData *object);
void fn_1_74D4(omObjData *object);
void fn_1_8408(omObjData *object);
void fn_1_873C(omObjData *object);
