#include "REL/executor.h"
#include "game/chrman.h"
#include "game/frand.h"
#include "game/gamework.h"
#include "game/minigame_seq.h"
#include "game/object.h"
#include "game/objsub.h"
#include "game/wipe.h"

#include "game/gamework_data.h"

#include "game/mapspace.h"
#include "game/pad.h"
#include "game/printfunc.h"

#include "game/hsfanim.h"
#include "game/hsfdraw.h"
#include "game/hsfman.h"
#include "game/hsfmotion.h"

#include "game/esprite.h"
#include "game/sprite.h"

#include "ext_math.h"

#ifndef __MWERKS__
#include "game/audio.h"
#endif

#undef ABS
#define ABS(x) ((0 > (x)) ? -(x) : (x))

typedef struct unk_bss_358_struct {
    /* 0x00 */ u16 unk00;
    /* 0x02 */ s16 unk02;
    /* 0x04 */ struct unk_bss_358_struct *unk04;
    /* 0x08 */ struct unk_bss_358_struct *unk08;
} UnkBss254Struct; // Size 0xC

typedef struct unk_bss_340_struct {
    /* 0x00 */ HsfanimStruct00 *unk00;
    /* 0x04 */ s32 *unk04;
    /* 0x08 */ s32 unk08;
    /* 0x0C */ s32 unk0C;
    /* 0x10 */ struct unk_bss_340_struct *unk10;
    /* 0x14 */ struct unk_bss_340_struct *unk14;
} UnkBss23CStruct; // Size 0x18

typedef struct {
    /* 0x00 */ u32 unk00;
    /* 0x04 */ s16 unk04;
} UnkBssACStruct; // Size 8

UnkBss254Struct lbl_1_bss_254;
UnkBss23CStruct lbl_1_bss_23C;
Process *lbl_1_bss_238;
Vec lbl_1_bss_22C;
Vec lbl_1_bss_220;
Vec lbl_1_bss_214;
Vec lbl_1_bss_208;
u32 lbl_1_bss_204;
s32 lbl_1_bss_200;
u32 lbl_1_bss_1FC;
s16 lbl_1_bss_1FA;
s16 lbl_1_bss_1F8;
s32 lbl_1_bss_1F4;
s32 lbl_1_bss_1F0;
float lbl_1_bss_1EC;
s32 lbl_1_bss_1AC[16];
UnkBssACStruct lbl_1_bss_AC[32];

void fn_1_0(void)
{
    lbl_1_bss_254.unk04 = NULL;
    lbl_1_bss_254.unk08 = NULL;
}

void fn_1_24(u16 arg0, s16 arg1)
{
    UnkBss254Struct *temp_r31;
    UnkBss254Struct *temp_r30;
    UnkBss254Struct *temp_r29;

    temp_r31 = HuMemDirectMallocNum(HEAP_SYSTEM, sizeof(*temp_r31), MEMORY_DEFAULT_NUM);
    temp_r31->unk00 = arg0;
    temp_r31->unk02 = arg1;
    temp_r30 = &lbl_1_bss_254;
    temp_r29 = temp_r30->unk08;
    temp_r30->unk08 = temp_r31;
    if (NULL != temp_r29) {
        temp_r29->unk04 = temp_r31;
    }
    temp_r31->unk04 = temp_r30;
