#include "REL/m437Dll.h"
#include "game/chrman.h"
#include "game/data.h"
#include "game/gamework.h"
#include "game/gamework_data.h"
#include "game/hsfdraw.h"
#include "game/hsfman.h"
#include "game/hsfmotion.h"
#include "game/minigame_seq.h"
#include "game/objsub.h"
#include "game/pad.h"
#include "game/printfunc.h"
#include "game/process.h"
#include "game/sprite.h"
#include "game/window.h"
#include "game/wipe.h"

#include "dolphin.h"
#include "math.h"
#include "string.h"
#include "version.h"

typedef struct {
    /* 0x000 */ omObjData *unk00;
    /* 0x004 */ s32 unk04;
    /* 0x008 */ s32 unk08;
    /* 0x00C */ s32 unk0C;
    /* 0x010 */ s32 unk10;
    /* 0x014 */ s32 unk14;
    /* 0x018 */ char unk18[4];
    /* 0x01C */ s32 unk1C;
    /* 0x020 */ s32 unk20;
    /* 0x024 */ s32 unk24;
    /* 0x028 */ s32 unk28;
    /* 0x02C */ s32 unk2C;
    /* 0x030 */ s32 unk30;
    /* 0x034 */ s32 unk34;
    /* 0x038 */ s32 unk38;
    /* 0x03C */ s32 unk3C;
    /* 0x040 */ s32 unk40;
    /* 0x044 */ float unk44;
    /* 0x048 */ float unk48;
    /* 0x04C */ float unk4C;
    /* 0x050 */ StructFn15CD0 unk50;
} StructBss1DC; // Size 0x138

typedef struct {
    /* 0x00 */ omObjData *unk00;
    /* 0x04 */ s32 unk04;
    /* 0x08 */ s32 unk08;
    /* 0x0C */ s32 unk0C;
    /* 0x10 */ s32 unk10;
    /* 0x14 */ s32 unk14;
    /* 0x18 */ s32 unk18;
    /* 0x1C */ s32 unk1C;
    /* 0x20 */ s32 unk20;
} StructBss920; // Size 0x24

typedef struct {
    /* 0x00 */ s32 unk00;
    /* 0x04 */ s32 unk04;
    /* 0x08 */ s32 unk08;
    /* 0x0C */ s32 unk0C;
    /* 0x10 */ s32 unk10;
} StructFn3410; // Size 0x14

typedef struct {
    /* 0x00 */ omObjData *unk00;
    /* 0x04 */ s32 unk04;
    /* 0x08 */ s32 unk08;
    /* 0x0C */ s32 unk0C;
    /* 0x10 */ s32 unk10;
    /* 0x14 */ s32 unk14;
    /* 0x18 */ s32 unk18;
    /* 0x1C */ s32 unk1C;
    /* 0x20 */ s32 unk20;
    /* 0x24 */ float unk24;
} StructBss8D4; // Size 0x28

typedef struct {
    /* 0x000 */ omObjData *unk00;
    /* 0x004 */ s32 unk04;
    /* 0x008 */ s32 unk08;
    /* 0x00C */ s32 unk0C;
    /* 0x010 */ s32 unk10;
    /* 0x014 */ s32 unk14;
    /* 0x018 */ s32 unk18;
    /* 0x01C */ s32 unk1C;
    /* 0x020 */ s32 unk20;
    /* 0x024 */ StructFn15CD0 unk24;
} StructBss6BC; // Size 0x10C

typedef struct {
    /* 0x00 */ omObjData *unk00;
    /* 0x04 */ s32 unk04;
    /* 0x08 */ s32 unk08;
    /* 0x0C */ s32 unk0C;
    /* 0x10 */ s32 unk10;
    /* 0x14 */ s32 unk14;
    /* 0x18 */ s32 unk18;
    /* 0x1C */ s32 unk1C;
    /* 0x20 */ s32 unk20;
} StructBss8FC; // Size 0x24

typedef struct {
    /* 0x00 */ omObjData *unk00;
    /* 0x04 */ s32 unk04;
    /* 0x08 */ s32 unk08;
    /* 0x0C */ s32 unk0C;
    /* 0x10 */ s32 unk10;
    /* 0x14 */ s32 unk14;
    /* 0x18 */ s32 unk18;
    /* 0x1C */ s32 unk1C;
    /* 0x20 */ s32 unk20;
    /* 0x24 */ float unk24[7];
    /* 0x40 */ char unk40[4];
    /* 0x44 */ float unk44[7];
    /* 0x60 */ char unk60[4];
    /* 0x64 */ float unk64[7];
    /* 0x80 */ char unk80[4];
    /* 0x84 */ float unk84[7];
    /* 0xA0 */ char unkA0[4];
    /* 0xA4 */ float unkA4[7];
    /* 0xC0 */ char unkC0[4];
    /* 0xC4 */ float unkC4[7];
    /* 0xE0 */ char unkE0[4];
} StructBss68; // Size 0xE4

typedef struct {
    /* 0x00 */ s32 unk00;
    /* 0x04 */ s32 unk04;
    /* 0x08 */ s32 unk08;
    /* 0x0C */ s32 unk0C;
    /* 0x10 */ s32 unk10;
    /* 0x14 */ s32 unk14;
    /* 0x18 */ s32 unk18;
    /* 0x1C */ s32 unk1C;
    /* 0x20 */ s32 unk20;
} StructBss944; // Size 0x24

typedef struct {
    /* 0x00 */ s32 unk00;
    /* 0x04 */ s32 unk04;
    /* 0x08 */ char unk08[0x38];
} StructBss968; // Size 0x40

void fn_1_0(void);
void fn_1_1A8(void);
void fn_1_230(s32 arg0, s32 arg1, float arg2);
void fn_1_298(s32 arg0, float arg1);
float fn_1_304(s32 arg0);
void fn_1_434(void);
void fn_1_4C0(void);
void fn_1_8A4(void (*arg0)(void));
void fn_1_8C4(void (*arg0)(void));
void fn_1_8E4(omObjData *arg0);
void fn_1_F8C(void);
void fn_1_10C0(void);
void fn_1_1184(s32 arg0);
s32 fn_1_11BC(void);
void fn_1_11E0(void);
void fn_1_1218(omObjData *arg0);
void fn_1_13E8(void);
void fn_1_144C(s32 arg0, float arg1, float arg2, s32 arg3);
void fn_1_1A90(void);
void fn_1_1AB4(s32 arg0, float arg1, float arg2);
s32 fn_1_1F0C(float arg0, float arg1, float arg2, float arg3, s32 arg4);
s32 fn_1_20F8(float arg0, float arg1, float arg2, float arg3, s32 arg4);
void fn_1_22E4(s32 arg0, float arg1, float arg2);
void fn_1_273C(s32 arg0);
void fn_1_27A4(s32 arg0);
void fn_1_280C(s32 arg0, s32 arg1);
void fn_1_28F4(s32 arg0);
